//============================================================================
/**
 *
 *  @file   box_search.h
 *  @brief  新規アプリ用テンプレート
 *  @author Toru=Nagihashi / genya hosaka
 *  @data   2009.09.29
 *  @note   1.ファイルをコピペします。
 *  @note   2.BOXSEARCH / BOX_SEARCH / box_search をアプリ名にリネームしてください。
 *  @note   3.HEAPID_UI_DEBUG をアプリ用のヒープに書き換えてください。
 *  @note   4.不要な要素を外します
 *
 */
//============================================================================
#pragma once
//  lib
#include <gflib.h>

//system
#include "gamesystem/gamesystem.h"
#include "box2_main.h"

//=============================================================================
/**
 *          外部公開
*/
//=============================================================================
extern const GFL_PROC_DATA BOXSEARCHProcData;

//=============================================================================
/**
 *                定数定義
 */
//=============================================================================

//=============================================================================
/**
 *                構造体定義
 */
//=============================================================================
//-------------------------------------
/// PROCに渡す引数
//=====================================
typedef struct
{ 
  GAMESYS_WORK        *gamesys; //[in]ゲームシステム
  BOX2_SYS_WORK       *syswk;   //[in/out]ボックスシステム
  BOX2_GFL_PROC_PARAM *box_dat; //[in]ボックス呼び出しパラメータ
}BOX_SEARCH_PARAM;

