//============================================================================
/**
 *
 *	@file		bg_planm_data.h
 *	@brief		BGパレットアニメデータ用ヘッダ
 *	@author		hosaka genya
 *	@data		2008.05.27
 *
 */
//============================================================================
#pragma once

//--------------------------------------------------------------
///	定数
//==============================================================
enum 
{
	// -- 終了文字 --
	BG_PLANM_PLTT_DATA_END	= 255,		///< パレット配列の終了文字
	BG_PLANM_CELL_WAIT_END	= 65432,
	BG_PLANM_DAT_MAX = 128,				///< パレット
};

//--------------------------------------------------------------
// u8  : unsigned char 
// u16 : unsigned short int
// u32 : unsigned long
//--------------------------------------------------------------
///	データ保持テーブル
//==============================================================
typedef struct {
	unsigned char		pltt_no[ BG_PLANM_DAT_MAX ];
	unsigned short int	wait[ BG_PLANM_DAT_MAX ];
} BG_PLANM_CONV_DATA;

