//============================================================================
/**
 *
 *	@file		fes_rom_sys.h
 *	@brief  フェス配信ロムシステムプロセス
 *	
 *	@author	Miyuki Iwasawa
 *	@data		2012.03.29
 */
//============================================================================
#pragma once
//	lib
#include <gflib.h>

//system
#include "gamesystem/gamesystem.h"

//=============================================================================
/**
 *					外部公開
*/
//=============================================================================
extern const GFL_PROC_DATA FesRomSysProcData;

//=============================================================================
/**
 *								定数定義
 */
//=============================================================================

//=============================================================================
/**
 *								構造体定義
 */
//=============================================================================
//-------------------------------------
///	PROCに渡す引数
//=====================================
typedef struct
{	
	GAMESYS_WORK		*gsys;	//[in]ゲームシステム
	GAMEDATA				*gdata;	//[in]ゲームシステム
  u8              target; //リストのトップに表示する
  u8              view_ofs; //詳細画面コール時のターゲットのすれ違いログのViewオフセット
  u8              ret_mode; //TRUEならCギアに戻る
}FES_ROM_SYSTEM_PARAM;

extern const GFL_PROC_DATA FesRomSysProcData;
FS_EXTERN_OVERLAY(fes_rom);

