//======================================================================
/**
 * @file  scr_gmk_timing_def.h
 * @brief  メロディアイベントタイミング定義群
 * @author  Saito
 * @note    松島さんが編集します
 */
//======================================================================
#pragma once

//↓スクリプトが使用します

/*
 * メモ
 *
 *  566fあたり
 *  ボイスフォルムからステップフォルムに変化
 *
 *  847fあたり
 *  ステップフォルムからボイスフォルムに変化
 *
 * */


#define MERODHIA_DANCE_WAIT       (30)    //ダンス開始
#define MERODHIA_CAMERA_WAIT      (175)   //カメラ移動開始
#define MERODHIA_STER_ANIME       (361)   //ステップフォルム開始 361+175+30 = 566

#define MERODHIA_VOICE_ANIME      (281)   //ボイスフォルムに戻った時 847-566 = 281


