//======================================================================
/**
 * @file    scr_gmk_timing_def.h
 * @brief   メロディアイベントタイミング定義群
 * @author  ichiraku=katsuhiko
 */
//======================================================================
#pragma once

//↓スクリプトが使用します

/*
 * メモ
 *
 *  566fあたり
 *  ボイスフォルムからステップフォルムに変化
 *
 *  847fあたり
 *  ステップフォルムからボイスフォルムに変化
 *
 * */


#define MERODHIA_CAMERA_WAIT      (129)   //カメラ移動開始
#define MERODHIA_STER_ANIME       (437)   //ステップフォルム開始 435+129+2 = 566

#define MERODHIA_VOICE_ANIME      (261)   //ボイスフォルムに戻った時 847-566 -20 = 261
                                          // -20は調整


