//[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[
/**
 *
 *  @file   gpower_app_graphic.h
 *  @brief  デルパワー使用画面
 *  @author
 *  @date
 *
 */
//]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]
#pragma once
#include <gflib.h>

//=============================================================================
/**
 *          定数宣言
*/
//=============================================================================

//=============================================================================
/**
 *          構造体宣言
*/
//=============================================================================
//-------------------------------------
/// グラフィックワーク
//=====================================
typedef struct _GPOWER_APP_GRAPHIC_WORK  GPOWER_APP_GRAPHIC_WORK;

//=============================================================================
/**
 *          プロトタイプ宣言
*/
//=============================================================================
//-------------------------------------
///初期化
//  ディスプレイセレクトにはGX_DISP_SELECT_MAIN_SUB or GX_DISP_SELECT_SUB_MAINを
//  渡してください。途中で書き換えたい場合、GFL_DISP_SetDispSelectを使用して下さい。
//=====================================
extern GPOWER_APP_GRAPHIC_WORK * GPOWER_APP_GRAPHIC_Init( int display_select, HEAPID heapID );

//-------------------------------------
///破棄
//=====================================
extern void GPOWER_APP_GRAPHIC_Exit( GPOWER_APP_GRAPHIC_WORK *p_wk );

//-------------------------------------
///２D描画
//=====================================
extern void GPOWER_APP_GRAPHIC_2D_Draw( GPOWER_APP_GRAPHIC_WORK *p_wk );

//-------------------------------------
///３D描画  ３Dを使わない場合、読んでも何もしません
//=====================================
extern void GPOWER_APP_GRAPHIC_3D_StartDraw( GPOWER_APP_GRAPHIC_WORK *p_wk );
extern void GPOWER_APP_GRAPHIC_3D_EndDraw(   GPOWER_APP_GRAPHIC_WORK *p_wk );

//-------------------------------------
///情報取得 内部で設定したCLUNITを返します  OBJ使わない場合NULL
//=====================================
extern GFL_CLUNIT * GPOWER_APP_GRAPHIC_GetClunit( const GPOWER_APP_GRAPHIC_WORK *cp_wk );

//-------------------------------------
///情報取得 内部で設定したカメラを返します  3D使わない場合NULL
//=====================================
extern GFL_G3D_CAMERA * GPOWER_APP_GRAPHIC_GetCamera( const GPOWER_APP_GRAPHIC_WORK *cp_wk );

