#/[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[
#**
#*
#*	@file		area_tr_member_num.rb
#*	@brief  無限ダンジョンフロアごとのトレーナー人数ハッシュ(ボス部屋配置時最大)
#*	@author	Masayuki Onoue
#*	@date		2011.11.24
#*  @note   コンバータによって出力されたファイルです
#*
#*/
#/]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]

$area_tr_member_num_w = [
  10, # エリア 1
  10, # エリア 2
  11, # エリア 3
  18, # エリア 4
  17, # エリア 5
  12, # エリア 6
  15, # エリア 7
  27, # エリア 8
  30, # エリア 9
  30, # エリア 10
]
$area_tr_member_num_b = [
  10, # エリア 1
  10, # エリア 2
  11, # エリア 3
  18, # エリア 4
  17, # エリア 5
  12, # エリア 6
  15, # エリア 7
  27, # エリア 8
  30, # エリア 9
  30, # エリア 10
]
