=begin
//[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[
/**
 *
 *	@file		map_array_conv.rb
 *	@brief  吹き飛ばしのマップ情報のExcelコンバータ
 *	@author	Katsuhiko=Ichiraku
 *	@date		2011.03.01
 *
 *  @note   飛行ジムの吹き飛ばしの時に飛べる場所か飛べない場所かの
 *          Excelをコンバートして、配列にする
 *          0：飛べる
 *          1：飛べない
 *
 * 手順として、csv形式を読み込んで、データファイルとして書き出す
 */
//]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]
=end

# ファイルオープン

f_old = open( ARGV.to_s, "r" );   # 読み込み
f_new = open( "map_array.cdat", "w" ); # 新規作成書き込み

f_new.print  <<EOS
//=============================================================================
//    map_array_conv.rb で出力されたファイルです
//=============================================================================
EOS

f_new.print "static const int map_array[51][23] = {\n"


# 行分ループ
0.upto(50){ 

  line = f_old.gets
  # 新規ファイルに書き込む
  s = line.split(/,/);

  f_new.print "{ "

  # 列分ループ
  0.upto(22){ |i|
    f_new.print "#{s[i].to_i},"
  }

  f_new.print " },\n"
}


f_new.print "};"    # 構造体の終了

f_old.close
f_new.close

