//============================================================================
/**
 *
 *	@file		fes_rom.h
 *	@brief  フェス配信ロム画面
 *	@author	Miyuki Iwasawa
 *	@data		2012.03.29
 */
//============================================================================
#pragma once
//	lib
#include <gflib.h>

//system
#include "gamesystem/gamesystem.h"

#include "test/fes_rom_sys.h"
#include "fes_rom_sys_local.h"

//=============================================================================
/**
 *					外部公開
*/
//=============================================================================
extern const GFL_PROC_DATA FesRomProcData;

//=============================================================================
/**
 *								定数定義
 */
//=============================================================================

//=============================================================================
/**
 *								構造体定義
 */
//=============================================================================
//-------------------------------------
///	PROCに渡す引数
//=====================================
typedef struct
{	
  FES_ROM_SYS_WORK* sys;  //[in/out]システムワーク
  FESROM_APP_MODE mode;   //呼び出しモード

	GAMESYS_WORK		*gsys;	//[in]ゲームシステム
	GAMEDATA				*gdata;	//[in]ゲームシステム
  u8              target; //リストのトップに表示する
  u8              view_ofs; //詳細画面コール時のターゲットのすれ違いログのViewオフセット
  u8              ret_mode; //TRUEならCギアに戻る
}FES_ROM_PARAM;

