//[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[
//
//
//   @file		animal_trail_def.h
//   @brief   獣道用定数定義
//   @author	Masayuki Onoue
//   @date		2011.05.19
//
//
//]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]
#pragma once

//=============================================================================
//
//					定数宣言
//
//=============================================================================
#define ANIMAL_TRAIL_SELECT_PROBABILITY (5) // 256歩ごとの抽選される確率
#define ANIMAL_TRAIL_NUM        (20)  // けものみちの数
#define ANIMAL_TRAIL_TABLE_NUM  (11)  // ランクテーブルの数

//-------------------------------------
///	けものみち：配置されるオブジェクトのタイプ
//=====================================
typedef enum
{
  AT_OBJ_TYPE_NONE,       // 置かれていない
  AT_OBJ_TYPE_MONSTER,    // ポケモン
  AT_OBJ_TYPE_ITEM,       // 通常アイテム
  AT_OBJ_TYPE_HIDE_ITEM,  // 隠しアイテム
}AT_OBJ_TYPE;

