//[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[
/**
 *
 *	@file		event_debug_menu_ov_infinity.h
 *	@brief  無限ダンジョンデバッグ
 *	@author	Masayuki Onoue
 *	@date		2011.03.29
 *
 */
//]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]
#pragma once
#include "event_debug_local.h"

//=============================================================================
//
//					外部公開
//
//=============================================================================
extern BOOL debugMenuCallProc_InfinityDungeon(DEBUG_MENU_EVENT_WORK *wk );
