//[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[
//
//
//   @file		event_debug_menu_ov_animal_trail.h
//   @brief   獣道用デバッグ
//   @author	Masayuki Onoue
//   @date		2011.05.16
//
//
//]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]
#pragma once
#include "event_debug_local.h"

//=============================================================================
//
//					外部公開
//
//=============================================================================
extern BOOL debugMenuCallProc_AnimalTrail(DEBUG_MENU_EVENT_WORK *wk );

