//=============================================================================
/**
 *	@file		src\field\event_debug_menu_ov_pokewood.h
 *	@brief  デバッグメニューポケウッド系オーバーレイ領域
 *	@author	tamada GAMEFREAK inc.
 *	@date		2011.04.28
 *
 */
//=============================================================================
#pragma once

//=============================================================================
//    外部公開
//=============================================================================
extern BOOL debugMenuCallProc_Pokewood( DEBUG_MENU_EVENT_WORK * wk );

