//[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[
/**
 *
 *	@file		event_debug_menu_ov_medalinfo.h
 *  @brief   メダル詳細画面用デバッグ
 *	@author	Masayuki Onoue
 *	@date		2011.05.09
 *
 */
//]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]
#pragma once
#include "event_debug_local.h"

//=============================================================================
//
//					外部公開
//
//=============================================================================
extern BOOL debugMenuCallProc_MedalInfo(DEBUG_MENU_EVENT_WORK *wk );

