//===============================================================================
/*
 *  @file   fmission_gimmick.h
 *  @brief  フェスミッション フィールドギミック
 *  @author Miyuki Iwasawa
 *  @date   11.04.12
 */
//===============================================================================

#pragma once

typedef struct _FES_GIMMICK  FES_GIMMICK;

//----------------------------------------------------------------------
/*
 *  @brief  フェスミッションギミック　管理ワーク初期化
 *
 *  フィールドマップ初期化時にCreateし、フィールド開放時にDeleteする
 */
//----------------------------------------------------------------------
extern FES_GIMMICK* FES_GIMMICK_SYS_Create( LINK_FESTIVAL* fest_sys, FIELDMAP_WORK* fieldWork, HEAPID heapID );

//----------------------------------------------------------------------
/*
 *  @brief  フェスミッションギミック　管理ワーク開放
 */
//----------------------------------------------------------------------
extern void FES_GIMMICK_SYS_Delete( FES_GIMMICK* wk );


//----------------------------------------------------------------------
/*
 *  @brief  フェスミッションギミック　マップ遷移後処理
 */
//----------------------------------------------------------------------
extern void FES_GIMMICK_MapChangeSetup( LINK_FESTIVAL* fest_sys, GAMESYS_WORK* gsys, u16 zone_id );

//----------------------------------------------------------------------
/*
 *  @brief  フェスミッションギミック 削除　
 */
//----------------------------------------------------------------------
extern void FES_GIMMICK_Delete( LINK_FESTIVAL* fest_sys, GAMESYS_WORK* gsys );

//----------------------------------------------------------------------
/*
 *  @brief  フェスミッションギミック　フラグセット
 */
//----------------------------------------------------------------------
extern void FES_GIMMICK_FlagSet( LINK_FESTIVAL* fest_sys, u16 zone_id, u16 idx );

