//===============================================================================
/*
 *  @file   fmission_gimmick.h
 *  @brief  フェスミッション フィールドギミック
 *  @author Miyuki Iwasawa
 *  @date   11.04.12
 */
//===============================================================================

#pragma once

typedef struct _FES_GIMMICK  FES_GIMMICK;

//----------------------------------------------------------------------
/*
 *  @brief  フェスミッションギミック　管理ワーク初期化
 *
 *  フィールドマップ初期化時にCreateし、フィールド開放時にDeleteする
 */
//----------------------------------------------------------------------
extern FES_GIMMICK* FES_GIMMICK_SYS_Create( GAMESYS_WORK* gsys, FIELDMAP_WORK* fieldWork, HEAPID heapID );

//----------------------------------------------------------------------
/*
 *  @brief  フェスミッションギミック　管理ワーク開放
 */
//----------------------------------------------------------------------
extern void FES_GIMMICK_SYS_Delete( FES_GIMMICK* wk );


//----------------------------------------------------------------------
/*
 *  @brief  フェスミッションギミック　ゾーン遷移時処理
 */
//----------------------------------------------------------------------
extern void FES_GIMMICK_ZoneChangeSetup( FES_GIMMICK* wk, u16 zone_id );

//----------------------------------------------------------------------
/*
 *  @brief  フェスミッションギミック　フィールド復帰処理
 */
//----------------------------------------------------------------------
extern void FES_GIMMICK_FieldRecoverSetup( FES_GIMMICK* wk );

//----------------------------------------------------------------------
/*
 *  @brief  フェスミッションギミック 削除　
 */
//----------------------------------------------------------------------
extern void FES_GIMMICK_Delete( LINK_FESTIVAL* fest_sys, GAMESYS_WORK* gsys );

//----------------------------------------------------------------------
/*
 *  @brief  フェスミッションギミック イベントチェック
 *
 *  @param  wk
 *  @param  cp_pos  プレイヤー座標
 */
//----------------------------------------------------------------------
extern GMEVENT* FES_GIMMICK_CheckPosEventGrid( FES_GIMMICK* wk, const VecFx32* cp_pos );

//----------------------------------------------------------------------
/*
 *  @brief  フェスミッションギミック イベントチェック
 *
 *  @param  wk
 *  @param  cp_location  プレイヤー座標
 */
//----------------------------------------------------------------------
extern GMEVENT* FES_GIMMICK_CheckPosEventRail( FES_GIMMICK* wk, const RAIL_LOCATION* cp_location );


//----------------------------------------------------------------------
/*
 *  @brief  フェスミッションギミック　フラグセット
 */
//----------------------------------------------------------------------
extern void FES_GIMMICK_FlagSet( LINK_FESTIVAL* fest_sys, u16 zone_id, u16 idx );

