//===============================================================================
/*
 *  @file   fmission_gimmick.h
 *  @brief  フェスミッション フィールドギミック
 *  @author Miyuki Iwasawa
 *  @date   11.04.12
 */
//===============================================================================

#pragma once

typedef struct _FES_GIMMICK  FES_GIMMICK;

//////////////////////////////////////////////////////////////////////////////////
//NOTWIFI
//////////////////////////////////////////////////////////////////////////////////
//----------------------------------------------------------------------
/*
 *  @brief  フェスミッションギミック　ゾーン遷移時処理
 */
//----------------------------------------------------------------------
extern void FES_GIMMICK_ZoneChangeSetup( GAMESYS_WORK* gsys, u16 zone_id );


//////////////////////////////////////////////////////////////////////////////////
//FIELDMAP
//////////////////////////////////////////////////////////////////////////////////
//----------------------------------------------------------------------
/*
 *  @brief  フェスミッションギミック　管理ワーク初期化
 *
 *  フィールドマップ初期化時にCreateし、フィールド開放時にDeleteする
 */
//----------------------------------------------------------------------
extern FES_GIMMICK* FES_GIMMICK_SYS_Create( GAMESYS_WORK* gsys, FIELDMAP_WORK* fieldWork, HEAPID heapID );

//----------------------------------------------------------------------
/*
 *  @brief  フェスミッションギミック　管理ワーク開放
 */
//----------------------------------------------------------------------
extern void FES_GIMMICK_SYS_Delete( FES_GIMMICK* wk );

//----------------------------------------------------------------------
/*
 *  @brief  フェスミッションギミック　動作モデルセットアップ処理
 *
 *  システム初期化のタイミングだと MMDLSYSが未初期化のため
 *  専用のエフェクト初期化関数を用意
 */
//----------------------------------------------------------------------
extern void FES_GIMMICK_SYS_MMdlSetup( FES_GIMMICK* wk, MMDLSYS* mmdl_sys );

//----------------------------------------------------------------------
/*
 *  @brief  フェスミッションギミック　フェス用フィールドエフェクトを初期化
 *
 *  システム初期化のタイミングだと、フィールドエフェクトが未初期化のため
 *  専用のエフェクト初期化関数を用意
 */
//----------------------------------------------------------------------
extern void FES_GIMMICK_SYS_FldEffSetup( FES_GIMMICK* wk, FLDEFF_CTRL* fectrl, FIELD_PLAYER* f_player );

//----------------------------------------------------------------------
/*
 *  @brief  フェスミッションギミック　フェス用フィールドエフェクトを削除
 */
//----------------------------------------------------------------------
extern void FES_GIMMICK_SYS_FldEffDelete( FES_GIMMICK* wk );

//----------------------------------------------------------------------
/*
 *  @brief  フェスミッションギミック　フィールド復帰処理
 */
//----------------------------------------------------------------------
extern void FES_GIMMICK_FieldRecoverSetup( FES_GIMMICK* wk );

//----------------------------------------------------------------------
/*
 *  @brief  フェスミッションギミック 削除　
 */
//----------------------------------------------------------------------
extern void FES_GIMMICK_Delete( FES_GIMMICK* wk );

//----------------------------------------------------------------------
/*
 *  @brief  フェスミッションギミック イベントチェック
 *
 *  @param  wk
 *  @param  cp_pos  プレイヤー座標
 */
//----------------------------------------------------------------------
extern GMEVENT* FES_GIMMICK_CheckPosEventGrid( FES_GIMMICK* wk, const VecFx32* cp_pos );

//----------------------------------------------------------------------
/*
 *  @brief  フェスミッションギミック イベントチェック
 *
 *  @param  wk
 *  @param  cp_location  プレイヤー座標
 */
//----------------------------------------------------------------------
extern GMEVENT* FES_GIMMICK_CheckPosEventRail( FES_GIMMICK* wk, const RAIL_LOCATION* cp_location );

//----------------------------------------------------------------------
/*
 *  @brief  フェスミッションギミック との当たり判定
 *
 *  @param  wk
 *  @param  cp_location  プレイヤー座標
 */
//----------------------------------------------------------------------
extern BOOL FES_GIMMICK_CheckHitGridPos( FES_GIMMICK* wk, u16 gx, u16 gz, fx32 height );

//----------------------------------------------------------------------
/*
 *  @brief  フェスミッションギミック　フラグセット
 */
//----------------------------------------------------------------------
extern void FES_GIMMICK_FlagSet( LINK_FESTIVAL* fest_sys, u16 zone_id, u16 idx );

