//[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[
//
//
//   @file		field_task_camera_shake.h
//	 @brief   フィールドタスク（カメラ振動）
//   @author	Masayuki Onoue
//   @date		2011.06.28
//
//
//]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]
#pragma once

//=============================================================================
//
//					定数宣言
//
//=============================================================================
enum {
  CAM_SHAKE_TYPE_ALL,             // ターゲット、カメラ位置オフセット両方ずらす
  CAM_SHAKE_TYPE_TARGET_POS,      // ターゲット位置をずらす
  CAM_SHAKE_TYPE_CAM_POS_OFFSET,  // カメラ位置オフセットをずらす
};



//=============================================================================
/**
 *					構造体宣言
*/
//=============================================================================
//===============================================================================
// ■カメラ振動パラメータ
//===============================================================================
typedef struct CAM_SHAKE_PARAM_tag {

  s16 Width;              // ゆれ幅
  s16 Height;             // ゆれ高さ
  u8  Time;               // ゆれ回数

  u16 SubW;
  u16 SubH;
  u16 SubStartTime;
  u16 SubMargineCount;
  u16 SubMargine;
  u8  TimeMax;

  u32 Sync;               // 1周期するのにかかるシンク数
  u32 NowSync;            // 現在のシンク
  
  s16 WaitStartFrame;     // 開始まで何フレーム待つか
  
  u8  ShakeType;          // カメラを揺らすタイプ

} CAM_SHAKE_PARAM;


//=============================================================================
//
//					プロトタイプ宣言
//
//=============================================================================

//----------------------------------------------------------------------------
/**
 *	@brief  カメラ振動タスクを作成する
 *
 *	@param	fieldmap    動作対象フィールドマップ
 *	@param  shakeParam  振動パラメータ
 *
 *	@return 作成したタスク
 *
 */
//-----------------------------------------------------------------------------
extern FIELD_TASK* FIELD_TASK_ShakeCamera( FIELDMAP_WORK* fieldmap, const CAM_SHAKE_PARAM* shakeParam );

