//[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[
/**
 *
 *	@file		field_gimmick_h06_sv.h
 *	@brief  マリンチューブセーブデータ
 *	@author	Katsuhiko=Ichiraku
 *	@date		2011.09.10
 *
 */
//]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]
#pragma once

//-------------------------------------
///	時間帯の指定
//=====================================
typedef enum{
  TIME_ZONE_AM,     // 朝から昼
  TIME_ZONE_PM,     // 夕方から夜
  TIME_ZONE_RARE,   // レアタイム

  TIME_ZONE_MAX,
}TIME_ZONE;

//-------------------------------------
///	セーブワーク
//=====================================
typedef struct{

  // アニメフレーム保存用
  fx32        anm_frm[20];    // 余裕もってとった

  // 時間帯
  TIME_ZONE   time_zone;

} H06_GIMMICK_SV_WORK;


