//[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[
//
//
//   @file		field_gimmick_bgate.h
//   @brief   バッジチェックゲートギミック
//   @author	Masayuki Onoue
//   @date		2011.07.06
//
//
//]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]
#pragma once

//=============================================================================
//
//					定数宣言
//
//=============================================================================
// ギミックワークのアサインID
#define BADGEGATE_WORK_ASSIGN_ID  (0)

//=============================================================================
//
//					構造体宣言
//
//=============================================================================

//=============================================================================
//
//					プロトタイプ宣言
//
//=============================================================================
extern void BADGEGATE_Setup( FIELDMAP_WORK *p_fieldmap );
extern void BADGEGATE_Move( FIELDMAP_WORK *p_fieldmap );
extern void BADGEGATE_End( FIELDMAP_WORK *p_fieldmap );

// モニュメント起動
extern GMEVENT* BADGEGATE_CreateMonumentStartEvent( GAMESYS_WORK *p_gamesys, u16 monument_id );

