//============================================================================================
/**
 * @brief field_palette.c
 * @brief
 * @date  2011.09.03
 * @author  tamada
 *
 * ハイリンク進入時に使用していたグレースケール処理を拡張して
 * セピア化も管理する仕組みにするようにした
 */
//============================================================================================
#pragma once

#include <gflib.h>

//--------------------------------------------------------------
//  カラー制御情報を保持するためのワーク
//--------------------------------------------------------------
typedef struct {
  const u8 * gray_scale;
  BOOL is_sepia;
}FLD_G3DPAL;


//--------------------------------------------------------------
//  カラー制御情報のセット
//--------------------------------------------------------------
extern void FLD_G3DPAL_Init( FLD_G3DPAL * g3dPal, const u8 * gray_scale, BOOL is_sepia );

//--------------------------------------------------------------
//  GFL_G3D_RESからテクスチャパレットを参照し、カラーを変更する
//--------------------------------------------------------------
extern void FLD_G3DPAL_Filter( const FLD_G3DPAL * g3dPal, GFL_G3D_RES *g3Dres );

