//[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[
/**
 *
 *	@file		field_gimmick_hide_ship_engine.c
 *	@brief  アジト船(エンジン)ギミック
 *	@author	Katsuhiko=Ichiraku
 *	@date		2011.07.08
 *
 */
//]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]


// system
#include "fieldmap.h"
#include "system/main.h"    //for HEAPID_FIELDMAP
#include "savedata/gimmickwork.h"

// gimmick
#include "field_gimmick_def.h"
#include "gmk_tmp_wk.h"

// mine
#include "field_gimmick_hide_ship_engine.h"

//=============================================================================
/**
 *					定数宣言
*/
//=============================================================================
#define HIDE_SHIP_UNIT_IDX        (0)
#define HIDE_SHIP_TMP_ASSIGN_ID   (1)

//=============================================================================
/**
 *					構造体宣言
*/
//=============================================================================
//-------------------------------------
///	ギミック内部中の一時ワーク
//=====================================
typedef struct {
  u32   dummy;
} HIDE_SHIP_TMP;

//=============================================================================
/**
 *					static関数宣言
*/
//=============================================================================

//=============================================================================
/**
 *					外部公開関数
*/
//=============================================================================
//--------------------------------------------------------------
/**
 * @bried       セットアップ関数
 * @param	      p_fieldmap     フィールドワークポインタ
 * @return      none
 */
//--------------------------------------------------------------
void HIDE_SHIP_Setup( FIELDMAP_WORK *p_fieldmap )
{
  HIDE_SHIP_TMP *tmp;

  // 汎用ワーク確保
  GMK_TMP_WK_AllocWork( p_fieldmap, HIDE_SHIP_TMP_ASSIGN_ID, FIELDMAP_GetHeapID(p_fieldmap), sizeof(HIDE_SHIP_TMP) );

  tmp = GMK_TMP_WK_GetWork( p_fieldmap, HIDE_SHIP_TMP_ASSIGN_ID );

  OS_Printf("ギミックセットアップ\n");
}

//--------------------------------------------------------------
/**
 * @bried       解放関数
 * @param	      p_fieldmap     フィールドワークポインタ
 * @return      none
 */
//--------------------------------------------------------------
void HIDE_SHIP_End( FIELDMAP_WORK *p_fieldmap )
{
  //汎用ワーク解放
  GMK_TMP_WK_FreeWork( p_fieldmap, HIDE_SHIP_TMP_ASSIGN_ID );
}

//--------------------------------------------------------------
/**
 * @bried       動作関数
 * @param	      p_fieldmap     フィールドワークポインタ
 * @return      none
 */
//--------------------------------------------------------------
void HIDE_SHIP_Move( FIELDMAP_WORK *p_fieldmap )
{
}

//=============================================================================
/**
 *					static関数
*/
//=============================================================================


