//[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[
/**
 *
 *	@file		field_gimmick_hide_ship_engine_sv.h
 *	@brief  アジト船(エンジン)ギミックセーブデータ
 *	@author	Katsuhiko=Ichiraku
 *	@date		2011.07.15
 *
 */
//]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]
#pragma once

//-------------------------------------
///	アジト船セーブワーク
//=====================================
typedef struct
{
  // パイプの状態
  u8    pipe[ 16 ];
  // ボタンの状態
  u8    button[ 4 ];

  BOOL  save_flag;      // 1度でもセーブしているか

} HIDE_SHIP_SV_WORK;

