//[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[
/**
 *
 *	@file		field_gimmick_h06.c
 *	@brief  マリンチューブ
 *	@author	Katsuhiko=Ichiraku
 *	@date		2011.09.02
 *
 */
//]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]

// system
#include "fieldmap.h"
#include "system/main.h"    //for HEAPID_FIELDMAP
#include "savedata/gimmickwork.h"

// gimmick
#include "field_gimmick_def.h"
#include "gmk_tmp_wk.h"

// mine
#include "field_gimmick_h06.h"

//=============================================================================
/**
 *					定数宣言
*/
//=============================================================================
#define H06_GIMMICK_UNIT_IDX        (0)
#define H06_GIMMICK_TMP_ASSIGN_ID   (1)

//=============================================================================
/**
 *					構造体宣言
*/
//=============================================================================
//-------------------------------------
///	ギミック内部中の一時ワーク
//=====================================
typedef struct {
  u32   dummy;
} H06_GIMMICK_TMP;

//=============================================================================
/**
 *					static関数宣言
*/
//=============================================================================

//=============================================================================
/**
 *					外部公開関数
*/
//=============================================================================
//--------------------------------------------------------------
/**
 * @bried       セットアップ関数
 * @param	      p_fieldmap     フィールドワークポインタ
 * @return      none
 */
//--------------------------------------------------------------
void H06_GIMMICK_Setup( FIELDMAP_WORK *p_fieldmap )
{
  H06_GIMMICK_TMP *tmp;

  // 汎用ワーク確保
  GMK_TMP_WK_AllocWork( p_fieldmap, H06_GIMMICK_TMP_ASSIGN_ID, FIELDMAP_GetHeapID(p_fieldmap), sizeof(H06_GIMMICK_TMP) );

  tmp = GMK_TMP_WK_GetWork( p_fieldmap, H06_GIMMICK_TMP_ASSIGN_ID );

  OS_Printf("ギミックセットアップ\n");
}

//--------------------------------------------------------------
/**
 * @bried       解放関数
 * @param	      p_fieldmap     フィールドワークポインタ
 * @return      none
 */
//--------------------------------------------------------------
void H06_GIMMICK_End( FIELDMAP_WORK *p_fieldmap )
{
  //汎用ワーク解放
  GMK_TMP_WK_FreeWork( p_fieldmap, H06_GIMMICK_TMP_ASSIGN_ID );
}

//--------------------------------------------------------------
/**
 * @bried       動作関数
 * @param	      p_fieldmap     フィールドワークポインタ
 * @return      none
 */
//--------------------------------------------------------------
void H06_GIMMICK_Move( FIELDMAP_WORK *p_fieldmap )
{
}

//=============================================================================
/**
 *					static関数
*/
//=============================================================================

