//[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[
/**
 *
 *	@file		fldeff_ochiba.h
 *	@brief  落ち葉エフェクト
 *	@author	Katsuhiko=Ichiraku
 *	@date		2011.05.16
 *
 */
//]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]
#pragma once

#include <gflib.h>
#include "system/gfl_use.h"

#include "fieldmap.h"
#include "field_effect.h"
#include "fldmmdl.h"

//=============================================================================
/**
 *					定数宣言
*/
//=============================================================================

//=============================================================================
/**
 *					構造体宣言
*/
//=============================================================================

//=============================================================================
/**
 *					プロトタイプ宣言
*/
//=============================================================================
extern void * FLDEFF_OCHIBA_Init( FLDEFF_CTRL *fectrl, HEAPID heapID );
extern void FLDEFF_OCHIBA_Delete( FLDEFF_CTRL *fectrl, void *work );

extern void FLDEFF_OCHIBA_Set( FLDEFF_CTRL *fectrl, MMDL *mmdl );

