//===============================================================================
/*
 *  @file   fmission_gimmick.h
 *  @brief  フェスミッション フィールドギミック
 *  @author Miyuki Iwasawa
 *  @date   11.04.12
 */
//===============================================================================

#pragma once

//----------------------------------------------------------------------
/*
 *  @brief  フェスミッションギミック　マップ遷移後処理
 */
//----------------------------------------------------------------------
extern void FMISSION_GIMMICK_MapChangeSetup( LINK_FESTIVAL* fest_sys, GAMESYS_WORK* gsys, u16 zone_id );

//----------------------------------------------------------------------
/*
 *  @brief  フェスミッションギミック 削除　
 */
//----------------------------------------------------------------------
extern void FMISSION_GIMMICK_Delete( LINK_FESTIVAL* fest_sys, GAMESYS_WORK* gsys );

//----------------------------------------------------------------------
/*
 *  @brief  フェスミッションギミック　フラグセット
 */
//----------------------------------------------------------------------
extern void FMISSION_GIMMICK_FlagSet( LINK_FESTIVAL* fest_sys, u16 zone_id, u16 idx );

