//[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[
/**
 *
 *	@file		gym_poison.h
 *	@brief  毒ジム
 *	@author		Katsuhiko=Ichiraku
 *	@date		2011.04.12
 *
 */
//]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]
#pragma once

//=============================================================================
/**
 *					定数宣言
*/
//=============================================================================

//=============================================================================
/**
 *					構造体宣言
*/
//=============================================================================

//=============================================================================
/**
 *					プロトタイプ宣言
*/
//=============================================================================
extern void GYM_POISON_Setup(FIELDMAP_WORK *p_fieldmap);
extern void GYM_POISON_End(FIELDMAP_WORK *p_fieldmap);
extern void GYM_POISON_Move(FIELDMAP_WORK *p_fieldmap);

// スクリプトコマンドで呼ばれる関数
extern void GYM_POISON_AnmStop(GAMESYS_WORK *gsys, const int idx);
extern void GYM_POISON_IssObjStop(GAMESYS_WORK *gsys, const int obj_id);

