//[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[
/**
 *
 *	@file		gym_water_sv.h
 *	@brief  水ジムセーブデータ
 *	@author	Katsuhiko=Ichiraku
 *	@date		2011.06.08
 *
 */
//]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]
#pragma once

//-------------------------------------
///	水ジムセーブワーク
//=====================================
typedef struct
{
  // ハスの位置
  fx32  x[11];
  fx32  z[11];
  BOOL  save_flag; // ハスの位置を1度でもセーブしているか

  // 拡張高さが設定されていたOBJインデックス
  u8    ex_obj_idx[2]; // 最高2つ

} GYM_WATER_SV_WORK;


