//[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[
//
//
//   @file		infinity_dungeon_local_def.h
//   @brief   無限ダンジョンローカル定義
//   @author	Masayuki Onoue
//   @date		2011.04.11
//
//
//]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]
#pragma once

//=============================================================================
//
//					定数宣言
//
//=============================================================================
#define INFINITY_DUNGEON_TRDATA_MAX (320)    // 無限ダンジョン内トレーナーデータMAX

//-------------------------------------
//	ダンジョン移動用定数
//=====================================
enum{
  INF_MOVE_UP,
  INF_MOVE_DOWN,
  INF_MOVE_RIGHT,
  INF_MOVE_LEFT,
  INF_MOVE_MAX,
};

//-------------------------------------
//	部屋移動チェックモード
//=====================================
enum{
  INF_CHECKMODE_FULL_CLOSE, // 全ての扉がしまっているときのみ
  INF_CHECKMODE_MOVE,       // ボス部屋とエレベーター部屋のみをチェック
};

//-------------------------------------
//	マップ移動タイプ
//=====================================
enum{
  MAP_CHAGE_TYPE_ROOM,
  MAP_CHAGE_TYPE_FOOR,
  MAP_CHAGE_TYPE_MAX,
};

//-------------------------------------
//	部屋タイプ
//=====================================
enum{
  ROOM_TYPE_ELEVATOR,
  ROOM_TYPE_BOSS,
  ROOM_TYPE_SPECIAL1,
  ROOM_TYPE_SPECIAL2,
  ROOM_TYPE_DEFAULT,
  ROOM_TYPE_RECEPTION,
  ROOM_TYPE_MAX,
};

//-------------------------------------
//	受付のエレベータID
//=====================================
enum{
  RECEPTION_ELEVATOR_NORMAL,
  RECEPTION_ELEVATOR_EX,
};

//=============================================================================
//
//					構造体宣言
//
//=============================================================================

//-------------------------------------
///	部屋位置データ
//=====================================
typedef struct {
  int x;
  int y;
}DIG_POS;

//-------------------------------------
///	迷路生成用ワーク
//=====================================
typedef struct {
  int data_index;
  DIG_POS now_pos;
  DIG_POS dig_pos_list[INF_MAX_SEARC_CNT];
}INF_DIG_DATA;

//-------------------------------------
// グリッド座標データ
//=====================================
typedef struct {
  s32 x;
  s32 y;
  s32 z;
}GRID_DATA;

//-------------------------------------
///	ルームデータ
//=====================================
typedef struct{
  u8  tr_pos_type;
  u8 room_type;
  BOOL can_move[4];
  u8  room_id;
}ROOM_DATA;

//-------------------------------------
///	ダンジョン内トレーナーデータ
//=====================================
typedef struct{
  u16 tr_id[INFINITY_DUNGEON_TRID_MAX]; // 全トレーナーランダム配列
}DUNGEON_TRAINER;

//-------------------------------------
///	フロアデータ
//=====================================
typedef struct{
  ROOM_DATA room_data[ROOM_MAX];
  DUNGEON_TRAINER tr_data[FLOOR_MAX];
}FLOOR_DATA;

