//============================================================================================
/**
 * @file  kerudhio_normalform.h
 * @brief   ケルディオのわざ内容チェック＆フォルム戻し処理
 * @date    2011.12.21
 * @author  tamada GAMEFREAK inc.
 */
//============================================================================================

#include "gamesystem/gamesystem_def.h"
//--------------------------------------------------------------
//--------------------------------------------------------------
extern void KERUDHIO_FORM_ChangeNormal( GAMESYS_WORK * gsys );

