//============================================================================================
/**
 * @file  pokewood_system_local.h
 * @brief
 * @author  mori GAMEFREAK inc.
 * @date  2011.07.11
 */
//============================================================================================
#pragma once

#include "gflib.h"
#include "pokewood_system.h"
#include "poke_tool/poke_tool.h"
#include "gamesystem/btl_setup.h"

//============================================================================================
//============================================================================================
//------------------------------------------------------------------
//============================================================================================
//============================================================================================
//------------------------------------------------------------------
/// POKEWOOD結果データ
//------------------------------------------------------------------
struct _POKEWOODRESULT {
  u8 upside_win;
  u8 msg_id;
};

//------------------------------------------------------------------
/**
 * @brief POKEWOOD中に保持する進行データ
 */
//------------------------------------------------------------------
struct _POKEWOOD_SYSTEM {
  HEAPID heapID;

  ///ポケモン選択関連
    u8 use_btlbox;            ///<バトルボックスを使用するかどうか？フラグ
    POKEPARTY *btl_box_party; //バトルボックス用POKEPARTY
    
    u8  pokelist_select_num[6]; ///<ポケモン選択で取得した手持ちNo
    u16 pokelist_result_select; ///<ポケモンリスト戻り値
    u16 pokelist_return_mode; ///<ポケモンリスト選択結果

    REGULATION reg;           ///<レギュレーション
  
//  BATTLE_SETUP_PARAM *btl_setup_param;
//  BTL_REC_SEL_PARAM btl_rec_sel_param;

  ///スクリプトとプログラムのやりとりのためのアドレスを保持するポインタ
  u16 * scr_answer_work;
};

