//******************************************************************************
/**
 * 
 * @file	  scrcmd_pair.h
 * @brief   連れ歩き関連コマンド(常駐)
 * @author  iwasawa	
 * @data	  10.11.18
 *
 */
//******************************************************************************

#ifndef __H_SCRCMD_PAIR_H__
#define __H_SCRCMD_PAIR_H__

//--------------------------------------------------------------
/**
 * @brief 連れ歩き開始パラメータセット
 */
//--------------------------------------------------------------
extern VMCMD_RESULT EvCmdPairTrainerParamSet( VMHANDLE * core, void *wk );

//--------------------------------------------------------------
/**
 * @brief 連れ歩き開始パラメータ解放
 */
//--------------------------------------------------------------
extern VMCMD_RESULT EvCmdPairTrainerParamFree( VMHANDLE * core, void *wk );

#endif //__H_SCRCMD_PAIR_H__

