//[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[
/**
 *
 *	@file		scrcmd_c14_gmk.c
 *	@brief
 *	@author		Katsuhiko=Ichiraku
 *	@date		2011.11.12
 *
 */
//]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]

#include <gflib.h>
#include "system/gfl_use.h"
#include "system/main.h"
#include "system/vm_cmd.h"

#include "script.h"
#include "script_def.h"
#include "script_local.h"
#include "scrcmd.h"
#include "scrcmd_work.h"

#include "fieldmap.h"

#include "scrcmd_c14_gmk.h"

#include "field_gimmick_c14.h"

//=============================================================================
/**
 *					定数宣言
*/
//=============================================================================

//=============================================================================
/**
 *					構造体宣言
*/
//=============================================================================

//=============================================================================
/**
 *					static関数宣言
*/
//=============================================================================

//=============================================================================
/**
 *					外部公開関数
*/
//=============================================================================
//----------------------------------------------------------------------------
/**
 *	@brief  水しぶき再生コマンド
 */
//-----------------------------------------------------------------------------
VMCMD_RESULT EvCmdC14GMK_Splash( VMHANDLE *core, void *wk )
{
  SCRCMD_WORK *work = wk;
  SCRIPT_WORK *sc = SCRCMD_WORK_GetScriptWork( work );
  GAMESYS_WORK *gsys = SCRCMD_WORK_GetGameSysWork( work );

  int gx, gy, gz;

  gx = SCRCMD_GetVMWorkValue( core, work );  // コマンド第1引数
  gy = SCRCMD_GetVMWorkValue( core, work );  // コマンド第2引数
  gz = SCRCMD_GetVMWorkValue( core, work );  // コマンド第3引数

  // 水しぶきアニメ再生
  C14_GIMMICK_AnmStart( gsys, gx, gy, gz );

  return VMCMD_RESULT_CONTINUE;
}

//=============================================================================
/**
 *					static関数
*/
//=============================================================================


