//============================================================================================
/**
 * @file  wbt.h
 * @brief
 * @author  tamada GAME FREAK inc.
 * @date  2011.02.13
 *
 * @todo  ダウンロードデータのサイズ、項目確認（肩書の長さなど）
 */
//============================================================================================
#pragma once

#include "battle/battle.h"

//============================================================================================
//============================================================================================
//------------------------------------------------------------------
///トーナメントの種類
//------------------------------------------------------------------
typedef enum {
  WBTTYPE_ALL,
  WBTTYPE_CHAMPION,
  WBTTYPE_POKETYPE,
  WBTTYPE_DOWNLOAD,
}WBTTYPE;

typedef enum {
  WBTRULE_SINGLE,
  WBTRULE_DOUBLE,
  WBTRULE_TRIPLE,
  WBTRULE_LOTATION,
}WBTRULE;

//------------------------------------------------------------------
//------------------------------------------------------------------
typedef enum {
  WBT_ALLTOUR_LEVEL_0 = 0,
  WBT_ALLTOUR_LEVEL_1,
  WBT_ALLTOUR_LEVEL_2,
  WBT_ALLTOUR_LEVEL_3,
}WBT_ALLTOURNAMENT_LEVEL;

//------------------------------------------------------------------
/**
 * @brief WBT中に保持する進行データの不完全型
 */
//------------------------------------------------------------------
typedef struct _WBT_SYSTEM WBTSYS;


extern WBTSYS * WBTSYS_Create( HEAPID heapID );
extern void WBTSYS_Delete( WBTSYS * wbtsys );

//============================================================================================
//============================================================================================
//------------------------------------------------------------------
/**
 * @brief WBTでセーブする要素
 */
//------------------------------------------------------------------
typedef struct {
  ///チャンピオントーナメントを1日1回しか出来ないように制御するためのフラグ
  BOOL ChampionTournamentFlag;
  ///チャンピオントーナメントに参加できるフラグ（条件クリア後？）
  BOOL EnableChampionTournamentFlag;

  ///優勝回数カウント
  u16 WinAllTournamentCount;
  u16 WinTypeTournamentCount[POKETYPE_MAX];
}WBT_SAVE;

