//============================================================================================
/**
 * @file wbt_system_st.c
 * @brief WBTでどうしてもフィールド常駐に配置しないといけないモジュール
 * @author  tamada
 * @date  2011.09.09
 */
//============================================================================================

#include <gflib.h>

#include "wbt_system.h"
#include "wbt_system_local.h"

//------------------------------------------------------------------
/**
 * @brief WBTの観客タイプを取得する
 * @param[in] wbtsys
 * @return  u8  観客タイプの指定
 *
 * 通常のWBTモジュールがロードされるされる前に参照するため、
 * フィールド常駐部分に配置している
 */
//------------------------------------------------------------------
u8 WBTSYS_GetAudienceType( const WBTSYS * wbtsys )
{
  return wbtsys->audience_type;
}

