//[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[
/**
 *
 *	@file		mobiclip.h
 *	@brief  Mobiclip再生アプリ
 *	@author		Katsuhiko=Ichiraku
 *	@date		2011.04.27
 *
 */
//]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]
#pragma once

//=============================================================================
/**
 *    外部公開
 */
//=============================================================================

// PROCデータ外部公開
extern const GFL_PROC_DATA	Mobiclip_ProcData;


//=============================================================================
/**
 *					定数宣言
*/
//=============================================================================

//-------------------------------------
///	再生モード
//=====================================
typedef enum {
  MOBICLIP_MODE_DEFAULT,    // 通常再生
  /* ↓未実装 */
  MOBICLIP_MODE_SOUND,      // 音のみ再生
  MOBICLIP_MODE_IMAGE,      // 画のみ再生
} MOBICLIP_MODE;


//=============================================================================
/**
 *					構造体宣言
*/
//=============================================================================
//-------------------------------------
///	MobiclipPROC用パラメータ
//=====================================
typedef struct {

  ARCID               arcID;        //[in]    arcID(再生するファイル)
  MOBICLIP_MODE       mode;         //[in]    再生モード
  BOOL                skip_enable;  //[in]    スキップ可能フラグ
} MOBICLIP_PARAM;

//=============================================================================
/**
 *					プロトタイプ宣言
*/
//=============================================================================

FS_EXTERN_OVERLAY( mobiclip );

//----------------------------------------------------------------------------
/**
 *	@brief  MOBICLIPパラメータ作成
 *
 *	@param	heapID        ヒープID
 *	@param	arcID         再生するarcID
 *	@param	mode          再生モード
 *	@param	skip_enable   SKIP可能か
 *
 *	@return 作成したパラメータ
 */
//-----------------------------------------------------------------------------
extern MOBICLIP_PARAM * MOBICLIP_PARAM_Alloc( HEAPID heapID, ARCID arcID, MOBICLIP_MODE mode, BOOL skip_enable );
//----------------------------------------------------------------------------
/**
 *	@brief  MOBICLIPパラメータ解放
 *
 *	@param	MOBICLIP_PARAM  
 */
//-----------------------------------------------------------------------------
extern void MOBICLIP_PARAM_Free( MOBICLIP_PARAM *p_param );


