//====================================================================================
/**
 *  @file   fmission_log_accessor.h
 *  @brief  フェスミッションログ　データアクセス(フィールド)
 *  @author Miyuki Iwasawa
 *  @date   11.03.23
 *
 *  fmission_logのルーチンのうち、フィールド上からだけアクセスできれば良い関数を集めてある
 */
//====================================================================================

#pragma once

//------------------------------------------------------------------
/**
 * ログテーブルにエントリーしているログ数を取得
 *
 * @param   tbl	  ログテーブルへのポインタ
 * @retval  int		ログ登録数
 */
//------------------------------------------------------------------
extern int FMISSION_LOG_TBL_GetEntryNum( FMISSION_LOG_TBL* tbl );
//------------------------------------------------------------------
/**
 * ログテーブルの描画トップindexを取得
 *
 * @param   tbl	  ログテーブルへのポインタ
 * @retval  int	  描画トップindex	
 */
//------------------------------------------------------------------
extern int FMISSION_LOG_TBL_GetViewTopIdx( FMISSION_LOG_TBL* tbl );

//------------------------------------------------------------------
/**
 * ログテーブルの描画トップindexをセット
 *
 * @param   tbl	  ログテーブルへのポインタ
 * @param   top		セットする描画Topのindex
 */
//------------------------------------------------------------------
extern void FMISSION_LOG_TBL_SetViewTopIdx( FMISSION_LOG_TBL* tbl, u8 top );

//------------------------------------------------------------------
/**
 * ログワークをAllocする
 */
//------------------------------------------------------------------
extern FMISSION_LOG* FMISSION_LOG_AllocWork( HEAPID heapID );

//------------------------------------------------------------------
/*
 *  ログスタック データ取得
 *
 *  @param  tbl     FMISSION_LOG_TBL型構造体へのポインタ
 *  @param  p_log   取得するログ情報を格納するFMISSION_LOG型ワークへのポインタ
 *
 *  @retval TRUE    データ取得成功
 *  @retval FALSE   スタックテーブルにデータがない
 *
 *  情報取得に成功した場合、スタックテーブル内のデータが前詰めされます
 */
//------------------------------------------------------------------
extern BOOL FMISSION_LOG_StackTbl_GetLog( FMISSION_LOG_TBL* tbl, FMISSION_LOG* p_log );

//------------------------------------------------------------------
/**
 * リング式ログテーブルのTopからのオフセットindexを配列への実参照indexに変換
 *
 * @param   tbl		  ログビューテーブルへのポインタ
 * @param   ofs     リングトップからのindexオフセット
 *
 * @retval  int		配列の実参照index
 */
//------------------------------------------------------------------
extern int FMISSION_LOG_ViewTbl_GetOfs2Idx( FMISSION_LOG_TBL *tbl, int ofs );

//------------------------------------------------------------------
/**
 * ログビューテーブルへ新しいログを登録する(リングバッファ方式)
 *
 * @param   tbl		      ログテーブルへのポインタ
 * @param   p_log	    	登録するログ
 * @retval  int		登録したログ位置(登録できなかった場合はFMISSION_LOG_MAX)
 */
//------------------------------------------------------------------
extern int FMISSION_LOG_ViewTbl_SetLog( FMISSION_LOG_TBL* tbl, const FMISSION_LOG* p_log );

//------------------------------------------------------------------
/**
 * リング式ログビューテーブルから指定オフセット位置のログ情報を取得する
 *
 * @param   tbl		      ログテーブルへのポインタ
 * @param   p_log	    	ログ情報代入先
 * @param   ofs		      リングバッファ先頭からのindexオフセット
 *
 * @retval  BOOL		    TRUE:ログ情報取得成功　　FALSE:取得失敗(データが無い)
 */
//------------------------------------------------------------------
extern BOOL FMISSION_LOG_ViewTbl_GetLog( FMISSION_LOG_TBL *tbl, FMISSION_LOG* p_log, int ofs );

//------------------------------------------------------------------
/**
 * ログパラメータ取得　名前
 *
 * @param   p_log	    	ログ情報
 * @param   s_buf       PERSON_NAME_SIZE+EOM_SIZEを格納可能なSTRBUFのポインタ
 */
//------------------------------------------------------------------
extern void FMISSION_LOG_GetName( FMISSION_LOG* p_log, STRBUF* s_buf );

//------------------------------------------------------------------
/**
 * ログパラメータ取得　 ポケモンニックネーム
 *
 * @param   p_log	    	ログ情報
 * @param   s_buf       MONS_NAME_SIZE+EOM_SIZEを格納可能なSTRBUFのポインタ
 */
//------------------------------------------------------------------
extern void FMISSION_LOG_GetPokeNickname( FMISSION_LOG* p_log, STRBUF* s_buf );

//------------------------------------------------------------------
/**
 * ログパラメータ取得　一言メッセージ
 *
 * @param   p_log	    	ログ情報
 * @param   s_buf       GAMEBEACON_FREEWORD_MESSAGE_LENを格納可能なSTRBUFのポインタ
 */
//------------------------------------------------------------------
extern void FMISSION_LOG_GetFreeWord( FMISSION_LOG* p_log, STRBUF* s_buf );

//------------------------------------------------------------------
/**
 * ログパラメータ取得   ユニオン見た目コード
 *
 * @param   p_log	    	ログ情報
 */
//------------------------------------------------------------------
extern u8 FMISSION_LOG_GetTrView( FMISSION_LOG* p_log );

//------------------------------------------------------------------
/**
 * ログパラメータ取得   性別
 *
 * @param   p_log	    	ログ情報
 */
//------------------------------------------------------------------
extern u8 FMISSION_LOG_GetSex( FMISSION_LOG* p_log );

//------------------------------------------------------------------
/**
 * ログパラメータ取得   ログアクション
 *
 * @param   p_log	    	ログ情報
 */
//------------------------------------------------------------------
extern FMISSION_LOG_ACTION FMISSION_LOG_GetAction( FMISSION_LOG* p_log );

//------------------------------------------------------------------
/**
 * ログパラメータ取得   ログアクションパラメータ
 *
 * @param   p_log	    	ログ情報
 */
//------------------------------------------------------------------
extern u16 FMISSION_LOG_GetActionParam( FMISSION_LOG* p_log );

//------------------------------------------------------------------
/**
 * ログパラメータ取得   ログアクションパラメータのWordset展開 
 *
 * @param   p_log	    	ログ情報
 */
//------------------------------------------------------------------
extern void FMISSION_LOG_ActionWordset( FMISSION_LOG* p_log,  WORDSET* wset, HEAPID tmpHeapID );

