//============================================================================================
/**
 * @file	pm_season.h
 * @brief	ãGêﬂÇÃíËã`
 * @author	tamada GAME FREAK Inc.
 * @date	09.03.17
 *
 */
//============================================================================================

#pragma once

#ifdef	__cplusplus
extern "C" {
#endif

//============================================================================================
//============================================================================================

#define	PMSEASON_SPRING		(0)			/**!< èt */
#define	PMSEASON_SUMMER		(1)			/**!< âƒ */
#define	PMSEASON_AUTUMN		(2)			/**!< èH */
#define	PMSEASON_WINTER		(3)			/**!< ì~ */

#define	PMSEASON_TOTAL		(4)			/**!< ìñÇΩÇËëOÇæÇ™élãGÇÕÇSÇ¬ */


#ifndef __ASM_NO_DEF_

//--------------------------------------------------------------------------------------------
/**
 * @brief åªç›éûçèÇÃãGêﬂÇåvéZÇ∑ÇÈ
 *
 * @param start_date ÉQÅ[ÉÄäJénì˙éû[åé/ì˙]
 * 
 * @return åªç›éûçèÇÃãGêﬂ( PMSEASON_SPRING Ç»Ç« )
 */
//--------------------------------------------------------------------------------------------
u8 PMSEASON_CalcSeasonID_byDate( const RTCDate* start_date );

//--------------------------------------------------------------------------------------------
/**
 * @brief åªç›éûçèÇÃãGêﬂÇåvéZÇ∑ÇÈ
 *
 * @param start_sec ÉQÅ[ÉÄäJénéûçè[sec]
 * 
 * @return åªç›éûçèÇÃãGêﬂ( PMSEASON_SPRING Ç»Ç« )
 */
//--------------------------------------------------------------------------------------------
u8 PMSEASON_CalcSeasonID_bySec( s64 start_sec );

#endif  // __ASM_NO_DEF_


#ifdef	__cplusplus
} /* extern "C" */
#endif

