//============================================================================================
/**
 * @file		blink_palanm.h
 * @brief		点滅パレットアニメ処理
 * @author	Hiroyuki Nakamura
 * @date		10.01.18
 *
 *	モジュール名：BLINKPALANM
 *
 *	指定カラーから指定カラーへのパレットアニメです。
 *	カーソルアニメで使用しています。
 */
//============================================================================================
#pragma	once


//============================================================================================
//	定数定義
//============================================================================================

typedef struct _BLINK_PALANM_WORK	BLINKPALANM_WORK;		// 点滅パレットアニメワーク

#define	BLINKPALANM_MODE_MAIN_OBJ		( 0xfffe )	// メインＯＢＪパレット定義
#define	BLINKPALANM_MODE_SUB_OBJ		( 0xffff )	// サブＯＢＪパレット定義

// 点滅アニメのモード指定
enum{
  BLINKPALANM_NORMAL=0,        // 通常時（ゆっくり明滅し続けます）
  BLINKPALANM_DECIDE,          // 決定時（すばやくチカチカ）
};
//============================================================================================
//	プロトタイプ宣言
//============================================================================================

//--------------------------------------------------------------------------------------------
/**
 * 点滅パレットアニメワーク作成
 *
 * @param		offs		アニメをするパレット位置（カラー単位）
 * @param		size		アニメをするパレットのサイズ（カラー単位）
 * @param		bgfrm		ＢＧフレーム
 * @param		hapID		ヒープＩＤ
 *
 * @return	アニメワーク
 *
 * @li	bgfrm = BLINKPALANM_MODE_MAIN_OBJ でメインOBJのパレットに転送します
 * @li	bgfrm = BLINKPALANM_MODE_SUB_OBJ でサブOBJのパレットに転送します
 */
//--------------------------------------------------------------------------------------------
extern BLINKPALANM_WORK * BLINKPALANM_Create( u16 offs, u16 size, u16 bgfrm, HEAPID heapID );

//--------------------------------------------------------------------------------------------
/**
 * パレット設定
 *
 * @param		wk				パレットアニメワーク
 * @param		arcID			アーカイブＩＤ
 * @param		datID			データＩＤ
 * @param		startPos	開始基準パレット位置（カラー単位）
 * @param		endPos		終了基準パレット位置（カラー単位）
 *
 * @return	none
 */
//--------------------------------------------------------------------------------------------
extern void BLINKPALANM_SetPalBufferArc( BLINKPALANM_WORK * wk, ARCID arcID, ARCDATID datID, u32 startPos, u32 endPos );

//--------------------------------------------------------------------------------------------
/**
 * パレット設定（ハンドル指定）
 *
 * @param		wk				パレットアニメワーク
 * @param		ah				アークハンドル
 * @param		datID			データＩＤ
 * @param		startPos	開始基準パレット位置（カラー単位）
 * @param		endPos		終了基準パレット位置（カラー単位）
 *
 * @return	none
 */
//--------------------------------------------------------------------------------------------
extern void BLINKPALANM_SetPalBufferArcHDL( BLINKPALANM_WORK * wk, ARCHANDLE * ah, ARCDATID datID, u32 startPos, u32 endPos );

//--------------------------------------------------------------------------------------------
/**
 * 点滅パレットアニメワーク削除
 *
 * @param		wk		パレットアニメワーク
 *
 * @return	none
 */
//--------------------------------------------------------------------------------------------
extern void BLINKPALANM_Exit( BLINKPALANM_WORK * wk );

//--------------------------------------------------------------------------------------------
/**
 * 点滅パレットアニメ動作メイン
 *
 * @param		wk		パレットアニメワーク
 *
 * @return	none
 */
//--------------------------------------------------------------------------------------------
extern void BLINKPALANM_Main( BLINKPALANM_WORK * wk );

//--------------------------------------------------------------------------------------------
/**
 * アニメ動作カウンターを初期化
 *
 * @param		wk		パレットアニメワーク
 *
 * @return	none
 */
//--------------------------------------------------------------------------------------------
extern void BLINKPALANM_InitAnimeCount( BLINKPALANM_WORK * wk );

//=============================================================================================
/**
 * @brief	通常の点滅アニメの指定の箇所にカウンターを移動させる
 *
 * @param   wk    BLINKPALANM_WORK
 * @param   count 点滅ワークに代入したい値
 */
//=============================================================================================
extern void BLINKPALANM_SetAnimeCount(BLINKPALANM_WORK * wk, int count );

//=============================================================================================
/**
 * @brief	決定時の点滅アニメを開始
 *
 * @param   wk		BLINKPALANM_WORK
 */
//=============================================================================================
extern void BLINKPALANM_SetDecideAnime( BLINKPALANM_WORK * wk );

//=============================================================================================
/**
 * @brief	決定時アニメが終了したかチェック
 *
 * @param   wk		BLINKPALANM_WORK
 */
//=============================================================================================
extern BOOL BLINKPALANM_CheckDecideAnime( BLINKPALANM_WORK * wk );