#----------------------------------------------------------------------------
# ポケウッドシナリオ移行ツール
# 2011/10/11 by mori
# 
# 入力：ruby senario_move.rb <テンプレートシート> <入力シナリオデータ> <出力ファイル名>
# 出力：<テンプレート>シートに<入力シナリオデータ>の内容をコピーしたものを<出力ファイル名>で
#       出力する
#----------------------------------------------------------------------------require 'excel_lib'
require 'excel_lib'
require 'fileutils'

USE_STRING    = "ruby senario_move.rb <テンプレ.xls> <入力.xls> <出力.xls>\n"
NOFILE_STRING = "%sというファイルがありません\n"

$change_hash={ "チェンジ０"=>0, "チェンジ１"=>1, "チェンジ２"=>2,"チェンジ３"=>3,"チェンジ４"=>4,}
$change_tbl = [ "ー１", "ー２","ー３","ー４","ー５",]
$field_tbl  = [ 
  "ビル屋上Ａ",  "遊園地Ａ",  "都会・雑踏",  "未来都市",  "砂浜",
  "波止場",  "魔法の世界",  "墓地",  "研究施設",  "一般家屋室内",
  "宇宙",  "遊園地Ｂ",  "都会・雑踏Ｂ",
]

field_hash={
"ビル屋上Ａ"=>0, "ビル屋上Ａー１"=>0,"ビル屋上Ａー２"=>0,"ビル屋上Ａー３"=>0,"ビル屋上Ａー４"=>0,"ビル屋上Ａー５"=>0,
"遊園地Ａ"=>1,"遊園地Ａー１"=>1,"遊園地Ａー２"=>1,"遊園地Ａー３"=>1,"遊園地Ａー４"=>1,"遊園地Ａー５"=>1,
"都会・雑踏"=>2,"都会・雑踏ー１"=>2,"都会・雑踏ー２"=>2,"都会・雑踏ー３"=>2,"都会・雑踏ー４"=>2,"都会・雑踏ー５"=>2,
"未来都市"=>3,"未来都市ー１"=>3,"未来都市ー２"=>3,
"砂浜"=>4,"砂浜ー１"=>4,"砂浜ー２"=>4,"砂浜ー３"=>4,"砂浜ー４"=>4,
"波止場"=>5,"波止場ー１"=>5,"波止場ー２"=>5,"波止場ー３"=>5,"波止場ー４"=>5,
"魔法の世界"=>6,"魔法の世界ー１"=>6,"魔法の世界ー２"=>6,"魔法の世界ー３"=>6,"魔法の世界ー４"=>6,
"墓地"=>7,"墓地ー１"=>7,"墓地ー２"=>7,"墓地ー３"=>7,"墓地ー４"=>7,"墓地ー５"=>7,
"研究施設"=>8,"研究施設ー１"=>8,"研究施設ー２"=>8,"研究施設ー３"=>8,"研究施設ー４"=>8,"研究施設ー５"=>8,
"一般家屋室内"=>9,"一般家屋室内ー１"=>9,"一般家屋室内ー２"=>9,"一般家屋室内ー３"=>9,"一般家屋室内ー４"=>9,"一般家屋室内ー５"=>9,
"宇宙"=>10,"宇宙ー１"=>10,"宇宙ー２"=>10,"宇宙ー３"=>10,
"遊園地Ｂ"=>11,"遊園地Ｂー１"=>11,"遊園地Ｂー２"=>11,"遊園地Ｂー３"=>11,"遊園地Ｂー４"=>11,
"都会・雑踏Ｂ"=>12,"都会・雑踏Ｂー１"=>12,"都会・雑踏Ｂー２"=>12,"都会・雑踏Ｂー３"=>12,
}

#ヘッダー部位置指定文字列
header_pos=[   "B2", "B3","B4","B5","B7","B8","B9","B10",
               "D2", "D3", "E3", "D4", "D5", "E5","F5","G5", "D6", "E6","F6","G6", "D7",
               "D8", "E8", "D9", "D10", "D11", "D12",
               "B14",
               "B15", "C15",
               "B16", "C16",
               "B17", "C17",
               ]

#ポケモンメモ位置指定文字列
pokemon_memo_pos=[
                "A20","B20","C20","D20",
                "A21","B21","C21","D21",
                "A22","B22","C22","D22",
                "A23","B23","C23","D23",
                "A24","B24","C24","D24",
                "A25","B25","C25","D25",
                ]

#ターン毎メッセージ位置指定文字列
turn_msg_pos=[   "B48", "C48", "D48", "E48", "F48", "G48", "H48", "I48", 
                 "B49", "C49", "D49", "E49", "F49", "G49", "H49", "I49", 
                 "B50", "C50", "D50", "E50", "F50", "G50", "H50", "I50", 
                 "B51", "C51", "D51", "E51", "F51", "G51", "H51", "I51", 
                 "B52", "C52", "D52", "E52", "F52", "G52", "H52", "I52", 
                 "B53", "C53", "D53", "E53", "F53", "G53", "H53", "I53", 
                 "B54", "C54", "D54", "E54", "F54", "G54", "H54", "I54", 
                 "B55", "C55", "D55", "E55", "F55", "G55", "H55", "I55", 
                 "B56", "C56", "D56", "E56", "F56", "G56", "H56", "I56", 
                 "B57", "C57", "D57", "E57", "F57", "G57", "H57", "I57", 
                 "B58", "C58", "D58", "E58", "F58", "G58", "H58", "I58", 
                 "B59", "C59", "D59", "E59", "F59", "G59", "H59", "I59", 
                 "B60", "C60", "D60", "E60", "F60", "G60", "H60", "I60", 
                 "B61", "C61", "D61", "E61", "F61", "G61", "H61", "I61", 
                 "B62", "C62", "D62", "E62", "F62", "G62", "H62", "I62", 
                 "B63", "C63", "D63", "E63", "F63", "G63", "H63", "I63", 
                 "B64", "C64", "D64", "E64", "F64", "G64", "H64", "I64", 
                 "B65", "C65", "D65", "E65", "F65", "G65", "H65", "I65", 
                 "B66", "C66", "D66", "E66", "F66", "G66", "H66", "I66", 
                 "B67", "C67", "D67", "E67", "F67", "G67", "H67", "I67", 
                ]

#イベントデータ取り出し用y座標
event_start_pos=[ 70, 88, 106, 124, 142, 160, 178, 196, 214, 232, 250, 268 ]

#オフセット→位置指定文字列変換用テーブル
$pos_name = ["A", "B", "C", "D", "E", "F", "G", "H", "I", "J", "K", "L", "M", "N", ]

#イベント内部データオフセット配列
$event_offset=[ 
  [1,0],  [3,0],  [5,0],  [6,0],  [7,0],  [9,0],
  [1,2],  [2,2],  [3,2],  [4,2],  [5,2],  [6,2],  [7,2],  [8,2],    [11,2],
  [1,3],  [2,3],  [3,3],  [4,3],  [5,3],  [6,3],  [7,3],  [8,3],    [11,3],
  [1,4],  [2,4],  [3,4],  [4,4],  [5,4],  [6,4],  [7,4],  [8,4],    [11,4],
  [1,5],  [2,5],  [3,5],  [4,5],  [5,5],  [6,5],  [7,5],  [8,5],    [11,5],
  [1,6],  [2,6],  [3,6],  [4,6],  [5,6],  [6,6],  [7,6],  [8,6],    [11,6],
  [1,7],  [2,7],  [3,7],  [4,7],  [5,7],  [6,7],  [7,7],  [8,7],    [11,7],
  [1,8],  [2,8],  [3,8],  [4,8],  [5,8],  [6,8],  [7,8],  [8,8],    [11,8],
  [1,9],  [2,9],  [3,9],  [4,9],  [5,9],  [6,9],  [7,9],  [8,9],    [11,9],
  [1,10], [2,10], [3,10], [4,10], [5,10], [6,10], [7,10], [8,10],   [11,10],
  [1,11], [2,11], [3,11], [4,11], [5,11], [6,11], [7,11], [8,11],   [11,11],

  [1,13], [2,13], [3,13], [4,13], [5,13], [6,13], [7,13], [8,13],   [9,13],[10,13],[11,13],
  [1,14], [2,14], [3,14], [4,14], [5,14], [6,14], [7,14], [8,14],   [9,14],[10,14],[11,14],
  [1,15], [2,15], [3,15], [4,15], [5,15], [6,15], [7,15], [8,15],   [9,15],[10,15],[11,15],
  [1,16], [2,16], [3,16], [4,16], [5,16], [6,16], [7,16], [8,16],   [9,16],[10,16],[11,16],

]


#----------------------------------------------------------------
# セル内容コピー関数
#----------------------------------------------------------------
def cell_copy( inSheet, outSheet, inpos, outpos, field )
  inRange = inSheet.range(inpos).get_cursol
  if inRange.text!=nil then
    outRange = outSheet.range(outpos).get_cursol

    #「チェンジ」を置換する
    if $change_hash[inRange.text]!=nil then
      index = $change_hash[inRange.text]
      outRange.text = $field_tbl[field] + $change_tbl[index]
    else
      #通常コピー
      outRange.text = inRange.text
    end
  end
end

#----------------------------------------------------------------
# イベント内容コピー関数
#----------------------------------------------------------------
def event_copy( inSheet, outSheet, start_x, start_y, field )
  $event_offset.each{|x, y|
    wx = start_x+x
    wy = start_y+y
    posstr = get_posstr( wx,wy )
    cell_copy( inSheet, outSheet, posstr, posstr, field )
  }
end
#----------------------------------------------------------------
# オフセットから位置文字列を生成する
#----------------------------------------------------------------
def get_posstr( x, y )
  return "" + $pos_name[x]+y.to_s
end


#引数チェック
if ARGV[0]==nil || ARGV[1]==nil || ARGV[2]==nil then
  printf( USE_STRING )
  exit(1)
end

#ファイル存在チェック
2.times{|i|
  if FileTest.exist?(ARGV[i])==false then
    printf(NOFILE_STRING,ARGV[i])
    exit(1)
  end
}


#エクセルライブラリ起動
excel=Excel.new(false)

#シート開く
temp_book  = excel.copy_book( ARGV[0] )
input_book = excel.open_book( ARGV[1] )
temp_sheet  = temp_book.sheets[1]
input_sheet = input_book.sheets[1]

#事前調査
range = input_sheet.range("B14").get_cursol
if field_hash[range.text]!=nil then
  field = field_hash[range.text]
else
  field = 0
end

#ヘッダ項目移動
header_pos.each{|pos|
  cell_copy( input_sheet, temp_sheet, pos, pos, field )
}

#ポケモンメモ移動
pokemon_memo_pos.each{|pos|
  cell_copy( input_sheet, temp_sheet, pos, pos, field )
}

#毎ターン項目移動
turn_msg_pos.each{|pos|
  cell_copy( input_sheet, temp_sheet, pos, pos, field )
}

#イベント項目移動
event_start_pos.each{|y|
  event_copy( input_sheet, temp_sheet, 0, y, field )
}

#シート保存
temp_book.save( ARGV[2] )

#エクセルライブラリ終了
excel.quit
