//============================================================================================
/**
 * @file  wbt.h
 * @brief   WBT制御オブジェクトの定義
 * @author  tamada GAME FREAK inc.
 * @date  2011.02.13
 *
 */
//============================================================================================
#pragma once

//============================================================================================
/**
 *								定数定義
 */
//============================================================================================
//------------------------------------------------------------------
//  トーナメントに参加するトレーナーの総数
//------------------------------------------------------------------
enum {
  WBT_TRAINER_NUM = 8,
};

//------------------------------------------------------------------
/// ダウンロード可能なデータの総数
//------------------------------------------------------------------
enum {
  WBT_DOWNLOAD_NUM = 3,
};

//------------------------------------------------------------------
///WBTトーナメントの種類
//------------------------------------------------------------------
typedef enum {
  WBTCUP_NULL,     ///<トーナメント未指定
  WBTCUP_CHAMPION, ///<チャンピオントーナメント
  WBTCUP_POKETYPE, ///<タイプトーナメント
  WBTCUP_DOWNLOAD, ///<ダウンロードトーナメント

  WBTCUP_HODOMOE,     ///<ホドモエトーナメント           
  WBTCUP_ISSYU,       ///<イッシュリーダーズトーナメント 
  WBTCUP_KANTO,       ///<カントーリーダーズトーナメント 
  WBTCUP_JOUTO,       ///<ジョウトリーダーズトーナメント 
  WBTCUP_HOUEN,       ///<ホウエンリーダーズトーナメント 
  WBTCUP_SINOU,       ///<シンオウリーダーズトーナメント 
  WBTCUP_WORLD,       ///<ワールドトーナメント     
  WBTCUP_WCS,         ///<WCSトーナメント
  WBTCUP_HODOMOE_EVENT, ///<ホドモエトーナメント（イベント）           
  WBTCUP_RENTAL,        ///<レンタルトーナメント
  WBTCUP_RENTALMASTER,  ///<レンタルマスタートーナメント
  WBTCUP_SHUFFLE,       ///<シャッフルトーナメント
  WBTCUP_SHUFFLEMASTER, ///<シャッフルマスタートーナメント

  WBTCUP_MAX,
}WBTCUP;

//------------------------------------------------------------------
///WBT対戦ルール
//------------------------------------------------------------------
typedef enum {
  WBTRULE_NULL,     ///<ルール未指定
  WBTRULE_SINGLE,   ///<シングルバトル
  WBTRULE_DOUBLE,   ///<ダブルバトル
  WBTRULE_TRIPLE,   ///<トリプルバトル
  WBTRULE_ROTATION, ///<ローテーションバトル
}WBTRULE;

//------------------------------------------------------------------
///WBT受付識別ID
//------------------------------------------------------------------
typedef enum {
  WBTRECEPT_1 = 1,      ///<左側受付
  WBTRECEPT_2 = 2,      ///<右側受付
}WBTRECEPT;

//------------------------------------------------------------------
///WBTの状態
//------------------------------------------------------------------
typedef enum {
  WBTSTAGE_RECEPTION = 0,  ///<WBT状態：受付
  WBTSTAGE_ENTRY,          ///<WBT状態：エントリー
  WBTSTAGE_1ST,            ///<WBT状態：1回戦
  WBTSTAGE_2ND,            ///<WBT状態：2回戦
  WBTSTAGE_FINAL,          ///<WBT状態：決勝戦
  WBTSTAGE_WIN,            ///<WBT状態：勝利
}WBTSTAGE;

//------------------------------------------------------------------
/// WBTでの勝敗結果
//------------------------------------------------------------------
typedef enum {
  WBT_BTL_RESULT_LOSE = 0,
  WBT_BTL_RESULT_WIN,
  WBT_BTL_RESULT_DRAW,
  WBT_BTL_RESULT_DKO_WIN,
  WBT_BTL_RESULT_DKO_LOSE,
}WBT_BTL_RESULT;

//------------------------------------------------------------------
/// WBTのトレーナー分類
//------------------------------------------------------------------
typedef enum {
  WBT_TRTYPE_ROM = 0, ///<ロムに存在するトレーナー
  WBT_TRTYPE_DL,      ///<ダウンロードデータのトレーナー
  WBT_TRTYPE_SAVE,    ///<WB（データ引継ぎ）のトレーナー
  WBT_TRTYPE_PLAYER,  ///<プレイヤー
}WBT_TRTYPE;

//-----------------------------------------------------------------------------
/// WBTトレーナーの優先順位定義
//-----------------------------------------------------------------------------
typedef enum {
  WBT_TRPRI_NULL = 0,     ///<未定義
  WBT_TRPRI_WEAK_MOB = 1, ///<戦わないモブ
  WBT_TRPRI_MOB,          ///<戦うモブ
  WBT_TRPRI_LEADER,       ///<ジムリーダー
  WBT_TRPRI_CHAMP,        ///<チャンピオン
  WBT_TRPRI_SPECIAL,      ///<特殊（ダウンロードなど）
}WBT_TRPRI;

//------------------------------------------------------------------
//  WBT対戦相手用のメッセージオフセット
//------------------------------------------------------------------
enum {
  WBT_TRMSG_1ST_FIGHT_START = 0,  ///<バトル前、対戦相手の1回戦時
  WBT_TRMSG_2ND_FIGHT_START,      ///<バトル前、対戦相手の2回戦時
  WBT_TRMSG_3RD_FIGHT_START,      ///<バトル前、対戦相手の決勝戦時
  WBT_TRMSG_FIGHT_LOSE,           ///<バトル内、対戦相手の負けMSG
  WBT_TRMSG_FIGHT_WIN,            ///<バトル内、対戦相手の勝ちMSG
  WBT_TRMSG_PLAYER_WIN,           ///<バトル後、対戦相手の負けMSG
  WBT_TRMSG_PLAYER_LOSE,          ///<バトル後、対戦相手の勝ちMSG
  WBT_TRMSG_ANNOUNCE,             ///<バトル前、決勝戦の前口上

  WBT_TRMSG_TYPE_NUM,
};
//============================================================================================
//============================================================================================
//------------------------------------------------------------------
/**
 * @brief WBT中に保持する進行データの不完全型
 */
//------------------------------------------------------------------
typedef struct _WBT_SYSTEM WBTSYS;


