//============================================================================================
/**
 * @file  wbt.h
 * @brief   WBT制御オブジェクトの定義
 * @author  tamada GAME FREAK inc.
 * @date  2011.02.13
 *
 */
//============================================================================================
#pragma once

//============================================================================================
/**
 *								定数定義
 */
//============================================================================================
//------------------------------------------------------------------
//  トーナメントに参加するトレーナーの総数
//------------------------------------------------------------------
enum {
  WBT_TRAINER_NUM = 8,
};

//------------------------------------------------------------------
//  ひとつのトーナメントで戦う回数
//------------------------------------------------------------------
enum {
  WBT_BATTLE_NUM = 3,
};

//------------------------------------------------------------------
/// ダウンロード可能なデータの総数
//------------------------------------------------------------------
enum {
  WBT_DOWNLOAD_NUM = 3,
};

//------------------------------------------------------------------
/// ダウンロードデータ指定型
//------------------------------------------------------------------
typedef enum {
  WBT_DLID_NULL = 0,  ///<データ無し
  WBT_DLID_START = 1, ///<開始ID
}WBT_DLID;

//------------------------------------------------------------------
///WBTトーナメントの種類
//------------------------------------------------------------------
typedef enum {
  WBTCUP_NULL,     ///<トーナメント未指定
  WBTCUP_CHAMPION, ///<チャンピオントーナメント
  WBTCUP_POKETYPE, ///<タイプトーナメント
  WBTCUP_DOWNLOAD, ///<ダウンロードトーナメント

  WBTCUP_HODOMOE,     ///<ホドモエトーナメント           
  WBTCUP_ISSYU,       ///<イッシュリーダーズトーナメント 
  WBTCUP_KANTO,       ///<カントーリーダーズトーナメント 
  WBTCUP_JOUTO,       ///<ジョウトリーダーズトーナメント 
  WBTCUP_HOUEN,       ///<ホウエンリーダーズトーナメント 
  WBTCUP_SINOU,       ///<シンオウリーダーズトーナメント 
  WBTCUP_WORLD,       ///<ワールドトーナメント     
  WBTCUP_HODOMOE_EVENT, ///<ホドモエトーナメント（イベント）           
  WBTCUP_RENTAL,        ///<レンタルトーナメント
  WBTCUP_RENTALMASTER,  ///<レンタルマスタートーナメント
  WBTCUP_MIX,         ///<ミックストーナメント
  WBTCUP_MIXMASTER,   ///<ミックスマスタートーナメント

  WBTCUP_MAX,
}WBTCUP;

//------------------------------------------------------------------
///WBT対戦ルール
//------------------------------------------------------------------
typedef enum {
  WBTRULE_SINGLE,   ///<シングルバトル
  WBTRULE_DOUBLE,   ///<ダブルバトル
  WBTRULE_TRIPLE,   ///<トリプルバトル
  WBTRULE_ROTATION, ///<ローテーションバトル

  WBTRULE_MAX,
  WBTRULE_NULL = WBTRULE_MAX,     ///<ルール未指定
}WBTRULE;

//------------------------------------------------------------------
///WBT受付識別ID
//------------------------------------------------------------------
typedef enum {
  WBTRECEPT_1 = 1,      ///<左側受付
  WBTRECEPT_2 = 2,      ///<右側受付
}WBTRECEPT;

//------------------------------------------------------------------
///WBTの状態
//------------------------------------------------------------------
typedef enum {
  WBTSTAGE_RECEPTION = 0,  ///<WBT状態：受付
  WBTSTAGE_ENTRY,          ///<WBT状態：エントリー
  WBTSTAGE_1ST,            ///<WBT状態：1回戦
  WBTSTAGE_2ND,            ///<WBT状態：2回戦
  WBTSTAGE_FINAL,          ///<WBT状態：決勝戦
  WBTSTAGE_WIN,            ///<WBT状態：勝利
}WBTSTAGE;

//------------------------------------------------------------------
/// WBTでの勝敗結果
//------------------------------------------------------------------
typedef enum {
  WBT_BTL_RESULT_LOSE = 0,
  WBT_BTL_RESULT_WIN,
  WBT_BTL_RESULT_DRAW,
}WBT_BTL_RESULT;

//------------------------------------------------------------------
/// WBTのトレーナー分類
//------------------------------------------------------------------
typedef enum {
  WBT_TRTYPE_DEFAULT = 0,
  WBT_TRTYPE_ROM = WBT_TRTYPE_DEFAULT,  ///<ロムに存在するトレーナー
  WBT_TRTYPE_DL,                        ///<ダウンロードデータのトレーナー
  WBT_TRTYPE_DLHYBRID,                  ///<ロム＋ダウンロードデータのトレーナー
  WBT_TRTYPE_PLAYER,                    ///<プレイヤー
  
  WBT_TRTYPE_MAX,
}WBT_TRTYPE;

//-----------------------------------------------------------------------------
/// WBTトレーナーの優先順位定義
//-----------------------------------------------------------------------------
typedef enum {
  WBT_TRPRI_NULL      = 0,  ///<未定義
  WBT_TRPRI_1,
  WBT_TRPRI_2,
  WBT_TRPRI_3,
  WBT_TRPRI_4,
  WBT_TRPRI_5,
  WBT_TRPRI_MAX,

  WBT_TRPRI_WEAK_MOB  = WBT_TRPRI_1,  ///<戦わないモブ
  WBT_TRPRI_MOB       = WBT_TRPRI_2,  ///<戦うモブ
  WBT_TRPRI_LEADER    = WBT_TRPRI_3,  ///<ジムリーダー
  WBT_TRPRI_CHAMP     = WBT_TRPRI_4,  ///<チャンピオン
  WBT_TRPRI_SPECIAL   = WBT_TRPRI_5,  ///<特殊（ダウンロードなど）
}WBT_TRPRI;

//------------------------------------------------------------------
/// ROMトレーナーデータの不完全型
//------------------------------------------------------------------
typedef struct _WBTROM_TRDATA WBTROM_TRDATA;

//------------------------------------------------------------------
/// ROMトレーナー指定ID
//------------------------------------------------------------------
typedef u8 WBTROM_TRID;

//============================================================================================
//============================================================================================
//------------------------------------------------------------------
/**
 * @brief WBT中に保持する進行データの不完全型
 */
//------------------------------------------------------------------
typedef struct _WBT_SYSTEM WBTSYS;


