//=============================================================================
/**
 * @file  bugfix.h
 * @date  2010.07.12
 * @brief バグ対処用定義
 * 定義の有効・無効で決まります  反映させない不具合はコメントにしてください
 */
//=============================================================================

#pragma once


//*****************************************************************************
//--バグ掲示板 BTSXXXX
//*****************************************************************************

#define BUGFIX_BTS7711_20100712   //WiFi大会の選手証でトレーナー名が切れて表示されるバグの対処

/*
  [ BTS7714 ] ボックス
  メニュー「もちもの」でバッグに戻すときの「はい・いいえ」時に
  トレイ切り替えの矢印が表示されたままになっている
*/
#define BUGFIX_BTS7714_20100712

// 【フォルムNo.が「0」以外のガーメイルが、通信交換に出せない】不具合修正
#define BUGFIX_BTS7718_100712

// 【ユンゲラーの通信進化デモ中に額の星マークが崩れている】不具合修正
#define BUGFIX_BTS7721_100712

//ふしぎなおくりものでカードを消したときBを押すと送りアイコンのみ消えるバグの修正
#define BUGFIX_BTS7724_20100712

//WIFIクラブ 募集開始にラグが存在する不具合修正
#define BUGFIX_BTS7736_20100712

// BTS7737:「メールをよむ」を選択すると、「U」マークも暗くなってしまうの修正
#define BUGFIX_BTS7737_20100712

//赤外線交換 たまごの交換の場合秘伝技検査を行わない
#define BUGFIX_BTS7742_20100712

//GDSのバトルビデオのマルチランキングで相手のポケモンが表示されているの修正
#define BUGFIX_BTS7719_20100712

//VCHATにノイズがのることで不具合が生じる事に対しての対処
#define BUGFIX_BTS7722_20100713

//ランダムマッチフリーモードにて、エラー画面で切断された後シーケンス移動するとはまりの修正
#define BUGFIX_BTS7733_20100712

//【きねんリボン画面のリストにて十字ボタンでカーソル移動させた際のSEについて】
#define BUGFIX_AF_BTS7734_100806

//【ミュージカルのメンバー募集で、リーダー側に表示される「あと○人まで」の数字表記が重なってしまう事があった】
#define BUGFIX_AF_BTS7835_20100806

//通信切断エラー後、画面を送っても対戦相手を募集している階層へもどることがあるの対処
#define BUGFIX_BTS7738_20100712

//  [ BTS7745 ] 図鑑　検索後のリストから再検索して戻るとリストのレイアウトが検索リストになっている
#define BUGFIX_BTS7745_20100712

// BTS7747:バッジがくすむスピードが２日ではなく0.75日になってしまっている（２日で３下がる）
// app/trainercard/badge_view.c
#define BUGFIX_BTS7747_20100712

//【身代わり状態で複数回攻撃技を使用すると攻撃時のテキストが一瞬表示される】
//battle/btlv/btlv_effvm.c
#define BUGFIX_BTS7710_20100712

//wifiクラブ話しかけ時にキャンセルすると、相手側のBUSYがのこってしまう不具合修正
#define BUGFIX_BTS7749_20100713

//ポケモン交換時に増殖してしまう、表示がかわってしまう不具合修正 BTS7752かねる
#define BUGFIX_BTS7750_20100713

//ドレスアップ確認画面で進むとはまる
#define BUGFIX_BTS7755_20100713

// 【マルチバトルを行なった際の前回の記録でのポケモンが（味方・相手）VS（自分・相手）という表示になる】不具合修正
#define BUGFIX_BTS7753_100713

//手持ち不正のときの通信エラーをとじた後、３０秒間ボタン操作が効かなくなるバグを対処
#define BUGFIX_BTS7760_20100713

// BTS7754:対戦結果の「WIN」のパーティクルが崩れることがある。
// demo/comm_btl_demo/comm_btl_demo.c
#define BUGFIX_BTS7754_20100713

//Wi-Fi大会見せ合い～結果画面までにLANケーブルを抜き、差し戻した場合、切断回数が増加しないバグを修正
#define BUGFIX_BTS7762_20100713

// [ BTS7778 ] タマゴの中身が図鑑登録される
#define BUGFIX_BTS7778_20100713

//通信エラー後、画面を切り替えてもリングのSEが鳴り続けることがあったバグを修正
#define BUGFIX_BTS7775_20100713

//Wi-Fi大会で内部的にマッチングしている両者がサーチを中断するとエラー移行後に選択肢が残る問題を修正
#define BUGFIX_BTS7769_20100713

//VCHATで親機子機交互に変更するとつながらない不具合
#define BUGFIX_BTS7785_20100713

// [ BTS7790 ] ボックス 「にがす」実行後に不必要なメッセージウィンドウが表示されている
#define BUGFIX_BTS7790_20100714

// [ BTS7793 ] ボックス 道具を持っていないのに「メールは～」と表示される
#define BUGFIX_BTS7793_20100714

// [ BTS7796 ] 図鑑 LRを同時押しするとリストが崩れる
#define BUGFIX_BTS7796_20100714

//GTSにて選択したアイコンと、実際の挙動が異なってしまうバグの修正
#define BUGFIX_BTS7795_20100714

//GTSにて【選ぶ相手がいないにも拘らず、相手を選ぶよう促すメッセージが表示される】の対処
#define BUGFIX_BTS7794_20100714

//GTSにて受信強度アイコンにマスクがかかっているバグを修正
#define BUGFIX_BTS7802_20100714

// 【検索結果が12個だった場合、画面のスクロールを行えない状況でスクロールバーが表示される】不具合修正
#define BUGFIX_BTS7812_20100714

//DWCLIB割り込み内でヒープが足りなくなった為 OS_Panicを入れました 保留案件
#define BUGFIX_BTS7819_20100715

// [ BTS7820 ] バッグ ポケットのＹ登録のチェックボックスが反応しないのに表示されている
#define BUGFIX_BTS7820_20100714

//大会データアクセス時にはまってしまうことがあるのバグを対処
#define BUGFIX_BTS7821_20100714

///BTS7823  【全滅した際の画面に受信強度アイコンの表示がありません】の対処
#define BUGFIX_BTS7823_20100715

// 通信対戦時に両者ひん死入れ替えが発生した際、ポケモン選択が終わった側に「通信待機中」のメッセージを表示する。
#define BUGFIX_BTS7825_20100715

//タッチとキーが同時に入力された場合のリストの不具合の対処
#define BUGFIX_BTS7830_20100715

//ランダムマッチにて放置していたところエラーメッセージでアサートが表示されることがあったのバグを修正
#define BUGFIX_BTS7842_20100715

//ライブ大会にて、バトル終了後ROM同士を引き離すと片方が暗転状態ではまるバグの修正
#define BUGFIX_BTS7837_20100715

//フリーモードにて不正操作を行っても子機のみ録画可能になっている件を修正
#define BUGFIX_BTS7849_20100715

//自機、【十字ボタンの同時入力で、入力している方向と違う方向に進む】を修正
#define BUGFIX_BTS7846_20100715

//ダウンロードライブラリにタイムアウトを追加
#define BUGFIX_BTS7852_20100715

//タイムアウトを追加
#define BUGFIX_BTS7868_20100716

//ミッション受注後、通信遅延が発生すると受注したのに参加していない、という現象が発生する
#define BUGFIX_BTS7874_20100716

//LV1ご褒美の時にはFinishを送らない  エラー処理には行かないように修正しました
#define BUGFIX_BTS7876_20100716

//ランダムマッチにてBキャンセル中にWiFiから切断されるとはまるバグの修正
#define BUGFIX_BTS7867_20100716

// 【戦闘終了後、進化したと同時に新しい技を覚えさせようとした際、受信強度アイコンが表示されていない】不具合修正
#define BUGFIX_BTS7893_100719

//Wi-Fi大会で大会終了時のセーブ中にエラーが起こるとバグを修正
#define BUGFIX_BTS7895_20100719

// 募集時にエラーが発生した時にタイミングよく募集を取りやめると、エラーが消えてしまう
#define BUGFIX_BTS7918_20100726  //こちらはいれバグになったため現状GetVersionがダミーで呼ばれている 必要ないのでコメントにしてよい8/12 k.ohno

// 募集時にエラーが発生した時にタイミングよく募集を取りやめると、エラーが消えてしまう
// NetErr_MainをNET_DEV_Mainの直後で呼ぶことで修正
//#define BUGFIX_BTS7918_20100812


//wifiランダムマッチでマッチング時のメモリーの断片化による不具合対処の為
// 1.本番用ROMではメモリーを100K多めに割り当てる
// 2.無理やりエラー画面を出す対処追加
#define BUGFIX_BTS7931_20100726

//ライブキャスターのお絵描きでフリーズ
//下の定義はロットが分かれた場合に有効にすること
#define BUGFIX_BTS7934_100726
//#define BUGFIX_BTS7934_100726_2ND

// 【レアカラーのポケモンを捕まえた際の図鑑にある「みつけた　すがたの　かず」の加算について】不具合修正
#define BUGFIX_BTS7936_20100726

//【ホワイトフォレストの草むら、水上でエンカウントしなくなることがあった】修正
#define BUGFIX_BTS7926_20100726

//ユニオンルームのチャットに友達じゃないのに「友達」と表示される
#define BUGFIX_BTS7903_20100726

//バトルビデオアップロードで5文字を超えたニックネームの不正ポケモンを送信すると自分のローカルビデオでのニックネームが文字化けする
#define BUGFIX_BTS7939_20100726

//Wi-Fi大会で選手証セーブ時にエラーや電源切断が起こるとセーブとサーバーの開催ワークが同期しなくなるバグ修正
#define BUGFIX_BTS7898_20100726

//【ユナイテッドタワーに配置されるNPCの初回テキストに表示される交換したポケモンが状況に合っていない】バグ修正
#define BUGFIX_BTS7927_20100726

//ライブ大会にて、設定した対戦回数を超えてバトルを行なう事が可能なバグ修正
#define BUGFIX_BTS7901_20100726

//【大会終了告知受領後のサーバ開催ワーク書き換えで通信エラーになると、以降再接続時にサーバ開催ワークが書き換えられない】
#define BUGFIX_BTS7890_20100726

//【進化後に特性が変化するポケモンがいる】
#define BUGFIX_BTS7955_20100728


//【海底遺跡および深海マップからマップ遷移した時の季節変化について】
//field/event_mapchange.c
//#define BUGFIX_AF_BTS7986_20100806

// ライブ通信のメイン画面でお礼アイコンのON/OFFを切り替えていると、合計人数の数字が重なって表示されることがある
#define BUGFIX_AF_BTS8022_20100806

//【IDイベントにて別IDのタマゴがボックスにあると、タマゴがカウントされる】
#define BUGFIX_AF_BTS7899_20100806

//親機探索メニューで特定の手順で子機が抜けれなくなる
//#define BUGFIX_AF_BTS7875_20100806

//申し込みを取りやめる「はい」「いいえ」ウィンドウをキャンセルすると下のウィンドウが欠ける
#define BUGFIX_BTS7887_20100806

//親機しかいないのに子機が参加している時のテキストが表示される
#define BUGFIX_BTS7886_20100806

//通信募集で誰かと接続した後にBでやめようとすると、相手がいなくても「解散しますか？」が出る
#define BUGFIX_BTS7889_20100806

//通信エラー画面で、蓋を閉じてバックライトOFFの状態でもAorBを押すとボタン操作が効いてしまう
#define BUGFIX_BTS7870_20100806

//ハイリンクで2番目に橋の上を行き来すると2番目に接続した相手の名前が一瞬表示される
#define BUGFIX_BTS7869_20100806

//ぐるぐる交換で募集を締め切ったのにアピールジャンプする
//#define BUGFIX_BTS7943_20100806

//ハイリンクで接続したターゲットが自分のハイリンクに表示される事がある
#define BUGFIX_AF_BTS8033_20100902

//ハイリンク専用画面に一瞬、侵入者とターゲットの表示が混在して表示される
//#define BUGFIX_AF_BTS7221_20100903

//NTR-CAPTUREですれ違いデータを受信しなくなる
//※未対処です。その為、現状報告をログとして残す意味でここに記します
//  NTR-CAPTURE限定で発生しているバグです。
//  しかしバグ報告があったバージョンであっても社内で再現が出来ていません。
//　社内のNTR-CAPTURE、IS-DEBUGGER、双方で何時間も再現確認を企画にしてもらいましたが、
//  再現は出来ておらず、マリオクラブ様の方でも再現が出来なくなっています。
//  ソースで怪しい部分を探りましたが、こちらも特におかしな所は見つかっていません。
//    2010.09.06(月) matsuda
//#define BUGFIX_AF_BTS3936_20100906

//※未対処です。その為、現状報告をログとして残す意味でここに記します
//このバグを対処するには「侵入する側」が、「受け取ったビーコンの主は調査レーダー画面を開いている」
//というのを判別する必要があります。
//現在の送信ビーコンデータの中にはそれを判別するデータは含まれていませんので、
//修正を行う場合、GBS_BEACON構造体のpaddingから1bit新たに用意し、
//調査レーダー画面を開いた時点でそのビットをON(出るときにはOFF)、
//対象のビーコンを受け取った「侵入する側」でフラグを参照し、
//対象に含めないようにする事で対処になります。
//(intrude_comm.cの_SetScanBeaconData関数内で捨てます)
//  2010.09.14(火) matsuda
// ※但し、既に市場に出回っている何百万本というシャチがそのフラグを持っていないため、
//   修正はほぼ意味がないものだと思います。
//#define BUGFIX_AF_BTS7622_100914

//※未対処です。その為、現状報告をログとして残す意味でここに記します
//再現性も無い事からソースレベルで調査を行いましたが原因特定にいたりませんでした。
//次期バージョンに備え関連箇所を述べます。
//・対象ファイル　intrude_subdisp.c
//・症状　背景BGの色、街アイコンの色、この両方が通常であれば同じ色になっているはずが
//　　　　背景BGは侵入先の色、街アイコンは自分の色(報告では侵入者なのでNetID 0番)
//        になっている事が問題です。
//・見解　症状発生後、即エラーが発生していますので、
//        背景BG=侵入先のエリア番号(NetID 1番)
//        街アイコン=エラーが発生している為、0番
//        をそれぞれ参照しているのではないかと考えています。
//・ソース箇所
//        背景BGの更新は_IntSub_BGColorUpdate関数です。
//        街アイコンの更新は_IntSub_ActorUpdate_TouchTown関数です。
//        どちらもcomm->now_palace_areaで自分がいるエリアを判定しているので、
//        ずれた表示になるのはありえない、、、はず。という所です。
//        comm->now_palace_areaの更新は_IntSub_CommParamUpdate関数で行っています。
//        ※エラー時は全体初期化するため、now_palace_areaは0になります。
//#define BUGFIX_AF_BTS7998_100914

//【全滅すると、戻り先のポケセンから出るまでは、すれ違った場所が正常に表示されない】
#define BUGFIX_AF_BTS7826_20100806

//【ふしぎなカードに関する選択肢を決定する際、Aボタンを押し続けると、再度選択肢が表示されます】
#define BUGFIX_AF_BTS7960_20100806

//【Wi-Fi接続の選択肢表示前に決定が入力出来てしまう事があります】
#define BUGFIX_AF_BTS7810_20100806

//【ライブ大会デジタル選手証取得時の赤外線通信画面からエラー画面へ移行することがあった】
#define BUGFIX_AF_BTS7976_20100806

//【ニックネームの入力画面でポケモンアイコンをタッチするとアイコンが右にずれる】
#define BUGFIX_AF_BTS7858_20100806

//【ハイリンクで侵入されている場合、文字入力パレット画面で2種類のテキストが重なる】
#define BUGFIX_AF_BTS8006_20100806

//【タウンやシティにいる状態でタウンマップを使用した時のアイコンの表示について】
#define BUGFIX_AF_BTS8005_20100806

//【「そらをとぶ」画面から抜けようとした直後に決定すると「そらをとぶ」が実行される】
#define BUGFIX_AF_BTS8009_20100806

//【ライブ大会、設定したバトル回数の最後のバトル後、アッパーバージョンとのバトルビデオが再生できます】
#define BUGFIX_AF_BTS8030_20100806

//【アイテム「しんかいのウロコ」が配置されている浅瀬で、「なみのり」から浅瀬に上陸出来ない箇所がある】
#define BUGFIX_AF_BTS7995_20100806

//【「なみのり」で移動中、沿岸にいるNPCに向かって移動すると、上陸できてしまいNPCと主人公が重なることがあった】
#define BUGFIX_AF_BTS7935_20100724

// 【全国図鑑未入手の状態で全国図鑑のポケモンを捕獲した時の図鑑No.の表記について】zkn.gmmを修正してコミットしただけ。
#define BUGFIX_AF_BTS7908_20100903

//自己紹介を登録する時に単語入力のない定形文を選択するとNPCがちぐはぐなことをいうバグへの対処
#define BUGFIX_AF_BTS7862_20100902

//【調査報告画面の順位欄にタッチ判定のない部分が生まれる】
#define BUGFIX_AF_BTS7816_20100906

// 【子機側のテキストの自動送りの速度が速く途中で切れているように見える】
// 素材と子機ROMの更新のみになります。
//multiboot2/spec/main.sgn
//multiboot/spec/main.sgn
//prog/filetree/dl_rom/child.srl
//prog/filetree/dl_rom/child2.srl
//resource/message/src/mb_child_movie.gmm
#define BUGFIX_AF_BTS7717_20100906

//【ポケモン情報画面でポケモンをタッチした直後にタマゴの情報画面に切り替えるとタマゴが背面グラフィックになる】
#define BUGFIX_AF_BTS7848_20100913

//【ねむけ玉発動時にポケモンが眠らないことがあった】
//#define BUGFIX_AF_BTS8034_100913

//【「ならびかえ」のキャンセルをする際に「戻る」アイコンをタッチしても、アイコンの点滅演出がありません】
#define BUGFIX_AF_BTS7984_100913

//【「たたかうわざ」画面で空スロットの1つ上の技をタッチで選択すると、移動できない方向に矢印アイコンが表示される】
//#define BUGFIX_AF_BTS7973_100913

//【2種類のテキストが重なることがあった】
#define BUGFIX_AF_BTS7924_100914

//【ポケモン情報画面を消した後、ボックスがオートでスクロールしてしまう】
#define BUGFIX_AF_BTS7735_20100914

//【左手親指のガイドに指を乗せた際に画面上に表示されるガイドの一部がちらつく】
#define BUGFIX_AF_BTS7817_20100914

//【大会終了処理でバトルボックス解除メッセージが表示されない】
#define BUGFIX_AF_BTS7944_20100806

//【ボックスに空きがあると「ようすをみる」画面においてポケモンを下方向へ切り替えることができない】
#define BUGFIX_AF_BTS8044_20100914

//【ローテーションバトルで「たたかう」を選択した直後、「シューター」ボタンが「バッグ」ボタンに変化している】
//battle/btlv/btlv_input.c
//この定義を有効にする場合はresource/battle/battgra_wb.scrにbattle_w_bg0l.NSCRを追加しないとMAKEが通りません
#define BUGFIX_AF_BTS7728_20100914

//【じゅくがえりの『アン』が所持しているミノマダム（虫・地面）が「リーフストーム」を使用する】
//tr_tool/tr_tool.c
//#define BUGFIX_AF_BTS7992_20100914

//【バトル中におけるトレーナーの影の表示についての質問】
//system/mcss.c
//#define BUGFIX_AF_BTS8038_20100914

//【ライブ大会、ポケモン選択画面の「決定」ボタンが高速で点滅します】
#define BUGFIX_AF_BTS7843_100914

//【ポケモンの配信を受け取っている時、ウインドウの下部にポケモンのグラフィックが一瞬表示される】
#define BUGFIX_AF_BTS7881_20100914

//【ポケモン選択画面で暗転したままになり、選択時間切れでVS画面に移行後暗転(白転)したままはまることがあった】
//#define BUGFIX_AF_BTS7982_20100914

//【配信期間切れかつ大会終了後接続時に「データを　送っています…」で通信切断するとはまる】
//またこのBTS7947の対処でBTS7895についてもされます修正
#define BUGFIX_AF_BTS7947_20100914

//【通信エラー表示中に回転しているリンクのSEが鳴り続ける】
#define BUGFIX_AF_BTS7759_20100914

// BTS7983:ポケモンリストからタッチし続けているとメール閲覧画面で即終了してしまう
// src/app/mail/mailview.c
#define BUGFIX_AF_BTS7983_20100915

// BTS7916:右下の「×」のタッチ判定が広い（リストタッチした時の「もどる」と同じ範囲になっている）
// src/app/waza_oshie/wo_main.c
#define BUGFIX_AF_BTS7916_20100915

//【バトルビデオのランキング画面でスライドさせるとポケモンのアイコンが一瞬表示化けする】
//※未対処です。その為、現状報告をログとして残す意味でここに記します
//ポケモンアイコンを読み込む処理負荷が高く、一瞬アイコンがぱしっています。
//これを解決するためには、余分に上下に1OBJ（もしくはリソース）を呼んでおき、
//入れ替えて表示する必要があります。現在は直接見える場所に転送しているためパシリます。
//（VBLANKでも試しましたが転送が間に合いませんでした）
//ソースの変更箇所が多くなるため修正しておりません。アッパー開発時に対処の予定です。
//#define BUGFIX_AF_BTS7847_20100916

// BTS7892:ぐるぐる交換でポケモンリストからステータスを見に行き、
// 戻ってくるとカーソルが1匹目（左上）に移動してしまう
// src/net_app/guru2/guru2.c
#define BUGFIX_AF_BTS7892_20100915

//BTS7715【8文字のアイテム名のとき、右端が枠に重なってしまうものがある】のバグ修正
#define BUGFIX_AF_BTS7715_20100916

//【「ようすをみる」と「ポケモンを選ぶ」で、表示位置が異なるテキストがある】
#define BUGFIX_AF_BTS7723_20100916

//【フィーリングチェックで相手と接続できなくなることがある】のバグ修正
//タイムアウトを追加し、メニューのシーンのずれを消しました
//#define BUGFIX_AF_BTS7929_20100915

//【大会選手証所持状態からのWi-Fiユーザー情報更新フローについて】
#define BUGFIX_AF_BTS7878_20100916

//【「ポケモンを探す」で見つかった相手の表示が残り続ける】
#define BUGFIX_AF_BTS7863_20100916

//【残り1体のポケモンがノーダメージの状態でバトルに勝利し、デバッグモードから対戦相手の履歴を確認した時、残りのポケモン数が異なっている】
//#define BUGFIX_AF_BTS7957_20100916

//【調査報告の下画面に表示される「合計人数」と「今日の人数」のテキスト表示位置が若干ずれている】
#define BUGFIX_AF_BTS7803_20100916

//【アララギ博士の捕獲デモ中のモンスターボールのアイコンの表示について質問】
//battle/btlv/btlv_scd.c
#define BUGFIX_AF_BTS7891_20100917

//*****************************************************************************
//--社内バグ掲示板 GFBTSXXXX
//*****************************************************************************

// WIFI交換の時にタイマーアイコンの更新処理と削除処理が重なりフリーズした不具合修正
#define BUGFIX_GFBTS1957_100712

#define BUGFIX_GFBTS1958_20100712 //WiFi大会でマッチング中に、はまるバグの対処

//ポケモン交換時にアイテム表示が出ていない不具合修正
#define BUGFIX_GFBTS1963_100712

#define BUGFIX_GFBTS1965_20100712  //仮素材削除対応

//WIFI大会でマッチング中に、対戦相手以外の選手証が表示される場合があるの対処
#define BUGFIX_GFBTS1961_20100712

// 【図鑑登録：有り得ないフォルムNo.のポケモンを登録したときにINDEXがずれる】不具合修正
#define BUGFIX_GFBTS1964_100712

//バトルレコーダーのポケモンリストの並びがおかしいの対処
#define BUGFIX_GFBTS1974_20100713

//【一本橋からエフェクトの発生グリッドに落ちても、特殊エンカウントイベントが起動しない】を修正
#define BUGFIX_GFBTS1967_100713

//PGLサーバにプロファイルIDを送る必要があるの対処
#define BUGFIX_GFBTS1976_20100714

//【自機がグリッド間移動中に通信エラー画面が起動するとPOSイベントをすり抜けるバグ】を修正
#define BUGFIX_GFBTS1975_100713

//【自機がグリッド間移動中に侵入相手から場取るミッションによる話しかけが起動するとPOSイベントをすり抜けるバグ】を修正
#define BUGFIX_GFBTS1979_100714

//GFL_PROC_FreeWorkの場所を適切な位置に移動
#define BUGFIX_GFGTS1978_20100714

// ポケモン交換をいったんとりやめてもう一回ポケモンを交換するとCheckSumErrorになる不具合を修正
#define BUGFIX_GFBTS1981_20100714

// レベルアップ時、クライアント側データのタイプをデフォルト値に書き戻してしまう不具合を修正
#define BUGFIX_GFBTS1990_20100716

//  通信のクロスチェックを行った結果の修正箇所です
#define BUGFIX_GFBTS1989_20100716

//  WiFi大会の成績データが初期化されている箇所がある
#define BUGFIX_GFBTS1987_20100716

//  全滅後、フィールドに戻ってくると、c-gearのダウンロードスキンにアルファがかかっていない。
#define BUGFIX_GFBTS1994_20100719

//  イベントのライブキャスターで通信アイコンが出ていない
#define BUGFIX_GFBTS1995_20100719

//  バトルレコーダーでセーブ中エラーになるとはまるバグを修正
#define BUGFIX_GFBTS1996_20100719

//  イベントのライブキャスターにデバッグが残っている
#define BUGFIX_GFBTS1997_20100726

//フィールドに配置してあるモンスターボールのアイテムを取ると、ボールが一瞬化けます。を修正
#define BUGFIX_GFBTS2003_20100726

// 育て屋のポケモンがタマゴを産んだ時、手持ちがMAXでも呼び止められてしまうバグを修正
#define BUGFIX_GFBTS2008_20100726

// [GFBTS2013] 殿堂入りＰＣ画面の回収表示が２桁になっている
// pc_dendou.gmmも修正されてます
#define BUGFIX_AF_GFBTS2013_20100806

// ライブ通信メイン画面でメンバーリストのランク表示がスクロール時にバグる現象を修正
#define BUGFIX_AF_GFBTS2002_20100806

//【ふしぎなおくりもの：カードアルバムの矢印がチラつく】
#define BUGFIX_AF_GFBTS2004_20100806

//ランダムマッチのポケモン選択画面で片方がフリーズする
#define BUGFIX_AF_GFBTS2015_100806

//【Wi-Fi大会：バトルボックスの技を入れ替えるとマッチングしなくなる】
#define BUGFIX_AF_GFBTS2017_100806

//D09　チャンピオンロード外のBLOCK（１，１）　LOCAL(２７，６) RAIL INDEX　１８　FRONT 1　SIDE　２の見た目と合わない場所にエンカウントアトリビュートがあります。
//resource/fldmapdata/rail_data/rail/d09.atdat
//resource/fldmapdata/rail_data/rail/d09.attr
//#define BUGFIX_AF_GFBTS1999_100903

//【ヤグルマの森外マップ（D02/map18_19）のLOCAL30,22～30,23にかけて、外観では弱草が敷かれていますが、設定されているアトリビュートが水溜りになっているため、エンカウントが起こりません。】
//resource/fldmapdata/landata/land_res/map18_19.bin
//#define  BUGFIX_AF_GFBTS1960_100903

//【ヤグルマの森外マップ（D02/map18_19）のLOCAL14,13にて、通常地面にも関わらず、水溜りのアトリビュートが設定されており、歩くと波紋が生じます。】
//resource/fldmapdata/landata/land_res/map18_19.bin
//#define  BUGFIX_AF_GFBTS1959_100903

//【P2ラボ（D13）のBGM指定が全ての季節で春のものになっています。】
//下記のとおり、バグ修正定義を追加してありますが実際にはバイナリ変更のため対応箇所には影響しません。
#define BUGFIX_AF_GFBTS1966_100906

// すれ違い調査隊本部：ポスターへの話しかけ時にSEが当たっていない。
#define BUGFIX_AF_GFBTS1915_20100906

// すれ違い調査隊隊長：依頼の確認項において、不要なLAST_KEYWAIT()とメッセージクローズが入っている。
#define BUGFIX_AF_GFBTS1998_20100906

//チャンピオンロード
//レール座標（４８，１，４）の位置、（ポケモンリーグとの接続から入って左にある段々の上から２つめ）
//から左に移動している途中に、
//下を押して滑り降りると移動不可能な場所に滑り降りてしまう。
#define BUGFIX_AF_GFBTS2021_20100923

// 【レールマップ】波乗り問題
//．レールマップであり、
//．レール座標がfront=0 side=0であり、”アトリビュート数が特定の値”のある位置で、
//．sideの値が少なくなる方向に向いている状態で
//．ポケモンリストから波乗りを使ったとき
//
//波乗りが出来てしまい、移動が不可能な状態となります。
//さらに、そのままセーブしてしまうとユーザーが自力で復帰することが不可能になります。
// prog/src/field/rail_attr.c
#define BUGFIX_AF_GFBTS2025_20100928

// 【トレーナーカード】ホワイトバージョンのトレーナーカードにて、カードカラーが
// 最高ランクになった際、カード裏のスコアボックスを囲っている枠線の右下にドット欠けがあります。
// ※BG素材のみコミットのためソースコードは変更ありません
#define BUGFIX_AF_GFBTS1936_20100914

// リターンマークが入っているのにSEが決定音である不具合修正
// BTS7987も同じバグでした
#define BUGFIX_AF_GFBTS1806_20100914

//【ふしぎなおくりもの：カードいっぱい時の整理シーケンスでテキストに改行コードがない】
//このバグを修正するためにはGMMに改行コードを追加する必要があるため、
//mystery.gmmも同時にコミットしています。
//上記のバグはgmmだけで修正可能なのですが、gmmに改行コードを追加すると、テキスト送りが2回になるというバグがでてしまうため、以下の定義で修正しています。
//ですので以下の定義のみ外してしまうと、テキスト送りが2回でるというバグがでてしまいます！コメントアウトしてはいけません！
//また、BTS7971もこのGMMのコミットで修正されております。BTS7971はプログラム的な変更はございません
#define BUGFIX_AF_GFBTS2005_20100915

//【天気中にYボタンメニューを開くと後ろの雪等のOBJが透過されず黒く見えてしまう】
#define BUGFIX_AF_GFBTS1918_20100915

// [ GFBTS2020 ] ボックス：ポケモンアイコンが消える
#define BUGFIX_AF_GFBTS2020_20100924

//GFBTS2027【GTSでポケモンを探す時、検索失敗した後に「選ぶ」を押すとブラックアウト後停止】
#define BUGFIX_AF_GFBTS2027_2010107

//【ユニオン友達リストの追加が排他的になっていない】
// 同じ人とユニオン接続し続けていても３２人に到達してしまいます。
#define BUGFIX_AF_GFGTS2032_20101028

//*****************************************************************************
//--ガイドライン掲示板 GLBTSXXXX
//*****************************************************************************


//*****************************************************************************
//--PGL掲示板
//*****************************************************************************

//【セーブデータのアップロードの管理画面について、寝たポケモンが表記されない】
#define BUGFIX_PGLBTS78_100712

// レスポンスエラーを増やす対応
#define BUGFIX_PGLBTS85_20100715


//*****************************************************************************
//--外部配信ROM掲示板
//*****************************************************************************

//タマゴを配信したときに孵化歩数が正しく反映されない
#define BUGFIX_OUTROMBTS32_20100716


//*****************************************************************************
//--ガイドライン掲示板\\\ GLBTSXXXX
//*****************************************************************************
//バトルレコーダーでビデオ削除中のセーブでスリープが効いてしまう
#define BUGFIX_LTC0003_20100726

//*****************************************************************************
//--質問掲示板
//*****************************************************************************

//タマゴ生成の抽選カウンタがフィールド破棄の度にリセットされるため、タマゴが発生しにくいバグを修正
#define BUGFIX_QABTS692_20100726


//*****************************************************************************
//--スクリプト不具合修正コメント　ここから↓
//
// スクリプトの不具合修正に関しては、修正内容にgmmが絡むものが多いため
// タグ定義による修正反映切替を行っていません。
// bugfix.hへはsvnのログ管理のためにコメントを残しています
//
// 定義をコメント化しても、修正が未反映にはならないのでご注意ください
//
// ログ管理のためプログラマがコミットしていますが担当者は別です。
// 担当者については、各タグのコメントを参照してください。
//*****************************************************************************

/*
 * GFBTS1983
 * サンドイッチ屋さんバイトイベントでの送り記号表示修正
 *
 * -h04.ev
 * -h04.gmm
 *
 *  担当：村上
 */
#define BUGFIX_AF_GFBTS1983_100914

/*
 * GFBTS1973
 * H03 暴走族総長との戦闘イベントで、「はい／いいえ」の表示前にキー待ち記号が表示されている
 *
 * -h03.gmm
 *
 *  担当：村上
 */
#define BUGFIX_AF_GFBTS1973_100914

/*
 * GFBTS1941
 * プラズマ団の隠れ家前、アーティVSプラズマ団イベントで送り記号が足りない部分がある
 *
 * -c03p07.ev
 *
 *  担当：村上
 */
#define BUGFIX_AF_GFBTS1941_100914

/*
 * GFBTS1940
 * アトリエ、指定タイプポケモンをみせるイベントでの送り記号不具合修正
 *
 * -c03r0201.gmm
 *
 *  担当：村上
 */
#define BUGFIX_AF_GFBTS1940_100914

/*
 * GFBTS1776
 * C03R1101：ポケモン盗難後、ゲーチスイベントで
 * アーティが部屋から出て行くときに、マットを越えた場所で消えている不具合修正
 *
 * -c03r1101.ev
 *
 *  担当：村上
 */
#define BUGFIX_AF_GFBTS1776_100914

/*
 * GFBTS1737
 * C03R0601：ヒウンゲートのサポート戦闘イベント：
 * サポートの登場位置が進入不可の場所から出てくる不具合修正
 *
 * -c03r0601.ev
 *
 *  担当：村上
 */
#define BUGFIX_AF_GFBTS1737_100914

/*
 * GFBTS1968
 * 博士のヒヒダルマ説明イベント：不要なメッセージクローズを削除
 *
 * -d03r0101.ev
 *
 *  担当：杉中
 */
#define BUGFIX_AF_GFBTS1968_100915

/*
 * GFBTS1902
 * 博士のポケモンセンター案内イベント：不要なキー待ち記号を削除対処、ラストキーウェイトを追加
 *
 * -t02pc0101.ev
 * -t02pc0101.gmm
 *
 *  担当：杉中
 */
#define BUGFIX_AF_GFBTS1902_100915

/*
 * BTS8023
 * ワンダーブリッジのミネズミイベント・二重キー待ち修正（GMM側で送りマーク削除・スクリプトで文字送り追加）
 *
 * -h05.ev
 * -h05.gmm
 *
 *  担当：杉中
 */
#define BUGFIX_AF_BTS8023_100917

/*
 * BTS7904
 * 認定トレーナーメッセージ表示条件修正
 *
 * -c08gym0101.ev
 *
 *  担当：水口
 */
#define BUGFIX_AF_BTS7904_100917

/*
 * BTS7910
 * ショウロのバトルボックス説明が実挙動と異なる。メッセージ修正
 *
 * -c01r0102.gmm
 *
 *  担当：松宮
 */
#define BUGFIX_AF_BTS7910_100916

/*
 * BTS7951
 * マルチトレインの説明が設定と異なる。メッセージ修正
 *
 * -t05.gmm
 *
 *  担当：松宮
 */
#define BUGFIX_AF_BTS7951_100916

/*
 * BTS7965
 * TV番組：「わざと暮らす-ちょうのまい」の内容が不適切。メッセージ修正
 *
 * -tv01_01_scr.gmm
 *
 *  担当：松宮
 */
#define BUGFIX_AF_BTS7965_100916

/*
 * GFBTS2018
 * ライモンジム：コースタートレーナー全滅時に、トレーナーを非表示に戻す
 *
 * -c04gym0101.ev
 *
 *  担当：斉藤(マ)
 */
#define BUGFIX_AF_GFBTS2018_100930

/*
 * GFBTS2019
 * 地下水脈の穴：手持ちが全滅した状態でタッグバトルに勝利したとき、手持ちの回復処理を行う
 *
 * -r03r0301.ev
 *
 *  担当：斉藤(マ)
 */
#define BUGFIX_AF_GFBTS2019_100930

/*
 * SYSTEM97
 * R13：カザカミの天候中にキャモメイベントを進めるとはまる
 *
 * -r13.ev
 *
 *  担当：斉藤(マ)
 */
#define BUGFIX_AF_SYSTEM97_101014

//*****************************************************************************
//--スクリプト不具合修正コメント　ここまで↑
// 定義をコメント化しても、修正が未反映にはならないのでご注意ください
//*****************************************************************************

//*****************************************************************************
//--BTSにアップされていない不具合
//*****************************************************************************

/*
  ボックスからステータス画面を呼び出すときのワーク初期化修正
  詳細：
    ステータス画面の呼び出しに使用するワークに、一部初期化していないメンバーが
    あるため、ステータス画面を呼び出した際、すぐに抜けてしまうなどの不具合が
    発生する場合があります。
*/
//#define BUGFIX_AF_BOX00_20100806

/*
  レポート画面のRTC取得関連をGFLIBの処理に変更
  詳細：
    RTC取得関連で、SDKの関数を直接使用にているため、
    取得できなかった場合に表示がおかしくなるので、GFLIBの処理に変更
*/
//#define BUGFIX_AF_REPORT00_20100806


/*
  ロットチェック違反防止
  詳細：
    TGID変更しない処理は地下の為にあったが、現状は必要ないので封鎖した
*/

//#define BUGFIX_AF_GF_TGID_20100806

/*
  ロットチェック違反修正
  詳細：
    WIFIクラブログアウト時にはセーブが必須
*/

//#define BUGFIX_AF_GF_CLUBSAVE_20100806


/*
  dwc_initの最初のエラーは初期化時しか出さないように修正
  詳細： DS本体情報が壊れた時に出すエラーをその時だけに抑制しないと、画面が乱れる
*/
//#define BUGFIX_AF_GF_DWCINITERR_20100812

/*
     ゲームシンクアップロード時にはNoerrをたてる必要がある
     これにより通信エラーが起きてもセーブを続行する為
*/
//#define BUGFIX_AF_GF_GSYNC_NOERROR_20100812

/*
  ロットチェック
  ２０１０８のエラーはWIFILoginIDがきえる
  ログインを繰り返す場合、DWC_CheckHasProfileを調べなおす修正が必要である
*/
//#define BUGFIX_AF_GF_LOGIN_20108_20100812

/*
  レシーブバッファのアライメント修正
  本来３２ビットアライメントが必要
  GFLIBの修正も必要  net_system.c 230
*/

//#define BUGFIX_AF_GF_BUFF32_20100812

/*
  親機の割り込みでハンドルを消さないように修正
*/
//#define BUGFIX_AF_GF_HANDLE_20100812


/*
  日韓バージョン以外で、メッセージスピード設定を「はやい」以上にした場合
  観覧車デモのメッセージ描画速度が異常にゆっくりになってしまうバグの修正
*/
#define BUGFIX_AF_MSGSPEED_DEMO3D_20100806

/**海外版に向け、PM_DEBUGでくくったところ**/
/*
gym_dragon.c      738行目
gym_ground_ent.c  177行目
gum_insect.c      1016行目
以上のファイルでデバッグ処理が有効になっていた箇所がありましたので、PM_DEBUGでくくりました。
日本版では、デバッグ機能が有効な状態ですが、実害が無かったためそのままにしてありました。
*/

/*

  GFBTS1996の状態でノイズを１００％発生させると、フリーズします。

  GFBTS1996はLANケーブルやAP電源抜きのには対処されておりますが、
  ノイズ１００％のときは対処されております。
  下記定義をはずしますと、ノイズ１００％のときも対処いたします

*/
//#define BUGFIX_AF_BTLVIDEO00_20100806

//国、地域の不正チェックが足りていない
#define BUGFIX_COUNTRY_NGCHECK_20100806

/**海外版に向け、ソースにコメント追記した所**/
/*
Signedで取得する必要がある MSGSPEED_GetWait()の戻り値を、
Unsignedの変数に取得してしまっているが、現状変数が未使用のために
実害がない箇所に関して、注意喚起のためのコメントを残した

src/field/field_comm/beacon_view.c _sub_DataSetup()内 710行目付近
src/app/beacon_detail/beacon_detail.c _sub_DataSetup()内 453行目付近
*/


/*
 * 文字列比較ルーチンのミス（途中まで一致しているだけで完全一致とみなしてしまう場合がある）修正
 *
 * 担当：田谷
*/
#define BUGFIX_AF_GFBTS2022_100929


/*
 * とくせい「しぜんかいふく」持ちの入れ替えAIにて、
 * 控えにいるひん死ポケモンを入れ替え対象に選んでしまうことがあるのを修正。
 *
 * 担当：田谷
*/
#define BUGFIX_AF_GFBTS2026_101006

/*
 * レベルアップと同時に努力値の加算でパラメータが増加する際、
 * クライアント側データに正しい値が設定されない（HPなどがサーバ側より１低い状態になる）不具合の修正
 *
 * 担当：田谷
*/
#define BUGFIX_AF_GFBTS2028_101007


/*
 *  フィーリングチェックの仕様変更。（任天堂様、TPC様と検討していた０点になってしまう問題）
 *  １、シンクロチェックでタッチ操作ミスが起こったときに専用のメッセージを表示
 *  ２、結果表示画面で、０～９点のとき、メッセージ変更。
 *
 *  ２においては、GMMにて変更するので、コミット済みです。
 *  ですので、以下のdefineをなくしても２のみ反映されてしまいます。
 *
 *  担当：名木橋
 */
#define BUGFIX_AF_FEELING_CHECK_SCORE_101015

/*
 * 使用するDSを変更してWi-Fiクラブに接続し、Wi-Fiユーザー情報を更新した後、
 * Wi-Fiコネクションから切断することを告げるメッセージが表示されません。
 * フレンドが0人の状態でWi-Fiクラブに初回接続する場合も同様です。
 *
 *  担当：大野さんから引き継いで名木橋
 */
#define BUGFIX_AF_SYSTEM175_101021

/*
 *■System #165
 *
 *【通信エラー表示中に回転しているリンクのSEが鳴り続ける】
 *
 * ABが対戦相手のサーチを行い、Aが「対戦相手を　探すのを　やめますか？」で
 * 「はい」を選択と同時にB側で「相手との　接続が　切断されました」のエラー
 * が発生した際、対戦相手サーチ画面で回転しているリンクのSEが通信エラー表示
 * 中でも鳴り続けています。
 * 日本版BTS7759の再報告です。
 *
 *  担当：名木橋
 */
#define BUGFIX_AF_SYSTEM165_101021


/*
  ポケモンドリームワールドの修正
  アカウント作成時にセーブデータを一緒に更新する事で、PGLのサービス導入がしやすくなる
  新しいクリエイト命令を使用することで対応する
  TPCサポートセンター様からの要望
  担当：大野

 */


#define BUGFIX_GFBTS2030_20101025

/*
 * GFBTS 1969
 * 強制移動水流の移動終着点にエフェクトエンカウントが発生していても、
 * 特殊エンカウントイベントが起動しない不具合を対処
 *
 */
#define BUGFIX_GFBTS1969_101022

/*
> ■System #188
> 【不正な名前のエラーをシミュレートするとはまる】
> 
> 認証サーバエラーシミュレータを用いて不正な名前エラーを設定した状態で
> ふしぎなおくりものをWi-Fiから受け取ろうとするとはまります。
> 
> →dwc_rap.c の mydwc_HandleError関数内でDWCからerrorType
> 　DWC_ETYPE_SHUTDOWN_ND が返るとはまります。
> 　サービスロケータに障害が発生すると、はまることになります。
> 　ご確認お願いいたします。
*/
#define BUGFIX_AF_SYSTEM188_20101102

/*
 * SYSTEM 177：【テキストをボタン（もしくはタッチ）で送ると、送りカーソルが残る】
 *
 * ゆめのカケラを受け取っていない状態でのテキスト（GSYNC_014）をボタンで送ると、
 * 4行目のテキストを送った後に、送りカーソルが残ったままになりテキストウィンドウに
 * 送りカーソルが2つ表示された状態になってしまいます。
 * 
 * →ローカライズ作業の際に発見されました。
 *   日本語版では行送りタグが使用されていないため、発生しません。
 *   またポケモンリスト・技思い出し画面でも発生するとの事で一緒に修正します。
 * 
 * 適用箇所: 
 * src/net_app/mystery/mystery_util.c
 * src/app/pokelist/plist_message.c
 * src/app/waza_oshie/wo_main.c
 */
#define BUGFIX_AF_SYSTEM177_20110107

/*
 * System #207 【生まれたシキジカのフォルムが必ずはるのすがたになっている】
 *
 * シキジカのタマゴを受け取ってタマゴを孵すと、
 * 季節にかかわらず必ずフォルムNo.0(はるのすがた)で生まれてしまいます。
 *
 * タマゴを受け取った直後に、手持ちポケモンのフォルムを季節と一致するようにセットします。
 * （図鑑登録は行いません。）
 */
#define BUGFIX_AF_SYSTEM207_20101104

/*
 * SYSTEM 247: 【協力者がミッション条件を達成してハイリンクに戻って来た際、テロップがテキストだけ残して先に消えてしまう】
 *
 * 3人で受注可能なミッションを開始させて協力者がクリア条件を達成した場合、いったん自分のハイリンクに戻されますが、
 * そのときにAボタンを連打していると上画面上側の現在地を知らせるテロップがテキストだけ残して先に消えてしまい、
 * 不自然な状態でテキストだけが表示されてしまいます。
 *
 * 修正箇所:
 * src/field/event_mapchange.c
 *
 * ※ローカライズ作業中に発見されたバグです。
 */
#define BUGFIX_AF_SYSTEM247_20110209


/*
 * SYSTEM92 【ショップで「やめる」にカーソルを合わせると「たんけんセット」が表示される】
 *
 * 韓国版にて、ショップの購入画面で「やめる」にカーソルを合わせると、
 * 「たんけんセット」が表示されてしまいます。
 *
 * 修正箇所：
 * src/field/scrcmd_shop.c
 */
#define BUGFIX_AF_SYSTEM92_20110208


/*
 * SYSTEM303 【同じ階層でカーソルが2箇所に表示される】
 *
 *
 *
 * ポケモンにメールを持たせる際のメール内容の編集画面で、編集するメールの行を示す枠と
 * 下画面右下に表示されている「けってい／やめる」のアイコンは、ボタン操作を行うとカーソルが
 * 一巡しますが、編集するメールの行を示す枠にカーソルが表示されている時に、Bボタンで
 * 「やめる」を決定して再度Bボタンで「キャンセル」を行うと、同じ階層内で「やめる」とメールの
 * 行の2箇所にカーソルが表示されてしまいます。
 *
 * 修正箇所：
 * src/app/mail/mailview.c
 */
#define BUGFIX_AF_SYSTEM303_20110209


/*  SYSTEM214 【海外版がアイテムミッションを達成しても、ターゲット側で隠された道具を拾えません】
 *
 *  バグ内容：
 *    ハイリンクにて、海外版が侵入者としてアイテムミッションを行ない、
 *    指定された場所にアイテムを隠してミッションを達成しても、
 *    海外・日本版のターゲット側では、隠されたアイテムを取得することができません。
 *
 *
 *  原因：
 *    名前が7文字の侵入者がアイテムを隠した場合、
 *    ターゲット側で名前が誤って不正と判断されてアイテムが保存されずに捨てられていました。 
 *
 *  修正リビジョン：45672
 *  修正ファイル  ：intrude_save.c
 *  
 */

/*  SYSTEM251 【国名リストの一番下に表示されている「現在のページ」の表示位置が間違っています。】
 *
 *  バグ内容：
 *    GTSに入り、国名から検索している時、国名リストが2ページ以上の場合、
 *    リストの一番下にページ数を示した数字が表示されます（例：１/２）。
 *    このページ数が、ページを繰るための左右の矢印の中央に正しく位置づけられていません。
 *
 *
 *  原因：
 *    ページ表示一が中央にありませんでした。
 *
 *  修正リビジョン：45672
 *  修正ファイル  ：worldtrade_input.c
 *  
 */

/*  SYSTEM258 【ランダムマッチのバトル終了後にある「データをおくっています～」で、タイマーアイコンが回り続けたままはまる事があります】】
 *
 *  バグ内容：
 *
 *    ランダムマッチにて、バトル終了後の勝敗結果画面が表示された後、
 *    プレイヤーの画面には「データを送っています……　しばらくおまちください」と表示されますが、
 *    次のシーケンスに移行せずにそのままはまってしまう事があります。*
 *
 *
 *  原因：
 *    エラーの対処処理が抜けておりました。
 *
 *  修正リビジョン：45672
 *  修正ファイル  ：dwc_error.c
 */

/*  SYSTEM260 【「OK！」ボタンに使用されているアイコンが、「EXIT」や「BACK」などに使用されるUターン矢印のアイコンになっています。】
 *
 *  バグ内容：
 *    GTSのバトルビデオの「番号で検索」というセクションで、
 *    「OK!」というテキストのすぐ隣に表示されているアイコンが
 *    「EXIT」というテキストのアイコン（Uターン矢印）と同一であるため、不適切です。 
 *
 *
 *  原因：
 *    OBJのアニメシーケンス番号が異なっておりました。
 *
 *  修正リビジョン：45672
 *  修正ファイル  ：br_codein_disp.c
 */

/*  SYSTEM266 【預けられているポケモンの情報画面で、「おや」の表示が最大幅の時に5文字目の右側が欠けてしまう】 
 *  
 *  バグ内容：
 *    預けられているポケモンの情報画面にて、
 *    「おや」のテキスト表示が日本語親名の5文字（最大幅）の場合、
 *    5文字目の右側が欠けてしまいます。
 *
 *  原因：
 *    BMPWINの幅が足りませんでした。
 *
 *  修正リビジョン：45672
 *  修正ファイル  ：worldtrade_mypoke.c
 */

/*  SYSTEM284 【表示される数字がない時、空白に表示される場合について】
 *  
 *  バグ内容：
 *    ハイリンクに留まった時間を表示する部分の
 *    「[33:07:L_DoubleQuot.][2:01:2digits:0:]:[2:01:2digits:1:]」の「[33:07:L_DoubleQuot.]」と
 *    「[2:01:2digits:0:]」の間が実機上で数字が1の位の数の場合、
 *    10の位の数を表示する部分が空白に表示され分かち書きが入ったように見えますので
 *    記号と数字の配置に違和感があります。このままで問題ないでしょうか。
 *
 *  原因：
 *    仕様上問題はありませんでしたが、空白をやめて、０で埋めるように致しました。
 *
 *  修正リビジョン：45672
 *  修正ファイル  ：monolith_status.c
 */

/*  SYSTEM322 【GTS再接続後「選ぶ」を押すとブラックアウトする】
 *  
 *  バグ内容：
 *    一度検索しており、「選ぶ」が押せる状況にて、
 *    他のポケモンを検索して通信エラーが起きた場合に、
 *    再接続選択階層からGTSに入り「選ぶ」を押すとブラックアウトしてはまります。
 *
 *  原因：
 *    通信エラー時検索結果をクリアしていないことから、おせてはいけない選ぶが押せる状況になっておりました。
 *
 *  修正リビジョン：45672
 *  修正ファイル  ：worldtrade_search.c
 */

/*  SYSTEM311 【「すごいつりざお」を使用すると、主人公の姿が地面に表示される】
 *  
 *  バグ内容：
 *    水面の下部が、湿原と地面の境界の近くにある際、
 *    その位置に主人公を立たせて水面に向かって「すごいつりざお」を使用すると、
 *    主人公の足元の地面に反転した主人公の姿が表示されます。
 *
 *  原因：
 *    地形要因により、釣り中の64x64サイズの映りこみ動作モデルを表示した際
 *    地形よりも映りこみモデルのプライオリティが高くなってしまうことが原因でした。
 *
 *    プライオリティ制御そのものを改修することが困難なため
 *    釣り時に自機のグリッド座標Z+1のアトリビュートの映りこみフラグがOffの場合
 *    釣りフォルムチェンジ中は、映り込みを非表示にする対処を行いました
 *
 *  修正ファイル  ：
 *    field/fldmmdl.c.h
 *    field/fldeff_reflect.c
 *    field/event_fishing.c
 *    field/event_battle.c
 */

/*  SYSTEM128 【ミュージカルホールでポケモンのパフォーマンスの写真を保存しようとすると、ゲームがフリーズします。】
 *  
 *  バグ内容：
 *    <ドイツ語><フランス語><イタリア語><スペイン語>
 *    ミュージカルホールのワイヤレスセクションで、ポケモンのショーが終わった後、パフォーマンスの写真を保存しようとするととまりが発生します。
 *    表示されるエラーメッセージは以下の通りです：
 * 
 *    ****ASSERTION FAILED****
 *    printsys.c(317)
 *    que running job==NULL
 * 
 *    再現手順:
 *    1. ミュージカルホールに入り、ＩＲとワイヤレスデスクに行きます。
 *    2. 「他のチームのメンバーとパフォーマンスを行う」を選択し、表示される指示に従います。
 *    3. パフォーマンスを行います。
 *    4. ショーの最後で、プレイヤーＡ（チームリーダー）とプレイヤーＢ（チームメンバー）は、ショーの写真を保存するよう指示が表示されます。
 *    5. プレイヤーＡとＢは、「ＹＥＳ」（はい）を選択します。（プレイヤーＢが先に「ＹＥＳ」を選択します。）
 *    7. プレイヤーＡのゲーム機で、とまりが発生します。
 *    尚、チームリーダー（プレイヤーＡ）はＤＳi/DSi XLを使って上記の問題を再現することができませんでした。親機が英語、子機がフランス語と英語の組み合わせにて、
 *
 *  原因：
 *    PrintQueのクリア忘れ
 *
 *  修正リビジョン：45780
 *  修正ファイル  ：mus_shot_info.c
 */
#define BUGFIX_AF_SYSTEM128_20110216

 
/*  SYSTEM173 【ミュージカルの結果発表終了直前で通信が切断されるとはまる】
 *  
 *  バグ内容：
 *    親機が英語、子機がフランス語と英語の組み合わせにて、
 *    ミュージカルの通信プレイを行ったとき、オーナーの
 *    結果発表の際に、それぞれの個人評価を終えた後、
 *    オーナーのセリフが英語側で先に表示され暗転し
 *    カウンターから出た後に、フランス語側でまだオーナーの一度検索しており、「選ぶ」が押せる状況にて、
 *    セリフが表示されている時にフランス語の通信が切断されると、他のポケモンを検索して通信エラーが起きた場合に、
 *    英語の親機、子機が一切のボタン操作/タッチ操作を受け付けず再接続選択階層からGTSに入り「選ぶ」を押すとブラックアウトしてはまります。
 *    はまってしまいます。
 *
 *  原因：
 *    メッセージの長さが違うため、終了タイミングがずれてしまうせいでした。
 *
 *  修正リビジョン：45780
 *  修正ファイル  ：c04r0202.ev
 *                ：musical_scr_def.h
 */
#define BUGFIX_AF_SYSTEM173_20110216  //検索用のためコメントアウトしても反映されません

 
/*  SYSTEM180 【ドレスアップ終了後、控え室からステージに切り替わる暗転中に子機の通信が切れると、とまります】
 *  
 *  バグ内容：
 *    ミュージカルの赤外線通信にて親機、子機1台以上ででプレイし、
 *    ドレスアップ終了後、楽屋の画面になりオーナーの台詞
 *    『準備が　できた　みたいですねえ　それでは　舞台へ　あがりましょう！』
 *    が表示された後、ステージに切り替わる時に子機がソフトリセットを行って
 *    通信が切断されると、親機、子機共に暗転のままとまります。
 *    
 *  原因：
 *    通信エラーの状態で初期化が走り、NetID取得で255が帰ってきてしまっていたため
 *
 *  修正リビジョン：45780
 *  修正ファイル  ：musical_evemt.c
 */
#define BUGFIX_AF_SYSTEM180_20110216

 
/*  SYSTEM277 【ポケシフターでポケモンを転送中、親機のセーブでエラーが発生すると、ポケモンが消滅することがある】
 *  
 *  バグ内容：
 *    ポケシフターで捕獲ゲームを完了後、ポケモンを転送する際のセーブ中において、ミュージカルの赤外線通信にて親機、子機1台以上ででプレイし、
 *    親機が最後の1ページを除いてセーブを完了した後子機が最後の1バイト以外のドレスアップ終了後、楽屋の画面になりオーナーの台詞
 *    セーブを完了する前に親機のバックアップアクセスができなくなると『準備が　できた　みたいですねえ　それでは　舞台へ　あがりましょう！』
 *    （接触不良、ROMのサブ基板抜き等）と、転送していたポケモンが消滅します。が表示された後、ステージに切り替わる時に子機がソフトリセットを行って
 *    通信が切断されると、親機、子機共に暗転のままとまります。
 *    [2010/11/10 15:32]
 *    実機だとROMを抜いた場合停止するので、文言を修正しました。
 *
 *  原因：
 *    最終セーブ許可フラグの送信前にバックアップのチェックが無いため
 *
 *  修正リビジョン：35823
 *  修正ファイル  ：mb_parent_sys.c
 */
#define BUGFIX_AF_SYSTEM277_20110216

/*  SYSTEM262 【てんそうマシンを使う際にゲームカードが子機本体に挿入されていない場合、プレイヤにエラーメッセージが表示されますが、プレイヤがそのエラーメッセージを読む前にメッセージが画面から消えてしまいます。】
 *  
 *  バグ内容：
 *    1. メインメニューから「Relocator」を選びます。
 *    2. ゲームカードが挿入されていない別の本体を立ち上げます。
 *    3. 別の本体からDSダウンロードプレイデータを受け取ります。 そうすると、子機のプレイヤにエラーメッセージが表示されるますが、そのエラーメッ
 *    
 *    備考：本不具合は、Poke Transferを使った時には発生しません。
 *    
 *
 *  原因：
 *    親機にメッセージが出るのに子機にも出ていたので、子機側を出なくして、親機のメッセージを補足します。
 *
 *  修正リビジョン：45836
 *  修正ファイル  ：mb_movie_sys.c //マルチブート子機のソースです。
 *                  multiboot_parent.gmm
 *                    MSG_MB_PAERNT_MOVIE_21・MSG_MB_PAERNT_MOVIE_24
 */
#define BUGFIX_AF_SYSTEM277_20110217


/*
> ■System #217
> 【侵入者がワープゾーンからハイリンクを退出すると同時にターゲットが
> 　Cギアの「WIRELESS」アイコンをタッチすると、ターゲットがとまる】
> 
> 侵入者がハイリンク内にあるワープゾーン（自分のハイリンク、
> 他人のハイリンク問わず）からハイリンクを退出すると同時に
> ターゲットがCギアの「WIRELESS」アイコンをタッチすると、
> ターゲットの画面が暗転し、とまってしまいます。
> 
> ・「WIRELESS」以外で発生するかどうかは未確認です。
> 
> →NETのモードを切り替える際に dev_wireless オーバーレイが
> 　一瞬アンロードされますが、その間に「WIRELESS」アイコンを
> 　タッチすると、アンロードされた関数を呼び出して止まります。


  通信終了時に 通信のオーバーレイ先にある関数を呼んでしまうタイミングがございました。
  担当：大野

 */

#define BUGFIX_AF_SYSTEM217_20101101




/*
> ■System #259
対戦ルールの表示が一部正しく反映されていない】
Wi-Fiクラブでの対戦ルールを決める際に、親機が条件を満たさないルールを以下のように選択すると、
条件を満たさない旨を表示する画面でミラクルシューターの有無が正しく反映されていません。
▽話しかけた場合
1.条件を満たさないルールを選択する。
2.再度条件を満たさないルールのまま、ミラクルシューターの有無を変更する。
3.ミラクルシューターの有無が変更されたことが反映されていない。
▽モニターから募集した場合
1.条件を満たさないルールを選択し、募集を終了する。
2.再度、ミラクルシューターの有無を変更をした上で、条件を満たさないルールを選択する。
3.ミラクルシューターの有無の表示が、1で設定していたものが表示される。"
  条件文の修正を行いました
  担当：大野

 */


#define BUGFIX_AF_SYSTEM259_20110219

/*
> ■System #274

【画面隅に無関係なボタンのタッチ判定がある】
以下の箇所にて、タッチスクリーン左下のボタンアイコンが配置されていない箇所に、
画面右下に配置されているボタンアイコンのタッチ判定があります。
＜簡易会話入力画面＞
メッセージの種類選択アイコン左辺りをタッチすると、画面右下の「決定」
「やめる」ボタンがタッチされたことになります。
＜Cギア/IRトップ画面、対戦トップ画面及び、WIRELESSトップ画面＞
画面左下をタッチすると画面右下の矢印ボタン(もどるボタン)がタッチされたことになります。"
  */

#define BUGFIX_AF_SYSTEM274_20110219



/*
> ■System #325
"【ボイスチャット中にAPの電源を抜いて通信エラーを発生させると、BGMとSEが再生されなくなる】
Wi-Fiクラブで友達と「ボイスチャット」を行なっている間に
APの電源ケーブルを抜いて通信エラーを発生させると、
Wi-Fiクラブに再接続した時および再接続せずにポケモンセンターに戻った時、
BGMならびにSEが再生されません。"

  */

#define BUGFIX_AF_SYSTEM325_20110219


/*  SYSTEM200 【ミュージカルの赤外線通信の挙動について。】
 *  
 *  バグ内容：
 *    ミュージカルの赤外線通信を行った際、親機・子機がマッチングし強度アイコンがワイヤレス通信に切り替わった瞬間に親機の接続を切ると、子機側にて通信エラーが表示されますが、エラーテキストを送ると
 *    『赤外線通信　および
 *    　ＤＳワイヤレス通信を　開始しますか？』
 *    が表示され、再度赤外線通信を開始することが出来ますが仕様でしょうか。
 *    
 *
 *  原因：
 *    エラー処理がワイヤレスの場合スクリプト内で行われていたのに、赤外線は別のprocで処理していたため、
 *    ミュージカル側でエラーを拾えなかった。
 *    irc_matchでエラーをフラグとして取得するように修正
 *
 *  修正リビジョン：45874
 *  修正ファイル  ：net_app/irc_match/ircbattlematch.c
 *                  field/scrcmd_musical.c
 *                  resource/fldmapdata/script/musical_scr.ev
 *                  resource/fldmapdata/script/musical_src_local.h
 *                  net_app/irc_match.h
 *
 *
 */
#define BUGFIX_AF_SYSTEM200_20110221



/*
SYSTEM330
セーブの際、バックアップへの書き込みに失敗するととまる不具合修正

原因
gflib/src/backup/flash_access.c : (241)
GFL_FLASH_SAVEASYNC_Main 関数から PMSVLD_SaveError 関数が
呼び出される場合です。GFL_FLASH_SAVEASYNC_Main で CARD_UnlockBackup
したロックIDを PMSVLD_SaveError でさらに CARD_UnlockBackup しており、
OS_Panic します。
gflibのみ修正              修正担当：大野
  
*/

#define BUGFIX_AF_SYSTEM330_20110301

/*
nobts 10
BTS7759 の対処が、FINALROM版でコンパイルが通りません。

原因  BTS7759の対処として、サウンド停止命令を使用しましたが、
そのヘッダがデバッグビルド時しかインクルードされないようになっていたためでした。
デバッグ状態でなくてもインクルードされるように修正いたしました。

              修正担当：名木橋
  
*/

/*
SYSTEM230
地球儀アプリでシンガポールの辺りに白い点が１ドット存在する。

原因
実際に地球儀のテクスチャーに１ドット塗られていない場所がありました。
テクスチャーを修正し、
resource/wifi_earth/wifi_earth.narc
の更新を行いました。
ソースコード修正は無いため、bugfix.hとnarcのみセットでコミットします。
*/

/*
  NOBTS3
  s8 以上で受けるべき、MSGSPEED_GetWait()の戻り値をu8で受けているために
  ローカライズ版でメッセージスピードがマイナス値を取った場合に
  描画速度が異様にゆっくりになってしまうバグの修正

  MSGSPEED_GetWait()を呼び出しているものの、実際には取得した戻り値を
  参照していないソースもあり、その場合はコメントを入れるのみに留めてある

  スワンで該当するアプリに手をいれる場合に実修正を行う予定
  検索キーは "<localize>"
  src/app/mail/mailview.c 実修正アリ
  src/app/trainercard/trcard_sys.h  コメントのみ
  src/app/wifi_node/wifi_note.c コメントのみ
  src/net_app/wificlub/wifi_p2pmatch_message.c コメントのみ
 */

/*
 NOBTS 1
 捕獲チュートリアルにおいて、
 アララギ博士がボール投げるときのメッセージ msg_cappture_demo_02 の後、
 エフェクトの終了待ちをしていないため止まります。

 原因　ボール投げ時に BTLEFF_CAMERA_INIT のエフェクトを追加しているが、
 次のシーケンスでメッセージ待ちしかしていない為、仮に短いメッセージだと、
 ボール投げエフェクト[BTLEFF_BALL_THROW]を起動できない。
 
 対処方法　エフェクト終了待ちを追加
 修正担当　一楽
 */

/*
 NOBTS 4
 codeinのフォント生成時のmonoSpaceFlagがTRUEになっているため、
 ボタンテキストのセンタリングがずれています。

 原因　monoSpaceFlagの引数がTRUEだと、文字幅を等幅で計算してしまうので、
 実際の文字幅と関数で取得する文字幅がことなってしまう。
 例）[OK]は実際には12ドットだが、関数だと24ドットになってしまっていた。

 対処方法　monoSpaceFlagの引数をFALSEに変更
 修正担当　一楽
 */

/*
 NOBTS 5
 DWC_ETYPE_SHOW_ERRORの時（サービスロケータのエラー等）に、
 エラーコードが表示されていなかったのを修正
 確認方法　Wi-Fiコネクションエラーシミュレータを使用して、
「名前チェックでNG」を設定し、WIFIクラブに接続してください。
 修正したものはエラー番号が表示されるはずです。

 原因　switch文の分岐で、DWC_ETYPE_SHOW_ERRORの場合にメッセージが違った為

 対処方法　switch分岐でDWC_ETYPE_SHOW_ERRORの場合にエラーメッセージ変更
 修正担当　一楽
 */

/*
 NOBTS 6
 コールバック引数設定(単発) で指定した引数が、次の1文字では使用されないように変更

 原因 プリントストリームのコールバック関数を設定した場合に、そのコールバック関数に
 渡す引数がある。1度使用して、次に使用する際に、引数が変わらないようになっている。

 対処方法　コールバック関数の戻り値を見て、FALSE(=次の処理へ)が返ってくると、引数を戻す
 修正担当　一楽
 */

/*
 NOBTS 7
 [潜在バグ]
 PRINTSYSの1フレーム複数文字表示の問題。1フレーム2文字表示の場合、
 ・1文字目でコールバックがTRUEを返しても、2文字目が描画される
 ・1文字目でウェイトが設定されても、2文字目でウェイトがリセットされる
 という問題があります。

 原因　文字描画パラメータによってfor文で2文字目以降も処理してしまっていた。

 対処方法　コールバック関数の引数がTRUE(=待ち)を返してきた場合、強制的にfor文を抜ける
 修正担当　一楽
 */

/*
 NOBTS 2
 バトルメッセージでトレーナータイプを表示する場合であって、
 [1:0E:トレーナー種別名:]の直後に[1:00:トレーナー名:]が来ない場合、
 タグに代入される単語が未初期化メモリの参照により異常になります。
 確認方法　gmmのトレーナ種別名とトレーナ名を入れ替えてみる。

 原因　[トレーナ種別名]と[トレーナー名]のタグは単語を取得するのに
 clientIDが必要。このclientIDを取得する引数として、argIdxを使用している。
 このargIdxは次のタグに行くと増えてしまうため、clientIDがずれてしまう。
 そのclientIDをずらさない為に、タグ[トレーナー種別名]がきたら、argIdxDecをインクリメントし、
 argIdx-argIdxDecをすることで、clientIdがずれるのを防いでいた。
 しかし、この方法だと、[トレーナー種別名]→[トレーナー名]という順番しかいけなくなる。
 この順番を変えると本来のclientIDではないところを参照してしまい、最悪止まる。

 対処方法　事前に[トレーナー種別名]のタグを検索し、それ以降のargIdxを1減らす
 修正担当　一楽
 */


/*
 PRODUCT01
 戦闘に参加したポケモンには全員に努力値が割り振られるはずだが、
 GFBTS2028は実際には戦闘に勝ったときに場にいたポケモンが取得する努力値が戦闘参加ポケモンに振られていてた。
 これは、大爆発などで先頭ポケモンが瀕死になってしまうと、後ろのポケモンに努力値が加算されなくなる
 誤動作を引き起こす。

 ■修正ファイル
   src/battle/btl_server_flow.c
   src/battle/btl_client.c
 ■修正：田谷、（スワンでコミット）森

 */
#define BUGFIX_AF_PRODUCT01_110722


/*
  ポケモンドリームワールドの変更
  特定の状況でシンクIDコードを登録するとPDWとBWでポケモンの状態が不統一になる
「体験版」状態にて、ポケモンを寝かせていない状態の「ホワイト」のシンクIDコード
登録後、「PDW」に移動すると、直前に寝かせていたポケモンが「PDW」中で寝ている
状態となっています。
これにより体験版で得たアイテムが消失する時があります
  担当：大野

 */


#define BUGFIX_GFBTS2029_20101021

/*
 * GFBTS1112【 ジムリーダー、特殊な人物エンカウントに使用されているカットインの
 *             人物名文字色の文字影色が不自然です。】
 *  
 *  バグ内容：エンカウントエフェクトのカットインで、名前の文字影色に指定が違う。
 *            見た目のバグです。
 *            アサートや止まるといった症状はでません。
 *
 *  原因：src/field/enc_cutin_no.c の文字影色指定が違うため。
 *
 *  修正 リビジョン ：59945
 *  修正 ファイル   ：enc_cutin_no.c
 *
 *  データの修正なのでバグフィックスは定義しておりません。
 *
 *  修正担当：一楽
 *
 */


/*
  滝下りイベント開始時に、波エフェクトを非表示にし、
  イベント終了時に再度復帰させる処理を追加
  担当：尾上

 */
#define BUGFIX_GFBTS232_20120120


/**
 * System116
 * 【PWTのタイプエキスパートのルールが、実際の挙動と説明文で異なります】
 * タイプエキスパートの拡張レギュレーションにフリーフォール禁止を追加
 * 
 */
#define BUGFIX_SYSTEM116_20120420


/**
 * System160
 *【隠しキャラの間違ったセリフ】
 * 隠しキャラに呼び出しポイントで電話をかける前に、
 * ママに電話をかけてからすぐ隠しキャラに電話をかけると、
 * 主人公の名前ではなく場所名を呼びます。
 * 
 */
#define BUGFIX_SYSTEM160_20120421

/**
 * System157
 *【Cギア/LCDオフモード/はまり】
 *
 * レーダーアイコンをタッチした際のアニメーション中に
 * ・LCDオフにする(本体を閉じる)
 * ・CTRのHOMEボタンを押す
 * と、ゲーム復帰後に調査レーダー画面遷移イベントのシーケンスが進行しなくなり
 * にCGearがパッシブのままハマりが発生します
 * 
 */
#define BUGFIX_SYSTEM157_20120421

/*
  SYSTEM131
  【全言語：ポケウッド上映選択画面でシナリオを切り替えた時にグラフィック化けが起きる】

  上映選択画面で選択状態を「魔法の国の 不思議な扉」から「OL The Giant！！」や「忘れえぬ 記憶」に
  切り替えた時、切り替え先の上画面にあるロゴ上半分にグラフィック化けが起きます。

  修正ソース: src/app/pkwd_selectscreen/pkwd_screenselect.c
*/
#define BUGFIX_SYSTEM131_20120424

/**
 * System54
 *【Wi-Fi経由のおもいでリンクを行った際、エラーコード00000が表示されることがあった】
 * BWセーブデータ取得の１０分タイムアウトの際、エラーメッセージが指定されていません。
 * 
 */
#define BUGFIX_SYSTEM54_20120501
