//==============================================================================
/**
 * @file    link_festival_local.h
 * @brief   リンクフェスティバル
 * @author  iwasawa
 * @date    2010.12.16
 */
//==============================================================================

#pragma once

//==============================================================================
//  構造体定義
//==============================================================================
///リンクフェスティバル　管理領域
struct _LINK_FESTIVAL{
  FEST_MISSION  mission;  //現ミッションデータ

  u32 beacon_wait;  ///frame
  u32 beacon_timer; //frame

  u16 log_num;
  u16 log_idx;
  LINKFEST_LOG  log[LINKFEST_LOG_MAX];
  LINKFEST_LOG  last;  //最後のミッションログ

  u16 finfo_score;  //フィールドで表示しているスコア
};

