//======================================================================
/**
 * @file	local_tvt_local_def.h
 * @brief	非通信テレビトランシーバー 定義
 * @author	ariizumi
 * @data	09/11/02
 *
 * モジュール名：LOCAL_TVT
 */
//======================================================================
#pragma once


#include "app/local_tvt_sys.h"

#include "local_tvt_type_def.h"
//======================================================================
//	define
//======================================================================
#define LIST_DRAW_CNT (15)
#define POKELIST_DRAW_CNT (15)

