//[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[
/**
 *
 *	@file		local_tvt_script.h
 *	@brief  ローカルライブキャスタースクリプトモードでの動作（WBまでのローカルライブキャスターの処理）
 *	@author	Toru=Nagihashi
 *	@data		2011.01.07
 *
 */
//]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]
#include "local_tvt_chara.h"

//=============================================================================
/**
 *					定数宣言
*/
//=============================================================================

//=============================================================================
/**
 *					構造体宣言
*/
//=============================================================================
typedef struct _LOCAL_TVT_SCRIPT  LOCAL_TVT_SCRIPT;

//=============================================================================
/**
 *					プロトタイプ宣言
*/
//=============================================================================
extern LOCAL_TVT_SCRIPT* LOCAL_TVT_SCRIPT_Init( HEAPID heapID, GAMEDATA *gamedata, u16 scriptID, LOCAL_TVT_CHARA_SYS *chara_sys );
extern void LOCAL_TVT_SCRIPT_Term( LOCAL_TVT_SCRIPT *work );
extern BOOL LOCAL_TVT_SCRIPT_Main( LOCAL_TVT_SCRIPT *work );
