//[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[
/**
 *
 *	@file		local_tvt_callmode.c
 *	@brief  ローカルライブキャスター呼び出しモード
 *	@author	Toru=Nagihashi
 *	@data		2011.01.13
 *
 */
//]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]
//システム
#include <gflib.h>
#include "system/main.h"
#include "system/gfl_use.h"

//アーカイブ
#include "arc_def.h"
#include "message.naix"
#include "font/font.naix"

//自分のモジュール
#include "local_tvt_local_def.h"
#include "local_tvt_chara.h"
#include "local_tvt_graphic.h"

//外部参照
#include "local_tvt_callmode.h"


//=============================================================================
/**
 *					定数宣言
*/
//=============================================================================

//=============================================================================
/**
 *					構造体宣言
*/
//=============================================================================
//-------------------------------------
///	メインワーク
//=====================================
struct _LOCAL_TVT_CALL
{
  int dummy;
};

//=============================================================================
/**
 *					プロトタイプ宣言
*/
//=============================================================================
//----------------------------------------------------------------------------
/**
 *	@brief  呼び出しモード作成
 *
 *	@param	HEAPID heapID ヒープID
 *	@param	*p_gamedata   ゲームデータ
 *	@param	*p_chara_sys  キャラシステム
 *
 *	@return ワーク
 */
//-----------------------------------------------------------------------------
LOCAL_TVT_CALL * LOCAL_TVT_CALL_Init( HEAPID heapID, GAMEDATA *p_gamedata, LOCAL_TVT_CHARA_SYS *p_chara_sys )
{
  LOCAL_TVT_CALL* p_wk  = GFL_HEAP_AllocClearMemory( heapID, sizeof(LOCAL_TVT_CALL) );

  return p_wk;
}
//----------------------------------------------------------------------------
/**
 *	@brief  呼び出しモード破棄
 *
 *	@param	LOCAL_TVT_CALL *p_wk ワーク
 */
//-----------------------------------------------------------------------------
void LOCAL_TVT_CALL_Exit( LOCAL_TVT_CALL *p_wk )
{
  GFL_HEAP_FreeMemory( p_wk );
}
//----------------------------------------------------------------------------
/**
 *	@brief  呼び出しモードメイン処理
 *
 *	@param	LOCAL_TVT_CALL *p_wk  ワーク
 *
 *	@return TRUE終了  FALSE継続
 */
//-----------------------------------------------------------------------------
BOOL LOCAL_TVT_CALL_Main( LOCAL_TVT_CALL *p_wk )
{
  return FALSE;
}
