#! ruby -Ks

=begin
 伝説級&幻ポケモンリスト
 手打ちです
 
 開発ナンバーはmonsno_hash.rbから引いてください

 ・図鑑完成チェックから省く、配布のみでしか入手できない幻ポケモンのリスト
 ・伝説級ポケモンリスト(幻除く)
 
 !このテーブルを編集することがある場合、同時に下記テーブルを編集する必要があります！

 prog/src/savadata/zukan_savedata.c 
   check_ZenkokuCompMonsno()->cub_check_monsno[] #全国図鑑完成チェックから除くポケモンリスト
   check_LocalCompMonsno()->cut_check_monsno[] #地方図鑑完成チェックから除くポケモンリスト
=end

  #全国図鑑幻ポケモン
	$monsname_maboroshi_tbl = [ 
		"ミュウ",
		"セレビィ",
		"ジラーチ",
		"デオキシス",
		"フィオネ",
		"マナフィ",
		"ダークライ",
		"シェイミ",
		"アルセウス",
		"ビクティニ",
		"ケルディオ",
		"メロエッタ",
		"ゲノセクト",
 ]	
  #イッシュ限定図鑑幻ポケモン
	$monsname_maboroshi_local_tbl = {
		"ビクティニ",
		"ケルディオ",
		"メロエッタ",
		"ゲノセクト",
	}
  #全国伝説級ポケモン(幻とは重複しない)
  $monsname_legend_tbl = [ 
    "フリーザー",
    "サンダー",
    "ファイヤー",
    "ミュウツー",
    "ライコウ",
    "エンテイ",
    "スイクン",
    "ルギア",
    "ホウオウ",
    "レジロック",
    "レジアイス",
    "レジスチル",
    "ラティアス",
    "ラティオス",
    "カイオーガ",
    "グラードン",
    "レックウザ",
    "ユクシー",
    "エムリット",
    "アグノム",
    "ディアルガ",
    "パルキア",
    "ヒードラン",
    "レジギガス",
    "ギラティナ",
    "クレセリア",
    "コバルオン",
    "テラキオン",
    "ビリジオン",
    "トルネロス",
    "ボルトロス",
    "レシラム",
    "ゼクロム",
    "ランドロス",
    "キュレム",
  ]
