//[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[
/**
 *
 *	@file		habitat_list_save.c
 *	@brief  せいそくちリストセーブデータ
 *	@author	Toru=Nagihashi
 *	@data		2011.07.22
 *
 */
//]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]
#include <gflib.h>
#include "savedata/save_tbl.h"

#include "savedata/medalbox.h"

#include "savedata/habitat_list_save.h"
//=============================================================================
/**
 *					定数宣言
*/
//=============================================================================

//=============================================================================
/**
 *					構造体宣言
*/
//=============================================================================
//-------------------------------------
///	せいそくちリストセーブデータ
//=====================================
struct _HABITATLIST_SAVE
{
  //TODO せいそくちリスト実装者が中のパラメータ決めてください。
  //HABITATLIST_SAVE_WORK_SIZEの大きさで足りなかったら増やしてください
  //あと100byte程度は増やせるはず…。詳しくはblock 70のalignを見てください。
  u8  dummy_data[HABITATLIST_SAVE_WORK_SIZE];
};

SDK_COMPILER_ASSERT( sizeof(HABITATLIST_SAVE) == HABITATLIST_SAVE_WORK_SIZE );

//=============================================================================
/**
 *					プロトタイプ宣言
*/
//=============================================================================
//----------------------------------------------------------------------------
/**
 *	@brief  せいそくちリストセーブを初期化
 *
 *	@param	HABITATLIST_SAVE *p_wk ワーク
 */
//-----------------------------------------------------------------------------
void HABITATLIST_SAVE_Init( HABITATLIST_SAVE *p_wk )
{
  GFL_STD_MemClear( p_wk, HABITATLIST_SAVE_GetWorkSize() );
}

//----------------------------------------------------------------------------
/**
 *	@brief  せいそくちリストのワークサイズを取得
 *
 *	@return ワークサイズ
 */
//-----------------------------------------------------------------------------
int HABITATLIST_SAVE_GetWorkSize( void )
{
  return sizeof( HABITATLIST_SAVE );
}
 
//----------------------------------------------------------------------------
/**
 *	@brief  せいそくちリストのセーブワークを取得
 *
 *	@param	SAVE_CONTROL_WORK *p_sv   セーブコントロールワーク
 *
 *	@return せいそくちリストのセーブワーク
 */
//-----------------------------------------------------------------------------
HABITATLIST_SAVE* SaveData_GetHabitatListSave( SAVE_CONTROL_WORK *p_sv )
{
  MEDALBOX* p_medal_box = SaveData_GetMedalBox( p_sv );
  return MEDALBOX_GetHabitatListSave( p_medal_box );
}
