//[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[
/**
 *
 *	@file		medalbox_local.h
 *	@brief  メダルボックスセーブデータ定義
 *	@author	Masayuki Onoue
 *	@date		2011.01.13
 *
 * 2011.10.27 debugでの参照のためセーブデータ構造体定義を切り離した
 */
//]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]

#pragma once

//=============================================================================
/**
 *					構造体宣言
*/
//=============================================================================

//-------------------------------------
///	メダル構造体
//=====================================
typedef struct {
  u16   get_year :7;        ///< 取得年(0-99)
  u16   get_month :4;       ///< 取得月(1-12)
  u16   get_day :5;         ///< 取得日(1-31)

  u16   medal_state : 3;    ///< メダル状態(MEDAL_STATE_～の定義を参照）
  u16   is_new :1;          ///< 新着フラグ
  u16   padding :12;
}MEDAL_ST;


//-------------------------------------
///	メダルボックスデータ構造体
//=====================================
struct _MEDALBOX{
  MEDAL_ST  medal[MDLID_MAX]; ///< メダルデータ
  u8        push_medal;       ///< イチオシメダル番号(MEDALID_MAXのとき、存在しない）
  u8        box_rank;         ///< メダルボックスランク(MEDALBOX_RANK_～の定義を参照）
  u8        tutorial_flag;    ///< チュートリアルクリアのフラグ
  u8        padding;

  /**
   * @brief せいそくちリスト用セーブ領域
   * メダルボックス内にせいそくちリストセーブデータを配置する。
   * せいそくちリストワークをPRIVATEにするため構造体を入れずサイズ分だけ確保
   */
  u8        habitat_list_save_area[HABITATLIST_SAVE_WORK_SIZE];
};

