//[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[
/**
 *
 *	@file		person_state.c
 *	@brief  重要人物状態
 *	@author	Toru=Nagihashi
 *	@data		2011.01.19
 *
 */
//]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]
//ライブラリ
#include <gflib.h>

//外部公開
#include "savedata/person_state.h"
//=============================================================================
/**
 *					定数宣言
*/
//=============================================================================
#if PM_DEBUG
#endif //PM_DEBUG

//=============================================================================
/**
 *					構造体宣言
*/
//=============================================================================
//-------------------------------------
///	セーブワーク
//=====================================
struct _PERSON_STATE
{
  u8  state[LOCAL_TVT_PERSON_MAX];
};

//=============================================================================
/**
 *					プロトタイプ宣言
*/
//=============================================================================
//----------------------------------------------------------------------------
/**
 *	@brief  人物状態ワークサイズ取得
 *	@retval 人物状態ワークサイズ
 */
//-----------------------------------------------------------------------------
u32 PERSON_STATE_GetWorkSize( void )
{
  return sizeof( PERSON_STATE );
}
//----------------------------------------------------------------------------
/**
 *	@brief  人物状態ワーク  初期化
 *
 *	@param	void *p_wk_adrs 初期化ワーク
 */
//-----------------------------------------------------------------------------
void PERSON_STATE_Init( void *p_wk_adrs )
{
  GFL_STD_MemClear( p_wk_adrs , sizeof(PERSON_STATE));
}
//----------------------------------------------------------------------------
/**
 *	@brief  人物状態ワーク  ワーク取得
 *
 *	@param	SAVE_CONTROL_WORK *p_sv   セーブワーク
 *
 *	@return 人物状態ワーク
 */
//-----------------------------------------------------------------------------
PERSON_STATE* PERSON_STATE_GetWork( SAVE_CONTROL_WORK *p_sv )
{
#warning TODO
  static PERSON_STATE todo;
  return &todo;
 // return SaveControl_DataPtrGet(p_sv, GMDATA_ID_PERSON_STATE);
}

//----------------------------------------------------------------------------
/**
 *	@brief  人物状態ワーク  ワーク取得CONST版
 *
 *	@param	SAVE_CONTROL_WORK *p_sv   セーブワーク
 *
 *	@return 人物状態ワークCONST版
 */
//-----------------------------------------------------------------------------
const PERSON_STATE* PERSON_STATE_GetWorkConst( const SAVE_CONTROL_WORK *cp_sv )
{
  return PERSON_STATE_GetWork( (SAVE_CONTROL_WORK *)cp_sv );
}
//----------------------------------------------------------------------------
/**
 *	@brief  人物状態ワーク  人物状態設定
 *
 *	@param	PERSON_STATE* p_wk  ワーク
 *	@param	person  人物ID
 *	@param	state   状態ID
 */
//-----------------------------------------------------------------------------
void PERSON_STATE_SetState( PERSON_STATE* p_wk, u16 person, u16 state )
{
  p_wk->state[ person ] = state;
}
//----------------------------------------------------------------------------
/**
 *	@brief  人物状態ワーク  人物状態取得
 *
 *	@param	PERSON_STATE* p_wk  ワーク
 *	@param	person  人物ID
 *
 *	@return 状態ID
 */
//-----------------------------------------------------------------------------
u16 PERSON_STATE_GetState( const PERSON_STATE* cp_wk, u16 person )
{
  return cp_wk->state[ person ];
}
