//[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[
/**
 *
 *	@file		wbt_ex_save.c
 *	@brief  WBT 外部セーブデータ
 *	@author	Toru=Nagihashi
 *	@data		2011.05.17
 *
 */
//]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]
#include <gflib.h>
#include "savedata/save_tbl.h"
#include "savedata/wbt_ex_save.h"
#include "savedata/wbt_download.h"

//=============================================================================
/**
 *					定数宣言
*/
//=============================================================================
// ここをかえたら　save_tbl.hのSAVESIZE_EXTRA_WBTも変えてください
#define WBTEXSAVE_WORK_SIZE (4864)

SDK_COMPILER_ASSERT( WBTEXSAVE_WORK_SIZE <= SAVESIZE_EXTRA_WBT );

//=============================================================================
/**
 *					構造体宣言
*/
//=============================================================================
//-------------------------------------
///	WBT用外部セーブデータ
//=====================================
struct _WBTEXSAVE
{
  WBTDL_DATA wbt_dl_data;
};
enum {
  WBTDL_DATA_SIZE = sizeof(WBTEXSAVE),
};
SDK_COMPILER_ASSERT( WBTDL_DATA_SIZE + 28 <= SAVESIZE_EXTRA_WBT );

//=============================================================================
/**
 *					プロトタイプ宣言
*/
//=============================================================================

//----------------------------------------------------------------------------
/**
 *	@brief  セーブデータワークサイズ取得
 *
 *	@return ワークサイズ
 */
//-----------------------------------------------------------------------------
u32 WBTEXSAVE_GetWorkSize( void )
{
  return WBTDL_DATA_SIZE;
}
//----------------------------------------------------------------------------
/**
 *	@brief  セーブデータワーク初期化
 *
 *	@param	WBTEXSAVE *p_wk 　ワーク
 */
//-----------------------------------------------------------------------------
void WBTEXSAVE_WorkInit( WBTEXSAVE *p_wk )
{
  GFL_STD_MemClear( p_wk, WBTEXSAVE_GetWorkSize() );
}

//=============================================================================
//=============================================================================
//-----------------------------------------------------------------------------
/**
 *  @brief  WBTダウンロードデータの存在チェック
 *
 *	@param	p_wk  ワーク
 *	@return BOOL  TRUEのとき、データが存在する
 */
//-----------------------------------------------------------------------------
BOOL WBTEXSAVE_IsExists( const WBTEXSAVE *p_wk )
{
  u16 crc;
  crc = *(u32*)( ((u8*)p_wk) + sizeof(WBTEXSAVE) - sizeof(u32) );
  return ( crc == GFL_STD_CrcCalc( p_wk, sizeof(WBTEXSAVE) - sizeof(u32) ) );
}

#ifdef  PM_DEBUG
//-----------------------------------------------------------------------------
/**
 *  @brief  WBTダウンロードデータのCRCセット
 *
 *  @param  p_wk
 *
 *  @note   ダウンロードするだけなので、ゲーム内でCRCをセットする機会はないはず
 */
//-----------------------------------------------------------------------------
void WBTEXSAVE_SetCrc( WBTEXSAVE * p_wk )
{
  u32 * crc;
  crc = (u32*)( ((u8*)p_wk) + sizeof(WBTEXSAVE) - sizeof(u32) );
  *crc = GFL_STD_CrcCalc( p_wk, sizeof(WBTEXSAVE) - sizeof(u32) );
}
#endif










