//============================================================================================
/**
 * @file  wbt_save_local.h
 * @brief   WBT用セーブデータ定義
 * @author  tamada@gamefreak.co.jp
 * @date  2011.04.05
 */
//============================================================================================
#pragma once

enum {
  LOCAL_WBTWIN_COUNT_MAX = 19,
};
//------------------------------------------------------------------
/**
 * @brief WBTでセーブする要素
 */
//------------------------------------------------------------------
struct _WBTSAVE{
  ///チャンピオントーナメントを1日1回しか出来ないように制御するためのフラグ
  u32 ChampionTournamentFlag;

  ///各種フラグ用領域（WBTSAVE_FLAG定義を参照）
  u32 flag;

  ///優勝回数カウント（WBTWIN_COUNT定義で指定）
  u16 WinCount[ LOCAL_WBTWIN_COUNT_MAX ];
};

