//============================================================================================
/**
 * @file  wbt_save_local.h
 * @brief   WBT用セーブデータ定義
 * @author  tamada@gamefreak.co.jp
 * @date  2011.04.05
 */
//============================================================================================
#pragma once

//------------------------------------------------------------------
/**
 * @brief WBTでの優勝回数カウンタの数
 *
 * 値としてはWBTWIN_COUNT_MAXと同じであるが、WBT用セーブデータは
 * トライアルハウス用セーブデータに間借りしており、そことの依存を
 * なるべく小さくするため別途定義を作っている。ずれが発生しないよう
 * wbt_save.cの中でSDK_COMPILER_ASSERTを仕掛けている
 */
//------------------------------------------------------------------
enum {
  LOCAL_WBTWIN_COUNT_MAX = 26,

  LOCAL_WBTSAVE_FLAG_MAX = 64,
};
//------------------------------------------------------------------
/**
 * @brief WBTでセーブする要素
 */
//------------------------------------------------------------------
struct _WBTSAVE{
  ///チャンピオントーナメントを1日1回しか出来ないように制御するためのフラグ
  u32 ChampionTournamentFlag;

  ///各種フラグ用領域（WBTSAVE_FLAG定義を参照）
  u8 flag[ LOCAL_WBTSAVE_FLAG_MAX / 8 ];

  ///優勝回数カウント（WBTWIN_COUNT定義で指定）
  u16 WinCount[ LOCAL_WBTWIN_COUNT_MAX ];
};

