//[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[
/**
 *
 *	@file		ctvt_game_balloon.h
 *	@brief
 *	@author		Katsuhiko=Ichiraku
 *	@date		2010.12.14
 *
 */
//]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]
#pragma once

#include "comm_tvt_local_def.h"

//=============================================================================
/**
 *					定数宣言
*/
//=============================================================================

#define BALLOON_MAX             (8)    // 風船の出る個数MAX

//-------------------------------------
///	風船の種類
//=====================================
typedef enum {
  BALLOON_NORMAL,   // 通常顔
  BALLOON_HIT,      // 驚き顔 = HIT時
  BALLOON_BONUS,    // ボーナス顔
} BALLOON_TYPE;


//-------------------------------------
///	風船の大きさ定義
//=====================================
typedef enum {
  BALLOON_SIZE_S = 1,   // 小
  BALLOON_SIZE_M = 2,   // 中
  BALLOON_SIZE_L = 3,   // 大
} BALLOON_SIZE;


//=============================================================================
/**
 *					構造体宣言
*/
//=============================================================================

//-------------------------------------
///	風船用ワーク
//=====================================
typedef struct {

  BOOL      visible;  // 表示フラグ
  GFL_TCB*  tcb;      // タスク

  CTVT_GAME_WORK *p_game_wk; // 親のアドレス

  //========================
  // 風船の表示に関するもの
  GFL_G3D_UTIL      *parent_g3dUtil;  // G3D_OBJ取得用
  u16               unit_idx;         // モデル指定用

  GFL_G3D_OBJSTATUS status;           // OBJ情報
  BALLOON_TYPE      type;             // 種類 (0～2)
  BALLOON_SIZE      size;             // サイズ (1～3)

  // 当たったときのエフェクト用
  s8                alpha;            // α値(0～31)
  fx32              anm_frm;          // アニメフレームカウンタ
  BOOL              anm_flg;          // エフェクトON/OFFフラグ
  fx32              scale;            // 拡大率

  //========================
  // 風船の動きに関するもの
  VecFx32           vec;              // 移動ベクトル
  u16               save_frame;       // 出現したときのフレームの値

} BALLOON_WORK;

//-------------------------------------
///	風船用ワーク  ゲーム2
//=====================================
typedef struct {

  BOOL      visible;  // 表示フラグ
  GFL_TCB*  tcb;      // タスク

  CTVT_GAME_WORK *p_game_wk; // 親のアドレス

  //========================
  // 風船の表示に関するもの
  GFL_G3D_UTIL      *parent_g3dUtil;  // G3D_OBJ取得用
  u16               unit_idx;         // モデル指定用
  GFL_G3D_OBJSTATUS status;           // OBJ情報
  BALLOON_TYPE      type;             // TEX種類 (0～2)
  u8                stage;            // 大きさ段階
  BOOL              is_self;          // 自分の風船か
  u8                cnt;              // 何個目の風船か(0～3)

  u8                interval;         // 風船出現までのインターバル

  // エフェクト用
  fx32              scale_add;        // 1フレームの拡大率加算値
  fx32              scale_max;        // 拡大率MAX
  fx32              scale;            // 拡大率
  BOOL              scale_flg;        // 拡大ON/OFFフラグ

  BOOL              anm_flg;          // エフェクトON/OFFフラグ
  BOOL              effect_ica;       // icaアニメ再生フラグ
  BOOL              effect_ima;       // imaアニメ再生フラグ

  s8                alpha;            // α値(0～31)
  BOOL              alpha_flg;        // αONフラグ

  //========================
  // 風船の動きに関するもの
  s16               ang;              // ゆれる動き用
  u8                ang_state;        // ゆれる状態
  BOOL              ang_flg;          // ゆれるフラグ

} BALLOON2_WORK;


//-------------------------------------
///	風船用ワーク 結果発表画面時
//=====================================
typedef struct {

  BOOL      visible;  // 表示フラグ
  BOOL      effect;   // エフェクトフラグ
  GFL_TCB*  tcb;      // タスク

  CTVT_GAME_WORK *p_game_wk; // 親のアドレス

  //========================
  // 風船の表示に関するもの
  GFL_G3D_UTIL      *parent_g3dUtil;  // G3D_OBJ取得用
  u16               unit_idx;         // モデル指定用
  GFL_G3D_OBJSTATUS status;           // OBJ情報

  // 当たったときのエフェクト用
  s8                alpha;            // α値(0～31)
  fx32              anm_frm;          // アニメフレームカウンタ
  BOOL              anm_flg;          // エフェクトON/OFFフラグ
  fx32              scale;            // 拡大率

  //========================
  // 風船の動きに関するもの
  VecFx32           vec;              // 移動ベクトル
  fx32              max_y;            // 上昇できるMAXのY座標
  u8                rank;             // 順位

} BALLOON_S_WORK;


//=============================================================================
/**
 *					プロトタイプ宣言
 */
//=============================================================================
//----------------------------------------------------------------------------
/**
 *	@brief  風船初期化
 *
 *	@param	p_wk   風船構造体へのポインタ
 */
//-----------------------------------------------------------------------------
extern void CTVT_BALLOON_Init( BALLOON_WORK* p_wk );

//----------------------------------------------------------------------------
/**
 *	@brief  風船破棄
 *
 *	@param	p_wk   風船構造体へのポインタ
 */
//-----------------------------------------------------------------------------
extern void CTVT_BALLOON_Destroy( BALLOON_WORK*  p_wk );

//----------------------------------------------------------------------------
/**
 *	@brief  風船更新
 *
 *	@param	p_wk   風船構造体へのポインタ
 */
//-----------------------------------------------------------------------------
extern void CTVT_BALLOON_Update( BALLOON_WORK*  p_wk );

//----------------------------------------------------------------------------
/**
 *	@brief  風船描画
 *
 *	@param	p_wk   風船構造体へのポインタ
 */
//-----------------------------------------------------------------------------
extern void CTVT_BALLOON_Draw( BALLOON_WORK*  p_wk );

//----------------------------------------------------------------------------
/**
 *	@brief  風船作成  ゲーム２用
 *
 *	@param	gameWork  ゲームワーク
 *	@param  unit_idx  NetIDのこと
 *	@param  visible   表示・非表示
 *	@param  heapID    ヒープID
 *
 *	@return 作成したワーク
 */
//-----------------------------------------------------------------------------
extern BALLOON2_WORK* CTVT_BALLOON2_Create( CTVT_GAME_WORK *gameWork, u16 unit_idx, BOOL visible, HEAPID heapID );

//----------------------------------------------------------------------------
/**
 *	@brief  風船破棄  ゲーム２用
 *
 *	@param	BALLOON2_WORK *p_wk  ワーク
 */
//-----------------------------------------------------------------------------
extern void CTVT_BALLOON2_Delete( BALLOON2_WORK *p_wk );

//----------------------------------------------------------------------------
/**
 *	@brief  風船更新  ゲーム２用
 *
 *	@param	BALLOON2_WORK *p_wk  ワーク
 */
//-----------------------------------------------------------------------------
extern void CTVT_BALLOON2_Update( BALLOON2_WORK *p_wk );

//----------------------------------------------------------------------------
/**
 *	@brief  風船描画  ゲーム２用
 *
 *	@param	BALLOON2_WORK *p_wk  ワーク
 */
//-----------------------------------------------------------------------------
extern void CTVT_BALLOON2_Draw( BALLOON2_WORK *p_wk );

//----------------------------------------------------------------------------
/**
 *	@brief  風船大きくなるor破裂
 *
 *	@param	BALLOON2_WORK *p_wk ワーク
 *
 *	@return TRUEで破裂
 */
//-----------------------------------------------------------------------------
extern BOOL CTVT_BALLOON2_Burst( BALLOON2_WORK *p_wk );

//----------------------------------------------------------------------------
/**
 *	@brief  風船がタッチできる状態(=補充中ではない)か取得
 *
 *	@param	BALLOON2_WORK *p_wk 
 *
 *	@return TRUEでタッチできる状態
 */
//-----------------------------------------------------------------------------
extern BOOL CTVT_BALLOON2_GetActive( BALLOON2_WORK *p_wk );

//----------------------------------------------------------------------------
/**
 *	@brief  風船を揺らす  タッチした時の演出
 *
 *	@param	BALLON2_WORK *p_wk 
 */
//-----------------------------------------------------------------------------
extern void CTVT_BALLOON2_SetSwing( BALLOON2_WORK *p_wk );

//----------------------------------------------------------------------------
/**
 *	@brief  風船作成  結果発表用
 *
 *	@param	gameWork  ゲームワーク
 *
 *	@return 作成した風船ワーク
 */
//-----------------------------------------------------------------------------
extern BALLOON_S_WORK* CTVT_BALLOON_S_Create( CTVT_GAME_WORK *gameWork, u16 unit_idx, u8 rank, fx32 max_y, HEAPID heapID );

//----------------------------------------------------------------------------
/**
 *	@brief  風船破棄  結果発表用
 *
 *	@param	BALLOON_S_WORK *p_wk  ワーク
 */
//-----------------------------------------------------------------------------
extern void CTVT_BALLOON_S_Delete( BALLOON_S_WORK *p_wk );

//----------------------------------------------------------------------------
/**
 *	@brief  風船更新  結果発表用
 *
 *	@param	BALLOON_S_WORK *p_wk ワーク
 */
//-----------------------------------------------------------------------------
extern void CTVT_BALLOON_S_Update( BALLOON_S_WORK *p_wk );

//----------------------------------------------------------------------------
/**
 *	@brief  風船描画  結果発表用
 *
 *	@param	BALLOON_S_WORK *p_wk 
 */
//-----------------------------------------------------------------------------
extern void CTVT_BALLOON_S_Draw( BALLOON_S_WORK *p_wk );

