//[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[
/**
 *
 *	@file		ctvt_game_balloon.h
 *	@brief
 *	@author		Katsuhiko=Ichiraku
 *	@date		2010.12.14
 *
 */
//]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]
#pragma once

#include "comm_tvt_local_def.h"

//=============================================================================
/**
 *					定数宣言
*/
//=============================================================================

#define BALLOON_MAX             (12)    // 風船の出る個数MAX

//-------------------------------------
///	風船の色定義
//=====================================
typedef enum {
  COLOR_R,  // 赤
  COLOR_B,  // 青
  COLOR_G,  // 緑
  COLOR_Y,  // 黄
} BALLOON_COLOR;

//-------------------------------------
///	風船の種類
//=====================================
typedef enum {
  BALLOON_NORMAL,   // 通常顔
  BALLOON_HIT,      // 驚き顔 = HIT時
  BALLOON_BONUS,    // ボーナス顔
} BALLOON_TYPE;


//-------------------------------------
///	風船の大きさ定義
//=====================================
typedef enum {
  BALLOON_SIZE_S = 1,   // 小
  BALLOON_SIZE_M = 2,   // 中
  BALLOON_SIZE_L = 3,   // 大
} BALLOON_SIZE;


//=============================================================================
/**
 *					構造体宣言
*/
//=============================================================================

//-------------------------------------
///	風船用ワーク
//=====================================
typedef struct {

  BOOL      visible;  // 表示フラグ
  GFL_TCB*  tcb;      // タスク

  CTVT_GAME_WORK *p_game_wk; // 親のアドレス

  //========================
  // 風船の表示に関するもの
  GFL_G3D_UTIL      *parent_g3dUtil;  // G3D_OBJ取得用
  u16               unit_idx;         // モデル指定用

  GFL_G3D_OBJSTATUS status;           // OBJ情報
  BALLOON_COLOR     color;            // 色 (0～3)
  BALLOON_TYPE      type;             // 種類 (0～2)
  BALLOON_SIZE      size;             // サイズ (1～3)

  // 当たったときのエフェクト用
  u8                alpha;            // α値(0～31)
  u8                alpha_cnt;        // α値カウント用

  //========================
  // 風船の動きに関するもの
  VecFx32           vec;              // 移動ベクトル
  u16               save_frame;       // 出現したときのフレームの値

} BALLOON_WORK;

//=============================================================================
/**
 *					プロトタイプ宣言
 */
//=============================================================================
//----------------------------------------------------------------------------
/**
 *	@brief  風船初期化
 *
 *	@param	p_wk   風船構造体へのポインタ
 */
//-----------------------------------------------------------------------------
extern void CTVT_BALLOON_Init( BALLOON_WORK* p_wk );

//----------------------------------------------------------------------------
/**
 *	@brief  風船破棄
 *
 *	@param	p_wk   風船構造体へのポインタ
 */
//-----------------------------------------------------------------------------
extern void CTVT_BALLOON_Destroy( BALLOON_WORK*  p_wk );

//----------------------------------------------------------------------------
/**
 *	@brief  風船更新
 *
 *	@param	p_wk   風船構造体へのポインタ
 */
//-----------------------------------------------------------------------------
extern void CTVT_BALLOON_Update( BALLOON_WORK*  p_wk );

//----------------------------------------------------------------------------
/**
 *	@brief  風船描画
 *
 *	@param	p_wk   風船構造体へのポインタ
 */
//-----------------------------------------------------------------------------
extern void CTVT_BALLOON_Draw( BALLOON_WORK*  p_wk );

