
:: =====================================================
::	@file		com_del_ev.bat
::  @brief  コメントを削除したevファイルを生成する
::  @author		Masayuki Onoue
::  @data		2010.11.04
:: =====================================================

:: =====================================================
:: prompt.batから自らを起動する処理
:: =====================================================
if "%1" == "" goto call_cmd
goto EX

:call_cmd
../../../../prompt.bat cmd %0 ex
goto end

:: =====================================================
:: 実際の処理
:: =====================================================
:EX
@echo on
@echo copy_ev_start..
cd script
ruby copy_com_del_ev.rb
@echo copy_ev_end
cd ..

:end
Pause


