//[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[
//
//
//   @file		habitat_zone_main_def.h
//   @brief   生息地リスト：ゾーン詳細画面用データ定義
//   @author	Masayuki Onoue
//   @date		2011.08.13
//
//
//]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]
#pragma once

//=============================================================================
//
//					定数宣言
//
//=============================================================================

// 定義ヘッダー
enum
{
  // メッセージ表示場所
  LAND_MSG_POS_X = 8,
  LAND_MSG_POS_Y = 4,
  LAND_MSG_POS_W = 240,
  LAND_MSG_POS_H = 32,
  SEASON_MSG_POS_X = 40,
  SEASON_MSG_POS_Y = 52,
  SEASON_MSG_POS_W = 32,
  SEASON_MSG_POS_H = 16,
};
