//[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[
//
//
//   @file		habitat_zone_main.h
//   @brief   生息地リスト：ゾーン詳細（メイン）
//   @author	Masayuki Onoue
//   @date		2011.08.11
//
//
//]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]
#pragma once

//=============================================================================
//
//					定数宣言
//
//=============================================================================
enum
{
  POKEICON_ROW      = 3,  // リストの行数
  POKEICON_LINE     = 5,  // リストの列数
  POKEICON_START_X  = 48, // リストの開始X座標
  POKEICON_START_Y  = 88, // リストの開始Y座標
  POKEICON_MARGIN_W = 40, // 横のアイコンまでの距離
  POKEICON_MARGIN_Y = 32, // 下のアイコンまでの距離
};

//=============================================================================
//
//					プロトタイプ宣言
//
//=============================================================================
extern BOOL HABITAT_ZONE_Main( HABITAT_ZONE_WK *p_wk );
