//[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[
//
//
//   @file		medal_info_beacon.h
//   @brief   ビーコン情報からメダル詳細画面を構築するアプリ
//   @author	Masayuki Onoue
//   @date		2011.07.22
//
//
//]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]
#pragma once

#include <gflib.h>
#include "gamesystem/gamesystem.h"

//=============================================================================
//
//					プロトタイプ宣言
//
//=============================================================================
//-------------------------------------
/// PROC　データ
//=====================================
extern GFL_PROC_DATA beacon_medalInfo_ProcData;

//-------------------------------------
///	PROCに渡す引数
//=====================================
typedef struct
{	
	GAMESYS_WORK		*gsys;	//[in]ゲームシステム
	GAMEDATA				*gdata;	//[in]ゲームシステム
  u8              target; //リストのトップに表示する
  u8              ret_mode; //TRUEならCギアに戻る
}BEACON_MEDALINFO_INIT_PARAM;

