//============================================================================
/**
 *
 *	@file		pkwd_record_monitor.h
 *	@brief  ポケウッド記録モニター
 *	@author	ichiraku_katsuhiko
 *	@data		2011.09.12
 *
 */
//============================================================================
#pragma once
//	lib
#include <gflib.h>

//system
#include "gamesystem/gamesystem.h"

//field
#include "field/wbt.h"

//save
#include "savedata/wbt_save.h"
#include "savedata/mystatus.h"
#include "savedata/pokewood_savedata.h"

//=============================================================================
/**
 *					外部公開
*/
//=============================================================================
//オーバーレイ領域の指定
FS_EXTERN_OVERLAY( pkwd_record_monitor );

extern const GFL_PROC_DATA PkwdRecordMonitorProcData;

//=============================================================================
/**
 *								定数定義
 */
//=============================================================================

//=============================================================================
/**
 *								構造体定義
 */
//=============================================================================
//-------------------------------------
///	PROCに渡す引数
//=====================================
typedef struct
{	
	MYSTATUS          * mystatus;    ///< ポケモン情報参照用
	POKEWOOD_SAVEDATA * pokewood_sv; ///< フラグチェック用
}PKWD_RECORD_MONITOR_PARAM;
