//============================================================================
/**
 *
 *	@file		pkwd_count.h
 *	@brief  ポケウッドカウント
 *	@author	tamada
 *	@date		2011.03.02
 *
 * 2011.03.02 ui_templateから派生、作成開始
 *	@note   1.ファイルをコピペします。
 *	@note   2.UITemplate / UI_TEMPLATE / ui_template をアプリ名にリネームしてください。
 *	@note   3.HEAPID_UI_DEBUG をアプリ用のヒープに書き換えてください。
 *	@note   4.不要な要素を外します
 *
 */
//============================================================================
#pragma once
//	lib
#include <gflib.h>

#include "field/wbt.h"
//system
#include "gamesystem/gamesystem.h"
#include "savedata/wbt_save.h"
#include "savedata/mystatus.h"

//=============================================================================
/**
 *					外部公開
*/
//=============================================================================
//オーバーレイ領域の指定
FS_EXTERN_OVERLAY( pkwd_announce );

extern const GFL_PROC_DATA PkwdCountProcData;

//=============================================================================
/**
 *								定数定義
 */
//=============================================================================
//=============================================================================
/**
 *								構造体定義
 */
//=============================================================================
//-------------------------------------
/// クリア状態
//-------------------------------------

// PKWD_COUNT
typedef struct{
	int					title_no;		///< タイトル番号
	int					scenario_no;	///< シナリオ番号
	STRBUF*				message;		///< メッセージ
}PKWD_COUNT_PARAM;

