
:: =====================================================
::	@file		fes_event_search.bat
::  @brief  フェスイベントが配置されている場所をリスト化する
::  @author	Masayuki Onoue
::  @date		2012.01.30
:: =====================================================

:: =====================================================
:: prompt.batから自らを起動する処理
:: =====================================================
@if "%1" == "" goto call_cmd
goto EX

:call_cmd
@../../../../prompt.bat cmd %0 ex
goto end

:: =====================================================
:: 実際の処理
:: =====================================================
:EX
:: 調べる
@echo 解析中...
ruby fes_event_search.rb fes_event_list.csv
@echo 解析終了！！
@Pause
:end



