
:: =====================================================
::	@file		same_pos_event_check.bat
::  @brief  同じ位置にあるイベントをリストアップするツール
::  @author	Masayuki Onoue
::  @data		2012.02.15
:: =====================================================

:: =====================================================
:: prompt.batから自らを起動する処理
:: =====================================================
@if "%1" == "" goto call_cmd
goto EX

:call_cmd
@../../../../prompt.bat cmd %0 ex
goto end

:: =====================================================
:: 実際の処理
:: =====================================================
:EX
:: 調べる
@echo 解析中...
ruby same_pos_event_check.rb
@echo 解析終了！！
@Pause
:end


