//============================================================================================
/**
 * @file    b_choice.h
 * @brief   ポケウッド選択肢画面 外部公開ファイル
 * @author
 * @date    05.02.10
 */
//============================================================================================
#pragma once

#include "print/printsys.h"


//============================================================================================
//  定数定義
//============================================================================================
// 選択肢
enum{
  BCHOICE_MES_00 = 0,
  BCHOICE_MES_01,
  BCHOICE_MES_02,
  BCHOICE_MES_03,
  //
  BCHOICE_MES_MAX,
};

// 選択肢データ(外部設定データ)
typedef struct {
  GFL_FONT*   font;							///< 使用フォントハンドル
  HEAPID      heap;							///< ヒープID
  //
  u8          end_flg;						///< 終了フラグ(1で終了)
  u8          pad;
  //
  int         mesnum;						///< メッセージ数
  STRBUF*     mesbuffer[BCHOICE_MES_MAX];	///< メッセージバッファ
  //
  int*        result;						///< 選択結果(0-3)
}BCHOICE_DATA;

//============================================================================================
//  プロトタイプ宣言
//============================================================================================

//--------------------------------------------------------------------------------------------
/**
 * @brief   ポケウッド選択肢タスク追加
 *
 * @param   dat   選択肢データ
 *
 * @return  none
 */
//--------------------------------------------------------------------------------------------
extern void BattleChoice_TaskAdd( BCHOICE_DATA * dat );


