
:: =====================================================
:: トレーナーの配置データをチェックする(mev検査)
:: 
:: ・回復トレーナー	視線０でなければならない(ドクターまたはナース)
:: ・一般トレーナー 視線０は原則禁止
:: ・ランダム移動は原則禁止
:: ・視線距離が６以上あるものは注意が必要
::
:: =====================================================

:: =====================================================
:: prompt.batから自らを起動する処理
:: =====================================================
@echo off
if "%1" == "" goto call_cmd
goto EX

:call_cmd
../../prompt.bat cmd %0 ex
goto end

:: =====================================================
:: 実際の処理
:: =====================================================
:EX
@echo off
echo トレーナーデータの配置状態をチェック
cd    ../../resource/fldmapdata/eventdata/check_tool
ruby tr_mev_param_check.rb %~dp0tr_mev_param_check_result.csv %~dp0tr_use_zone_list.csv
echo チェック終了
@echo on

:end
Pause


