//[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[
/**
 *
 *	@file		mb_comm_parent.h
 *	@brief  親機通信処理
 *	@author	Toru=Nagihashi
 *	@date		2011.05.19
 *
 */
//]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]
#pragma once

//=============================================================================
/**
 *					定数宣言
*/
//=============================================================================

//=============================================================================
/**
 *					構造体宣言
*/
//=============================================================================
//-------------------------------------
///	COMM_PARENT
//=====================================
typedef struct _MP_COMM_PARENT MP_COMM_PARENT;

//-------------------------------------
///	初期化引数
//=====================================
typedef struct
{
  int duumy;
} MP_COMM_PARENT_INIT_PARAM;


//=============================================================================
/**
 *					外部公開関数
*/
//=============================================================================
extern MP_COMM_PARENT * MP_COMM_PARENT_SendImage_Init( const MP_COMM_PARENT_INIT_PARAM *cp_param );
extern void MP_COMM_PARENT_SendImage_Term( MP_COMM_PARENT *p_wk );
extern const BOOL MP_COMM_PARENT_SendImage_Main( MP_COMM_PARENT *p_wk );
extern const BOOL MP_COMM_PARENT_IsSendRom( const MP_COMM_PARENT *cp_wk );
