//////////////////////////////////////////////////////////////////////
/**
 *
 * @brief  スクリプトコマンド：リゾートショップ関連
 * @file   scrcmd_resort_shop.h
 * @author Toru Nagihashi （scrcmd_shopを改造して作成）
 * @date   2011.03.03
 *
 */
//////////////////////////////////////////////////////////////////////
#pragma once

//--------------------------------------------------------------------
/**
 *	@brief  汎用リスト
 *
 *	@param	VMHANDLE *p_core 仮想マシンハンドル
 *	@param	*p_wk_adrs       スクリプトコマンドワーク
 *
 *	@return 終了コード
 */
//--------------------------------------------------------------------
extern VMCMD_RESULT EvCmdResortCallList( VMHANDLE *core, void *wk );

