//[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[
/**
 *
 *  @file   fmission_app_gra.h
 *  @brief  フェスミッションアプリ グラフィック設定
 *  @author Miyuki Iwasawa 
 *  @date   2011.04.22
 *
 */
//]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]
#pragma once
#include <gflib.h>

//=============================================================================
/**
 *          定数宣言
*/
//=============================================================================

//=============================================================================
/**
 *          構造体宣言
*/
//=============================================================================
//-------------------------------------
/// グラフィックワーク
//=====================================
typedef struct _FMISSION_APP_GRAWK  FMISSION_APP_GRAWK;

//=============================================================================
/**
 *          プロトタイプ宣言
*/
//=============================================================================
//-------------------------------------
///初期化
//  ディスプレイセレクトにはGX_DISP_SELECT_MAIN_SUB or GX_DISP_SELECT_SUB_MAINを
//  渡してください。途中で書き換えたい場合、GFL_DISP_SetDispSelectを使用して下さい。
//=====================================
extern FMISSION_APP_GRAWK * FMISSION_APP_GRA_Init( int display_select, HEAPID heapID );
//-------------------------------------
///破棄
//=====================================
extern void FMISSION_APP_GRA_Exit( FMISSION_APP_GRAWK *p_wk );
//-------------------------------------
///２D描画
//=====================================
extern void FMISSION_APP_GRA_2D_Draw( FMISSION_APP_GRAWK *p_wk );

//-------------------------------------
///３D描画  ３Dを使わない場合、読んでも何もしません
//=====================================
extern void FMISSION_APP_GRA_3D_StartDraw( FMISSION_APP_GRAWK *p_wk );
extern void FMISSION_APP_GRA_3D_EndDraw( FMISSION_APP_GRAWK *p_wk );

//-------------------------------------
///情報取得 内部で設定したCLUNITを返します  OBJ使わない場合NULL
//=====================================
extern GFL_CLUNIT * FMISSION_APP_GRA_GetClunit( const FMISSION_APP_GRAWK *cp_wk );

//-------------------------------------
///情報取得 内部で設定したカメラを返します  3D使わない場合NULL
//=====================================
extern GFL_G3D_CAMERA * FMISSION_APP_GRA_GetCamera( const FMISSION_APP_GRAWK *cp_wk );
