//[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[
/**
 *
 *	@file		habitat_list_save.h
 *	@brief  せいそくちリストセーブデータ
 *	@author	Toru=Nagihashi
 *	@date		2011.07.22
 *
 */
//]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]
#pragma once

#include "savedata/save_control.h"

//=============================================================================
/**
 *					定数宣言
*/
//=============================================================================
#define HABITATLIST_SAVE_WORK_SIZE    (150)

//=============================================================================
/**
 *					構造体宣言
*/
//=============================================================================
//-------------------------------------
///	せいそくちリストセーブデータ
//=====================================
typedef struct _HABITATLIST_SAVE HABITATLIST_SAVE;

//=============================================================================
/**
 *					外部公開関数
*/
//=============================================================================

// セーブデータの初期化
extern void HABITATLIST_SAVE_Init( HABITATLIST_SAVE *p_wk );

// セーブデータのサイズを取得
extern int HABITATLIST_SAVE_GetWorkSize( void );
 
// セーブデータのポインタを返す
extern HABITATLIST_SAVE* SaveData_GetHabitatListSave( SAVE_CONTROL_WORK *p_sv );
