//[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[
/**
 *
 *	@file		outside_permanent.h
 *	@brief  管理外永続データ
 *	@author	Toru=Nagihashi
 *	@date		2011.05.19
 *
 *	@note   管理外領域にずっと残り続け、そこから使い続けるデータです。
 *	        現在はキーシステムとデータコンバートが該当します。
 *
 */
//]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]
#pragma once

#include "savedata/key_system_save.h"
//=============================================================================
/**
 *					定数宣言
*/
//=============================================================================
//-------------------------------------
///	ワークサイズ
//=====================================
#define OUTSIDE_PERMANENT_WORK_SIZE (KEY_SYSTEM_SAVE_WORK_SIZE)

//=============================================================================
/**
 *					構造体宣言
*/
//=============================================================================
//-------------------------------------
///	セーブデータ
//=====================================
typedef struct _OUTSIDE_PERMANENT OUTSIDE_PERMANENT;

//=============================================================================
/**
 *					外部公開関数
*/
//=============================================================================
extern u32 OUTSIDE_PERMANENT_GetWorkSize( void );
extern void OUTSIDE_PERMANENT_Init( OUTSIDE_PERMANENT *p_wk );

//SaveControl_GetOutsidePermanentを使って取得する

//キーシステムのデータ
extern KEY_SYSTEM_SAVE * OUTSIDE_PERMANENT_GetKeySystem( OUTSIDE_PERMANENT *p_wk );
