//[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[
/**
 *
 *	@file		memory_store.h
 *	@brief  ライブラリをサム化したメモリを蓄えておくためのヘッダ
 *	@author	Toru=Nagihashi
 *	@date		2011.02.05
 *
 */
//]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]
#pragma once
#ifdef PM_DEBUG
#include <gflib.h>

//----------------------------------------------------------------------------
/**
 *	@brief  この関数を呼ぶを無駄にメモリを消費する
 *	        ライブラリをサム化したときに開いたメモリを確保する機構
 */
//-----------------------------------------------------------------------------
static void DEBUG_MEMORY_STORE_Use( void )
{
  static u8 sc_memory_buffer[0x5000];
  sc_memory_buffer[0] = 0;
}

#endif //PM_DEBUG
