//[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[
/**
 *
 *	@file		wbt_download_net.h
 *	@brief  WBTダウンロードプロセス
 *	@author	Toru=Nagihashi
 *	@data		2011.05.10
 *
 */
//]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]
#pragma once

#include <gflib.h>

//=============================================================================
/**
 *					定数
*/
//=============================================================================
//-------------------------------------
///	結果
//=====================================
typedef enum
{
  WBT_DOWNLOAD_NET_RESULT_SUCCESS,        //受信成功
  WBT_DOWNLOAD_NET_RESULT_ERROR,          //通信エラー
  WBT_DOWNLOAD_NET_RESULT_DATA_ILLIGAL,   //データ不整合
} WBT_DOWNLOAD_NET_RESULT;


//データの最大サイズ
#define WBT_DOWNLOAD_MAX_SIZE     (0xE000)

//=============================================================================
/**
 *					プロセス引数
*/
//=============================================================================
//-------------------------------------
///	プロセスへ渡す引数
//=====================================
typedef struct
{
  GAMEDATA  *p_gamedata;      //[in]  ゲームデータ
  void      *p_buffer;        //[in]  データ保存先バッファ
  WBT_DOWNLOAD_NET_RESULT result;  //[out] 終了結果
} WBT_DOWNLOAD_NET_PARAM;

//=============================================================================
/**
 *					プロセスデータ
*/
//=============================================================================
extern const GFL_PROC_DATA WBT_DOWNLOAD_NET_ProcData;
